[
  {
    "id": 38492763,
    "description": "Y Combinator (yes, the people who run this site) | Infrastructure Software Engineer | Bay Area | Full-timeI currently run YC’s infrastructure and I need some help! Over the last 7 years I’ve been at YC, our software team has grown considerably both in engineers and in products. We need to invest more in our infrastructure so we can keep shipping our products quickly.The main thing you’ll need in this job is curiosity; I work at every layer of a very large stack. One day you might dig into AWS apis, another it’s a 3rd party Ruby gem or our git history. Or maybe you get paged that all the SSDs for Hacker News (primary and standby!) died on the same day :) https://news.ycombinator.com/item?id=32028511.The first few months will be heavier on infrastructure work but in the future the job will hopefully be equal parts developer experience, infrastructure work, and product engineering that impacts all of our products (think SSO, sending email, security, etc).The main products we support are all Ruby on Rails apps running in AWS (mostly in ECS); ideally you’ve already worked on apps like that. You have at least 5 years of experience. Part of that was shipping code to customers but you’ve also got cloud experience (we try to mostly use Terraform). You’re probably the person people turn to when there’s a fire to put out.YC has excellent compensation and benefits (see more in the formal job description: https://www.ycombinator.com/companies/y-combinator/jobs/0Ewh...). The team and the work life balance are great. About half of us are former founders and many of us are parents. And if you’re curious about startups (and possibly starting one someday), this job gives you amazing access to interact with YC’s programs, partners, and founders.If you’re interested, I’d love to chat! I’m mark@ycombinator.com.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Bay Area",
      "positions": [
        "Infrastructure Software Engineer"
      ],
      "tech_stack": [
        "Ruby on Rails"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490889,
    "description": "DuckDuckGo - We are looking for candidates that are excited to join us on a mission to raise the standard of trust online. All of our roles are fully-remote, except where specific locations are noted.\nhttps://duckduckgo.com/hiringRemote Open Roles at DuckDuckGo:Senior Infrastructure EngineerSenior Backend EngineerSenior Software Engineer, Windows Desktop AppPrincipal Site Reliability EngineerSenior People Operations ManagerDirector, Public Policyhttps://duckduckgo.com/hiring\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Infrastructure Engineer",
        "Senior Backend Engineer",
        "Senior Software Engineer, Windows Desktop App",
        "Principal Site Reliability Engineer",
        "Senior People Operations Manager",
        "Director, Public Policy"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491097,
    "description": "Datadog | Software Engineers | ONSITE (Boston, Lisbon, Madrid, NYC, Paris, Tel Aviv) and REMOTE | Full-timeDatadog is a monitoring, tracing, logs system, and more, for your infrastructure and services. We build our own tsdb, event store [1][2], distributed tracing tools, cutting edge visualizations, and more. We love shipping great experiences for customers just like us and are growing fast! We write a lot of Go, Java, Python, Typescript (with React), and a bit of other languages. We run on k8s, and are multi-region and multi-cloud.We're looking for people who can build systems at scale as we process trillions of events per day. Let us know if that's you!https://dtdg.co/hnwhoshiring[1] https://www.datadoghq.com/blog/engineering/introducing-husky[2] https://www.datadoghq.com/blog/engineering/husky-deep-dive\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": [
        "Go",
        "Java",
        "Python",
        "Typescript",
        "React"
      ]
    },
    "categorized_tech": [
      "go",
      "java",
      "python",
      "typescript",
      "react"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492761,
    "description": "Zotero | Remote | Full-Time or Part-Time | https://www.zotero.orgZotero is an open-source project that develops software to help people collect, organize, annotate, cite, and share their research. Our software is recommended by most universities and used by millions of students, scholars, scientists, and researchers worldwide.We're looking for a JavaScript developer to work on Zotero \"translators\" — the pieces of code that let people save high-quality metadata and files to their Zotero libraries from across the web with a single click. If you like web scraping, APIs, data formats, and exploring sites in the browser devtools, this would be up your alley. As a core Zotero developer, you'll also have the ability to work across Zotero's vast ecosystem and help shape the future of the project.This is an open-ended contract role that can scale up and down in hours based on availability and workload.https://www.zotero.org/jobs/javascript_developer\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "JavaScript Developer"
      ],
      "tech_stack": [
        "JavaScript"
      ]
    },
    "categorized_tech": [
      "javascript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494045,
    "description": "ReMatter | Engineering | Remote | Full-time | https://rematter.com/careersOur mission is to enhance the sustainability, resilience, and robustness of the global metal supply chain while minimizing its carbon footprint. ReMatter is a scrap metal recycling software company founded by Forbes 30 Under 30 Stanford grads, building modern solutions for the $100B+ scrap metal industry.Our stack includes TypeScript, React, Node, GraphQL, AWS (Lambda, Cognito, S3, RDS), GitHub Actions, and Docker. Experience with our stack is a plus, but we believe in your ability to learn new technologies quickly.Join us to create a meaningful impact on the lives of recyclers. We offer competitive salary, meaningful equity, flexible schedules, remote work, and engaging company events.Apply at:- Software Engineer: https://rematter.com/careers/?ashby_jid=a55462d8-70d8-42ca-9...- DevOps Engineer: https://rematter.com/careers/?ashby_jid=eae31e1a-794f-4149-9...If you don't see a position on our site that fits your skillset or interests, reach out to jobs 'at' rematter.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer",
        "DevOps Engineer"
      ],
      "tech_stack": [
        "TypeScript",
        "React",
        "Node",
        "GraphQL",
        "AWS (Lambda, Cognito, S3, RDS)",
        "GitHub Actions",
        "Docker"
      ]
    },
    "categorized_tech": [
      "typescript",
      "react",
      "nodejs",
      "graphql",
      "docker"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38494527,
    "description": "Stellar Science | Hybrid USA Washington DC, Albuquerque NM | Full time, INTERNS/co-ops | U.S. citizenship required | https://www.stellarscience.comCompany: We're a small scientific software development company that develops custom scientific and engineering analysis applications in domains including: computer vision and image processing, space situational awareness (monitoring the locations, health and status of on-orbit satellites), metamaterials design, image simulation, high power microwave systems, modeling and simulation, machine learning, physics informed neural networks (PINN), human body thermoregulation, laser systems modeling, high performance computing (HPC), computer aided design (CAD), and more. All exciting applications and no CRUD. We emphasize high quality code and lightweight processes that free software engineers to be productive.Experience: We typically look for Bachelors degrees in computer science, physics, engineering, math, or a related field, and also hire Masters and PhDs (roughly 30% of our staff have PhDs.)Technologies: Mostly C++20/23 with coroutines and generators, Qt 6, CMake, Boost, Jenkins, git, OpenGL, CUDA, OpenSceneGraph. Windows and Linux, msvc/gcc/clang/clangcl, Visual Studio 2022 or any productive IDE. Some projects use Python, Java, or Javascript.Apply online at https://www.stellarscience.com/careers/.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Full time",
        "INTERNS/co-ops"
      ],
      "tech_stack": [
        "C++20/23",
        "coroutines",
        "generators",
        "Qt 6",
        "CMake",
        "Boost",
        "Jenkins",
        "git",
        "OpenGL",
        "CUDA",
        "OpenSceneGraph",
        "Python",
        "Java",
        "Javascript"
      ]
    },
    "categorized_tech": [
      "coroutines",
      "generators",
      "qt",
      "cmake",
      "boost",
      "jenkins",
      "git",
      "opengl",
      "cuda",
      "openscenegraph",
      "python",
      "java",
      "javascript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38492202,
    "description": "SmarterDx | 180 - 230K + equity + benefits | Remote first (but U.S. only due to data confidentiality) | Full timeWe are an early stage health tech company using AI to improve hospital revenue cycle (making healthcare costs lower and allowing doctors to focus on patient care). The team is small but high functioning (MD + data scientist combos, former ASF board member, Google and Amazon engineers, Stanford LLM researchers, etc.) and initially scaled the company to $1MM+ in contracted revenue without raising capital.We have been backed by top investors including Floodgate (Lyft, Twitch, Twitter), Bessemer, and are currently on pace to 30X in revenue over a two-year time period.Who we are looking for:- Data scientists- ML Ops- FS Eng (Senior and Staff)- Product designer- Technical PM (not listed yet on careers but we are hiring for this!)Be part of the journey as we hone our PMF and build to scale! For more, see: https://smarterdx.com/careersIf interested email us at hiring at smarterdx dot com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa"
      ],
      "compensation": {
        "min": 180000,
        "max": 230000
      },
      "company_location": null,
      "positions": [
        "data scientist",
        "ML Ops",
        "FS Eng (Senior and Staff)",
        "product designer",
        "technical PM"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data science"
    ]
  },
  {
    "id": 38491263,
    "description": "Turnstile (https://www.tryturnstile.com) | REMOTE (US/Canada) | Engineering | $185k-250k salary + equity---We're a small (24-person) team of repeat founders and seasoned operators building a usage-based revenue platform that helps SaaS companies price however they want. This is a tight-knit and senior crew — most of us have 10-25 years' experience, much of it together.The last company we started, Second Measure (YC S15), scaled to 70+ people and tens of millions in revenue, received multiple “best places to work” awards, and was ultimately acquired by Bloomberg in a landmark deal.We're looking for extraordinary builders to play a foundational role in a company designed for scale:  - Billing Platform Engineer (Staff or higher)\n\nWe're well-funded by top investors (led by First Round Capital), fully distributed, and known for building intentional, inclusive culture. We offer competitive global rates (SF salary + equity), equal pay by level, work flexibility (including a 4-day core schedule), and comprehensive, family-friendly benefits.I'm Mike, one of the founders— if interested, apply here (https://tryturnstile.com/about) and mention this post.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada"
      ],
      "compensation": {
        "min": 185000,
        "max": 250000
      },
      "company_location": null,
      "positions": [
        "Billing Platform Engineer (Staff or higher)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38496894,
    "description": "Phrasing | REMOTE | Europe/Amsterdam | Full-TimeLove languages? Want to leverage AI, LLMs, and ML to topple industry giants like Duolingo & Babbel? What a coincidence, we do to.I'm the technical founder of Phrasing (https://phrasing.app). and have built the MVP using Postgres, Python, and ClojureScript. As more of my responsibilities start to lean towards the business side of things, I find myself increasingly distracted from the big juicy technical problems. I'm looking for a CTO who wants to dedicate everyday to the most exciting technology problems of the decade.I can handle the frontend for quite a while longer, but am looking for help on some backend problem areas including: clustering and analyzing vector embeddings, training predictive models, leveraging LLMs to parse minority languages, aligning multilingual text, & so much more.It's still very early days at the company, but it's never too early to start talking to people excited about the product & mission in the following roles:- Senior Software Engineer- Senior ML Engineer- Senior Mobile Engineer (iOS)- Senior Designer / Senior Product DesignerAt Phrasing, we're driven by the belief that a small, dedicated team can indeed topple industry giants. We are absolutely obsessed with every area of the product, and we seek individuals who share an equal passion for the field, the product, and their craft.If that sounds like you then send an email to hackers@phrasing.app and join us - to fluency, & beyond.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Europe/Amsterdam",
      "positions": [
        "Senior Software Engineer",
        "Senior ML Engineer",
        "Senior Mobile Engineer (iOS)",
        "Senior Designer / Senior Product Designer"
      ],
      "tech_stack": [
        "Postgres",
        "Python",
        "ClojureScript"
      ]
    },
    "categorized_tech": [
      "postgresql",
      "python"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38491900,
    "description": "Socket (https://socket.dev) | Staff Software Engineer & Security Researcher | SF or REMOTE | Full-timeIf you specialize in making computers do things they’re not supposed to do, please drop us a line.Socket's mission is to help developers and security teams to ship faster and spend less time on security busywork. Thousands of organizations use Socket to safely discover, audit, and manage their open source code. Our customers – from Figma to Vercel – absolutely love Socket (just read their tweets to see for yourself! [1])The company was founded by Feross Aboukhadijeh [2], who has worked in open source software for 10+ years writing software that receives more than a billion downloads per month. We have raised $25M in funding [3] from the best angel investors, operators, and security leaders in the industry.We're a small team (~15) but we're already depended on by top companies like Figma, Vercel, Brave, Replit, Expo, Metamask, a massive telecom in Canada, as well as three massive AI companies that you've definitely heard of ;)See all job openings here: https://socket.dev/careers[1]: https://socket.dev/love[2]: https://www.linkedin.com/in/feross/[3]: https://socket.dev/blog/series-a\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada",
        "latin_america",
        "europe",
        "asia",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF",
      "positions": [
        "Staff Software Engineer",
        "Security Researcher"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491617,
    "description": "Rewind (https://rewind.ai) | Full-time | Remote | https://rewind.aiRewind is a personalized AI powered by everything you’ve seen, said, or heard. Our investors include Sam Altman (OpenAI CEO), Alexis Ohanian (Co-Founder of Reddit), and many other tech leaders. We are a well-funded, 17-person, remote-first startup.We are hiring for:Senior/Staff/Principal Engineer (Applied AI) - https://jobs.lever.co/rewind.ai/0af8dbea-ebd2-481b-9fd4-7b34...Senior/Staff/Principal Engineer (React) - https://jobs.lever.co/rewind.ai/6e72b26b-8885-4a49-bb2b-bac0...Senior/Staff/Principal Engineer (Backend) - https://jobs.lever.co/rewind.ai/6c07a0d6-ca7b-426c-a953-2158...Senior/Staff/Principal Engineer (Generalist) - https://jobs.lever.co/rewind.ai/8d48c7a2-d5a3-4a6e-91ba-6342...Senior/Staff/Principal Engineer (Firmware) - https://jobs.lever.co/rewind.ai/c3d7f869-02ba-42fc-b9e8-39f4...Social Media Manager - https://jobs.lever.co/rewind.ai/c0a70d70-c6ef-4c39-8729-ce64...For more information about our benefits and culture (including quarterly retreats, top of the line gear, etc), check out https://rewind.ai/careers\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior/Staff/Principal Engineer (Applied AI)",
        "Senior/Staff/Principal Engineer (React)",
        "Senior/Staff/Principal Engineer (Backend)",
        "Senior/Staff/Principal Engineer (Generalist)",
        "Senior/Staff/Principal Engineer (Firmware)",
        "Social Media Manager"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38493462,
    "description": "Mind AI | (Senior) Software Engineer | Full-Time | REMOTE or ONSITE (Seoul, South Korea) | https://www.mind.ai/ We're Mind AI and pioneering a unique approach in artificial intelligence, moving beyond the dominant approaches and ideas of deep learning and neural networks.To enhance our reasoning engine, a Common Lisp implementation of our patented information interpretation methodology, we are seeking additional team members who have knowledge and practical experience with Common Lisp. More details here: https://mind-ai.notion.site/Senior-Software-Engineer-7f189b1...If you have any questions or wish to apply for the position, please send an email to lisp-job@mind.ai with your inquiries or your resume accompanied by a cover letter.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Seoul, South Korea",
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "Common Lisp"
      ]
    },
    "categorized_tech": [
      "lisp"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38494247,
    "description": "Cardless | https://www.cardless.com/ | San Francisco, Hybrid | Full TimeAt Cardless, we’re building a credit card and loyalty platform that consumer businesses use to engage their customers. We’ve launched 9 credit cards, including for the largest mall operator in the U.S. and the largest airline in South America. We help businesses bring imaginative card programs to life, and have pioneered technology to embed credit card features natively into their products. You can learn more about us at our blog - https://www.cardless.com/blogWe are actively hiring for the following role (compensation is annual base salary):- Senior Software Engineer - Frontend ($160,000 - $200,000 USD): https://jobs.lever.co/cardless/ad23717d-3ae1-4887-8549-b9652...We also expect to have a senior backend engineering role open by the middle of this month. Take a look at our careers page to learn more - https://www.cardless.com/careers#open-roles\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": 160000,
        "max": 200000
      },
      "company_location": "San Francisco",
      "positions": [
        "Senior Software Engineer - Frontend"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491483,
    "description": "Canopy Connect | $160-205k | Full-time | Remote | Product EngineerCanopy Connect is single-click insurance data sharing (like \"Plaid for insurance\").We serve over 3,500 companies (and growing rapidly!) including insurance agencies, lenders, insurtechs, fintechs, and insurance carriers to streamline acquiring verified insurance data from consumers and businesses.We're hiring Product Engineers. We're a small, fully remote team based in the US and Canada. We present the best of both worlds - a nimble startup and small team (low strike price on equity and more ownership/impact), yet derisked because of our capital efficiency.Apply here: https://www.usecanopy.com/company/careers\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "canada",
        "usa"
      ],
      "compensation": {
        "min": 160000,
        "max": 205000
      },
      "company_location": null,
      "positions": [
        "Product Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491211,
    "description": "Skydio - Autonomy Infrastructure | Bay Area - San Mateo | Python & C++Skydio is the leading US drone company and the world leader in aerial autonomy. Our mission is to make the world more productive, creative, and safe with autonomous flight. Today tens of thousands of our robots are flown at scale to inspect critical infrastructure and provide life-saving intelligence, and we have one of the best robotics teams on the planet in support of these goals.Our X10 drone features NVIDIA Orin and Qualcomm 865 processors with 85 TOPS of compute capability, along with onboard 360 trinocular camera coverage. We develop real-time 3D reconstruction and semantic AI so that our robot can understand the world around it and make intelligent decisions.We’re looking for infrastructure engineers for our autonomy team who love making code for flying robots and for making our engineering team more productive. Experience with Python and C++, performance optimization, systems infrastructure, first-principles thinking, 3D visualization, communication and logging. full-stack web apps, and build systems all welcome.I lead the autonomy team and you can reach me at { hayk at skydio dot com }.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Bay Area - San Mateo",
      "positions": [
        "Infrastructure Engineer"
      ],
      "tech_stack": [
        "Python",
        "C++"
      ]
    },
    "categorized_tech": [
      "python",
      "c_cpp"
    ],
    "categorized_positions": []
  },
  {
    "id": 38492508,
    "description": "CareerVillage.org | Software Engineers | REMOTE | Full-timeTech for good: We're a tech nonprofit building an AI Career Coach for education and workforce development customers. We are a well-funded, remote-first 501c3 that has been developing large-scale career platforms for underrepresented youth for over a decade. We've served millions of young people, and are an early mover on AI within the nonprofit space. The stack is Django, Langchain, React. AWS and GCP. Multi-LLM.We have four software engineering positions open: https://boards.greenhouse.io/careervillage\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": [
        "Django",
        "Langchain",
        "React",
        "AWS",
        "GCP"
      ]
    },
    "categorized_tech": [
      "django",
      "react",
      "aws",
      "google_cloud"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492277,
    "description": "ROCKSTAR GAMES | NYC-San Diego-New England| FULL-TIME | .NET SOFTWARE ENGINEERS | Existing Visa Transfers WelcomeA career at Rockstar Games is about being part of a team working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium. You would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the most talented people in the industry.RESPONSIBILITIESDevelop highly scalable server-side features for our online game console clients using object-oriented development in C#, ASP.NET, and SQL Server.Develop back-end services and APIs. Actively practice Test Driven Development (TDD) while developing new features and refactoring existing code.Work in an AWS cloud-based, event-driven microservice architecture with a high priority on web performance optimization.Collaborate with other Rockstar technology teams across our worldwide studios.New York: https://www.rockstargames.com/careers/openings/position/4187...San Diego: https://www.rockstargames.com/careers/openings/position/4110...New England: https://www.rockstargames.com/careers/openings/position/4161...You can see our other openings here: https://www.rockstargames.com/careers/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "NYC-San Diego-New England",
      "positions": [
        ".NET SOFTWARE ENGINEERS"
      ],
      "tech_stack": [
        ".NET",
        "C#",
        "ASP.NET",
        "SQL Server"
      ]
    },
    "categorized_tech": [
      ".net",
      "csharp",
      "asp.net",
      "sql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38497050,
    "description": "Reef Technologies | Senior Python Backend Engineer | REMOTE | Full-time Salary: 45-70 USD per hour, or 7560-11760 USD a month (assuming 40 hours per week). Hourly rates typically adjusted annually.We’re all about the backend! As a fully remote Python software house, we comprise a small, agile team of senior engineers, each with at least five years of experience. We're known for delivering stable solutions and always accounting for edge cases, minimizing the need for urgent fixes.- Full Remote Flexibility: Work from anywhere.- Flexible Hours: Pick your own hours, with only ~2 calls per week.- Dynamic Projects: Work with startups globally on projects of your choice.- Influence: Contribute to decisions and influence how we operate.- Project Selection: Only accept projects you're interested in.- No managers; thanks to the Sociocracy 3.0 framework, everyone's opinion is valued.- Personal assistant for your non-work tasks.- Multicultural environment with a voice for everyone.Who Are We Looking For? Experienced Python engineer with at least 5 years of programming (not necessarily professional), including at least a year with Python. Must have a deep love for Python and the ability to come up with Pythonic solutions to problems.How to Apply: Just go to https://careers.reef.pl/ and see what we’re all about! Do not send us CVs.Contact: Email: hiring@reef.pl Company Website: https://reef-technologies.com/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": 45,
        "max": 70
      },
      "company_location": null,
      "positions": [
        "Senior Python Backend Engineer"
      ],
      "tech_stack": [
        "Python"
      ]
    },
    "categorized_tech": [
      "python"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491241,
    "description": "Datadog | Senior Software Engineer | NYC/Paris/Madrid | Full-Time | Static Analysis\nWe are building a static analysis engine (https://github.com/DataDog/datadog-static-analyzer) that works across the development lifecycle: IDE -> git hook -> git pull request -> git push. Our product is currently in private beta (see https://www.datadoghq.com/static-analysis/) and we are working hard on expanding its capabilities.If you work with Rust and/or Tree-Sitter, we would love to talk to you!Apply here > https://careers.datadoghq.com/detail/5382867/?gh_jid=5382867\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "NYC/Paris/Madrid",
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "Rust",
        "Tree-Sitter"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38494624,
    "description": "IPinfo.io | Various Roles | Remote (Anywhere) | Fulltime / Contract | https://ipinfo.ioIPinfo is a leading provider of IP address data. Our API handles almost 100 billion requests a month, and we also license our data for use in many products and services you might have used. We started as a side project back in 2013, offering a free geolocation API, and we've since bootstrapped ourselves to a profitable business with a global team of over 20, and grown our data offerings to include geolocation, IP to company, carrier detection, and VPN detection. Our customers include T-Mobile, Nike, DataDog, DemandBase, Clearbit and many more.We're looking for exceptional and ambitious people to join our team. The main role we're hiring for currently is a Product Manager - ideally with SaaS/DaaS experience, and a technical understanding of our products / services. Apply here: https://ipinfo.bamboohr.com/careers/45?source=aWQ9Mjg%3DWe're always on the look out to strong software or data engineers with an internet measuremenet / analysis background to join our team too. Any questions about the roles or IPinfo feel free to reach out to me directly at ben@ipinfo.io\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Product Manager"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "product manager"
    ]
  },
  {
    "id": 38496986,
    "description": "ML6 | Machine Learning Engineer, Data Engineer | Python, TensorFlow, PyTorch, GCP, AWS, Azure | Full-time | Amsterdam, Berlin, Ghent (EU) On-site/hybridWe are a Machine Learning consulting company that builds end-to-end Machine Learning solutions. By applying the latest AI research, we keep our clients at the forefront of innovation.If you are interested check out: https://www.ml6.eu/resources/resource-library and https://www.ml6.eu/client-casesWork on innovative projects for the biggest clients across Europe such as Randstad, ASML, FUNKE, and many more! Whether it’s about leveraging LLMs to improve customer support, building data lakes on cloud platforms to improve storage or implementing models using sensor data for quality control. You can find it all at ML6.You will mostly work with Python and a range of ML frameworks such as TensorFlow, PyTorch, or HuggingFace Transformers to solve hard Machine Learning tasks and help bring these application into production by building data pipelines and cloud infrastructure on all of the major cloud providers (GCP, AWS, Azure).We are looking for:• (Senior) Data Engineer• (Senior) Software Engineer• (Senior) Machine Learning Engineer• Alliance Manager – Azure• AI Client Executive• AI Client Partner• AI Project Manager• Talent PartnerApply at: https://ml6.eu/join-us\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Amsterdam, Berlin, Ghent (EU)",
      "positions": [
        "Machine Learning Engineer",
        "Data Engineer"
      ],
      "tech_stack": [
        "Python",
        "TensorFlow",
        "PyTorch",
        "GCP",
        "AWS",
        "Azure"
      ]
    },
    "categorized_tech": [
      "python",
      "tensorflow",
      "pytorch",
      "google_cloud",
      "aws",
      "azure"
    ],
    "categorized_positions": [
      "machine learning",
      "data engineer"
    ]
  },
  {
    "id": 38491966,
    "description": "Sudowrite | REMOTE | Full-Time | Competitive Salary + Equity | Hiring: AI Engineer- We believe the future of writing is AI & human collaboration. Sudowrite is the best AI for creative writers.- We are profitable with a rapidly growing paying user base.- We've been featured in The New York Times, New Yorker, Verge, etc.- We believe new tools will enable a renaissance in art & creativity and we want to help the next generation of storytellers tell better stories.Wanted: AI Engineers (who also write!)- We’re 100% remote and support work-life balance. We meet up in person a few times of year, last time in Hawaii. We encourage diverse candidates from all over the world to apply.- Details: https://sudowrite.notion.site/We-re-hiring-engineers-to-make...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "AI Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38506113,
    "description": "SpruceID (YC W21) | Full REMOTE | Multiple Roles | Full-Time | spruceid.comSpruce lets users control their data across the web. We are creating the world’s best open source software for user-centric digital identity. Instead of users logging into platforms, we think platforms should ask permission to access data vaults controlled by users.We hire programmers who love technology and are committed to intellectual honesty, user privacy, and innovation. Our products are composed from a combination of industry-trusted frameworks, applied cryptography, new interoperable identity standards (W3C, ISO/IEC, IETF, and OpenID), and custom backend libraries.Select roles:Senior Product Manager: Help drive the growth of a new product family which empowers government agencies and enterprises to manage the entire lifecycle of digital credentials for a wide range of use cases. This role will be responsible for developing product vision, roadmap, user stories, timelines, and implementation strategy.Software Engineer, Android: Build software prototypes and product features from start to finish for Android and iOS, embedding our Rust core.See all roles here: https://jobs.lever.co/sprucesystems/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Product Manager",
        "Software Engineer, Android"
      ],
      "tech_stack": [
        "Rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38495309,
    "description": "Ride with GPS | Experienced Linux Systems Engineer | within 2 hours of Portland OR | Full Time | https://ridewithgps.com/about\nWe are the world's largest library of bike routes, and we enable cyclists to go on better rides, more often. We have a website and mobile apps that allow people to discover the best riding in their area, and get turn by turn navigation using either our mobile apps or the bike computer of their choosing. Come join us in taking Ride with GPS to the next level! We have one opening right now:- Linux Systems Engineer: https://ridewithgps.com/careers/systems_engineer - Work the full deployment stack, from hardware to containers. We are looking for an experienced engineer practiced in the deployment of Linux based machines and services on top of them. We run on a rack of machines that we own, co-located in the Pittock, and we deploy services both directly on Linux as well as via containers. This is part SRE, part DevOps, part classic SysAdmin, with the occasional networking issue. We need someone who is within driving distance of our rack in Portland and who has experience working in a datacenter, but the majority of the job is in the deployment of services on those machines, not the machines themselves. Are you a jack of all trades, comfortable occasionally working with hardware, while being highly proficient in Linux and container based deployments? Maybe you are light on modern container orchestration but are highly capable and interested in learning? We'd love to talk to you!\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Linux Systems Engineer"
      ],
      "tech_stack": [
        "Linux"
      ]
    },
    "categorized_tech": [
      "linux"
    ],
    "categorized_positions": []
  },
  {
    "id": 38495008,
    "description": "Afresh | Applied Scientist / Data Scientist / Data Engineer | San Francisco, CA | Full-time | On-site/remote | https://www.afresh.comAfresh builds modern supply chain technology for the challenges of fresh food. Every year, one-third of food produced globally goes to waste. In the United States, 40 percent of food waste occurs at the retail and consumer level. Most of this waste occurs in fresh food departments at grocery stores. Afresh is working to eliminate this waste.Our machine learning team is hiring for three roles at the staff level: data scientist, applied scientist, and data engineer. We work on crunchy machine learning, operations research, and data problems that are hard to find anywhere else. Fresh food is harder than it looks: https://medium.com/afresh-engineering/whats-so-hard-about-or....Please take a look and apply if you're interested!https://boards.greenhouse.io/afresh/jobs/5028533004https://boards.greenhouse.io/afresh/jobs/5017634004[Applied Scientist role coming soon, please comment if interested or refresh our careers page]\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada",
        "latin america",
        "europe",
        "asia",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "San Francisco, CA",
      "positions": [
        "Applied Scientist",
        "Data Scientist",
        "Data Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data science",
      "data engineer"
    ]
  },
  {
    "id": 38497479,
    "description": "gematik GmbH | Different Positions | Berlin, Germany or remote (Germany)Gematik is the national agency for the digitalisation of Healthcare Services. At gematik we are building concepts and products such as the electronic prescription (eRezept), electronic patient records (ePA) and  the central portal for the communication of laboratory analysis (DEMIS).We work with many standards, above all with FHIR and IHEv2, as main stack we work with Java/SpringBoot for backend and JavaScript/Angular for frontend, but it depends on sub teams and other languages or frameworks are also used (Kotlin, Typescript, VueJS, Quarkus).There are many positions opened on the Job Portal, a good level of knowledge of the German language is highly recommended, for some positions it is also mandatory.Site:\n https://www.gematik.de/ueber-uns/karriere\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "germany"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Berlin, Germany",
      "positions": [
        "Different Positions"
      ],
      "tech_stack": [
        "java",
        "springboot",
        "javascript",
        "angular",
        "kotlin",
        "typescript",
        "vuejs",
        "quarkus"
      ]
    },
    "categorized_tech": [
      "java",
      "javascript",
      "kotlin",
      "typescript",
      "vue"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493750,
    "description": "Sourcegraph | REMOTE | Full-Time | Staff Machine Learning Engineer, Machine Learning Engineer, Engineering Manager, Software Engineers, Developer Advocate, Technical Program Manager, Director of Customer Engineering, Enterprise Technical Advisor, Machine Learning Engineer Intern | https://sourcegraph.comSourcegraph is a code AI platform that makes it easy to read, write, and fix code–even in big, complex codebases.We are building Cody, an AI coding assistant that uses code search and code intelligence to help devs quickly understand what's happening in code and generate new code that matches the best practices in your codebase. Cody supports AI-enabled autocompletion, fixing bugs, refactoring, test generation, code explanation, and answering high-level questions. You can read Steve Yegge's (our Head of Eng - Cody) post on why Cody's code context engine differentiates it from the fast-moving field of AI dev tools: https://about.sourcegraph.com/blog/cheating-is-all-you-need.Apply here: https://grnh.se/0572f98b4us\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Staff Machine Learning Engineer",
        "Machine Learning Engineer",
        "Engineering Manager",
        "Software Engineers",
        "Developer Advocate",
        "Technical Program Manager",
        "Director of Customer Engineering",
        "Enterprise Technical Advisor",
        "Machine Learning Engineer Intern"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "machine learning",
      "engineering manager",
      "developer relations"
    ]
  },
  {
    "id": 38506094,
    "description": "Friendly Captcha | Infrastructure Engineer | REMOTE within EU | PART-TIME or FULL-TIME | Office in Munich, Germany | https://friendlycaptcha.comAt Friendly Captcha we do one thing and we do it well: we protect websites from malicious actors and bots.We provide privacy-friendly and accessible anti-bot solutions that don’t annoy users with tasks like clicking fire hydrants. We make the internet a bit better every day by winning over customers currently using Google reCAPTCHA.We’re a fast-growing, profitable, fully bootstrapped company. Our revenue mostly comes from medium to large European enterprise and governments.A great fit would be someone pragmatic, who prefers to keep things simple (perhaps boring is the right word?). Good knowledge of modern DevOps/SRE practices is expected (IaC, GitOps, etc...).Our engineering team is fully remote across Europe, we meet up once per quarter or so. You can work either 4 or 5 days per week, fully remote or (partially) from our Munich office. Please note that we ONLY consider candidates located within the EU.Stack: Golang | Typescript | Clickhouse | Postgres | Redis | Terraform | OpenTelemetryInfrastructure Engineer: https://friendlycaptcha.homerun.co/infrastructure-engineer(Generalist) Software Engineer: https://friendlycaptcha.homerun.co/software-engineer\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Munich, Germany",
      "positions": [
        "Infrastructure Engineer"
      ],
      "tech_stack": [
        "Golang",
        "Typescript",
        "Clickhouse",
        "Postgres",
        "Redis",
        "Terraform",
        "OpenTelemetry"
      ]
    },
    "categorized_tech": [
      "go",
      "typescript",
      "clickhouse",
      "postgresql",
      "redis",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494334,
    "description": "Nobias Therapeutics | Norcal/Mountain View/Palo Alto/SF; Philadelphia, PA; other locations welcome - particularly Boston, MA; Miami, FL; Austin, TX; REMOTE also acceptable (US, Canada, London/England, other countries considered on a case-by-case basis) | Full-Time | salary + equityHello HN!  We have hired a number of people from this monthly \"Who is hiring?\" post.  Please don't be put off by how spare our website is.  We are doing very exciting work at the nexus of biology and computer science, and we would love to talk to you.  If you've reached out recently but haven't heard back, we appreciate your patience as we work through a backlog of submissions.  We have primary offices in Mountain View, CA and Philadelphia, PA - so even though we have a number of remote and hybrid employees, we're particularly excited about hiring local people.Nobias is a new pharma startup using a variety of built-from-scratch, custom AI tools to speed drug development.  As an early stage biotech, we use large repositories of biological data, bleeding edge deep learning techniques, automated reasoning, and computational biochemistry to discover and develop new medicines, diagnostics/biomarkers, and biological insights for a variety of diseases, particularly pediatric rare diseases.  If you have strong programming chops, a background in machine learning, and deep knowledge of biology or computational chemistry, we would love to speak with you.Multiple roles are available - right now we are particularly concentrating on expanding our stable of AI engineers who have deep expertise in modern ML techniques.  You should understand these techniques at the deepest level possible, and be able to extend existing research and construct new concepts from scratch, while also understanding cell and molecular biology very well.  Finally, we are also recruiting for a leader in Translational Research.  This position will focus more on outstanding biology knowledge and the process of moving from concept to validation.[our domain is nobiastx.com - our website is in flux, so please excuse the lack of detail!]Please contact us at hn_recruiting {@} [our domain].\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada",
        "europe",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "AI Engineer",
        "Translational Research Leader"
      ],
      "tech_stack": [
        "machine_learning",
        "biology",
        "computational_chemistry"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491470,
    "description": "TalkJS (https://talkjs.com) | REMOTE (Europe / Middle East / Africa)TalkJS lets developers build a perfect chat feature in mere minutes. We power communication in online marketplaces, community sites, multiplayer apps, trading platforms and so on. We're product driven and we care tremendously about quality.We're headquartered in the Netherlands and our team is spread across the Central European Timezone +/- 3h.Currently particularly looking for:    * Mobile SDK Developer (iOS/Android/React Native/Flutter)\n    * Full-stack Developer (TypeScript/Elixir/Postgres)\n\nIf you enjoy crafting perfect libraries and APIs for other programmers to use, get in touch!TalkJS touches millions of people and is growing quickly. We want to be the tool that every developer thinks of for building communication features, a bit like what Stripe is for payments. 80% of the company is product people, founders are a designer and a programmer.Our strategy is to give great engineers the maximum amount of freedom, so they can ship fantastic SDKs, APIs and features. This means a lot of responsibility, a sane work/life balance, no meetings, no red tape. We're growing, profitable, and not dependent on venture funding. Sound good?More info on all positions + how to apply: https://talkjs.com/jobs/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe",
        "middle_east",
        "africa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Netherlands",
      "positions": [
        "Mobile SDK Developer (iOS/Android/React Native/Flutter)",
        "Full-stack Developer (TypeScript/Elixir/Postgres)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38494980,
    "description": "ReadWorks | Senior Full Stack Engineer (JavaScript) | $100K - $160K | REMOTE from US | Full-time\nReadWorks is an education technology nonprofit and is looking for a Senior Full Stack Engineer (JavaScript) with a passion for education and literacy to join our engineering team. This is a unique opportunity to contribute to an established education platform that serves nearly thirteen million active students and teachers.What you'll be doing: ReadWorks is looking for an engineer to help us build the next generation of literacy technology. This person will work mainly on our user facing web platform (everything under readworks.org). They will work closely with our Teaching, Learning, & Content (TLC) and Product teams to build features and support our users.Technology we use: JavaScript, Node.js, AWS (DynamoDB, Lambda, EC2, CloudFront, S3, etc.),\nSCSS, Vue.jsMore info here: https://about.readworks.org/careers.htmlContact us: engineering at readworks dot org and mention you read the post on Hacker News!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": 100000,
        "max": 160000
      },
      "company_location": null,
      "positions": [
        "Senior Full Stack Engineer (JavaScript)"
      ],
      "tech_stack": [
        "JavaScript",
        "Node.js",
        "AWS",
        "SCSS",
        "Vue.js"
      ]
    },
    "categorized_tech": [
      "javascript",
      "nodejs",
      "aws",
      "vue"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491098,
    "description": "EnergyHub | Senior DevOps Security Engineer (DevSecOps) | Remote (US Only) | Full-time | $145-160k\nWant to work on helping to decarbonize the electric grid and transportation in the US? (the two biggest sectors for impact)Want to do it at scale? (we control over one million devices across the US making up over 1.8 gigawatts of electrical load for utilities that service 1/3rd of the entire US population)EnergyHub’s software makes it easy for millions of smart device owners to partner with their utility and help decarbonize the grid. Our platform lets consumers turn their smart thermostats, electric cars, EV chargers, batteries, and other products into virtual power plants that keep the grid stable and enable higher penetration of solar and wind power. We work on technology that already provides energy and cost savings to millions of people through partnerships with the leading companies in the Internet of Things.All roles are remote but if you like offices we have them in Brooklyn, NY and Burlington, VT.In addition to a great benefits package, compensation also includes RSUs in our parent company, Alarm.com (ALRM)Note that we can NOT sponsor visas at this time.Apply here for DevSecOps Engineer: https://grnh.se/9334115e2usSee all our open roles here (software engineer, QA manager, data engineering manager, etc): https://grnh.se/30f1ece22us\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": 145000,
        "max": 160000
      },
      "company_location": null,
      "positions": [
        "Senior DevOps Security Engineer (DevSecOps)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492572,
    "description": "TileDB, Inc. | Full-Time | REMOTE | USA, Greece/EU | https://tiledb.comTileDB has recently announced a $34 million Series B fund-raise and is actively hiring for engineers across a range of roles (SRE, backend/distributed systems, Python, C++, and more). You will have the opportunity to work on innovative technology that creates impact for challenging problems in genomics, geospatial, machine learning, distributed systems, and many other areas.TileDB Cloud is the modern database, allowing developers and scientists to capture, analyze, and share any data with any tool. We build on a broad foundation of open source, maintaining the TileDB storage engine, libraries for genomics (single-cell and population), geospatial (raster, point clouds, and more), a TileDB visualization engine extending Babylon.js, and much more (github.com/TileDB-Inc/TileDB)With TileDB, all data — tables, genomics, images, videos, location, time-series — is captured as multi-dimensional arrays. To supercharge this data, TileDB Cloud implements a serverless infrastructure delivering query execution, access control, data and code sharing, and distributed computing at global scale — eliminating cluster management, minimizing TCO, and promoting scientific collaboration and reproducibility.Website: https://tiledb.com | GitHub: https://github.com/TileDB-Inc/TileDB | Blog: https://tiledb.com/blogWe are actively hiring for a number of roles including:- Site Reliability Engineer (Golang, k8s, Terraform, automation, Prometheus, CloudWatch, GitOps)- Senior Software Engineer: Backend and distributed systems (Golang, CGo, k8s, Terraform, MySQL/MariaDB)- Senior Software Engineer: Python Data Science Tooling (Jupyter plugins)- Senior+ Software Engineer: C++ Database Internals (database query planning/execution, distributed execution; Rust or other systems language ok if paired with exceptional expertise and willingness to write C++)Apply today at https://tiledb.workable.com or reach out directly (email in profile).\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa",
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Site Reliability Engineer",
        "Senior Software Engineer: Backend and distributed systems",
        "Senior Software Engineer: Python Data Science Tooling",
        "Senior+ Software Engineer: C++ Database Internals"
      ],
      "tech_stack": [
        "Golang",
        "k8s",
        "Terraform",
        "MySQL/MariaDB",
        "Python",
        "Jupyter",
        "CGo",
        "Prometheus",
        "CloudWatch",
        "GitOps",
        "Rust"
      ]
    },
    "categorized_tech": [
      "go",
      "kubernetes",
      "terraform",
      "python",
      "prometheus",
      "rust"
    ],
    "categorized_positions": [
      "sre"
    ]
  },
  {
    "id": 38506157,
    "description": "GoGoGrandparent (YC S16) | FULLY REMOTE |  Full-time | US, UK, or able to work 4+ hours overlap with mainland US | Senior/Staff Backend EngineerBuild high-quality, robust engineering at the rarest of things - a Silicon Valley startup that is both wholesome AND profitable. We have 8-figure revenue, are YC-backed, and growing fast.Tech stack (required): Back-end heavy (Node, Typescript, MySQL, REST*+GraphQL), deploy (AWS, Docker/K8s)Minimum 5 years experience (with Node). If full-stack, you must be strongest on the backend.2-stage interview process.If you want to help older adults and people with disabilities, send your LinkedIn/CV to william@gogograndparent.com (keep it brief) or apply at https://www.ycombinator.com/companies/gogograndparent/jobs (UK jobs can be applied for from anywhere and salary ranges can be adjusted for the right candidate)\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior/Staff Backend Engineer"
      ],
      "tech_stack": [
        "Node",
        "Typescript",
        "MySQL",
        "REST",
        "GraphQL",
        "AWS",
        "Docker/K8s"
      ]
    },
    "categorized_tech": [
      "nodejs",
      "typescript",
      "mysql",
      "rest",
      "graphql",
      "aws"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490947,
    "description": "Beacon AI | https://beaconai.co | Full-Time | SF Bay Area HybridDo you want to join a company building R2-D2 for pilots? Beacon AI does this through a vertically integrated aviation platform. Our team has relevant industry expertise in aviation and autonomy, and we are building features that improve flight safety and efficiency by augmenting pilots.Join a founding team of former Cruise AI engineers and two former fighter pilots, with a world-class advisor team, talented developers, and amazing investors, including Sam Altman, Zach Perret, JetBlue Technology Ventures, and Countdown Capital. Learn (a little bit) more at https://www.beaconai.coWe are currently prioritizing hiring for these three roles to deliver impact on ongoing and future engagements. We expect many more openings within the next 6 months: https://www.beaconai.co/careersSWE - Robotics (Advanced Pilot Assistant Software)[Staff or Senior] This role builds the pilot augmentation features (R2-D2).SWE React Web App (Front End) This role builds critical 3D software to support live flights and flight playback.iOS Software Engineer [Staff or Senior] This role Develops, deploys, and maintains a safety-enhancing iOS applicationApply directly at https://beaconai.co/careers and mention that you found this post on HN!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF Bay Area",
      "positions": [
        "SWE - Robotics (Advanced Pilot Assistant Software)",
        "SWE React Web App (Front End)",
        "iOS Software Engineer"
      ],
      "tech_stack": [
        "React",
        "iOS"
      ]
    },
    "categorized_tech": [
      "react",
      "ios"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492148,
    "description": "RUST | REMOTE, WORLDWIDE | FULL-TIMEZynk is building a totally new, all-platform file transfer application that is going to do things right - and will be a breath of fresh air in this crazy world of colossal cloud-powered inefficiency (HN Launch pending).We're a Rust only shop, hiring a REMOTE Rust developer.If you're fascinated by efficiency, performance, stability, reliability, doing things right, as well as pushing the boundaries of what modern hardware and networking can do, this may be for you.If you're not afraid of creating a custom solution that answers the very narrow needs of a task, and and doing it the best way possible, this may be for you.If you ever thought or pondered about if this insane, bloated cluster of cr*p can be replaced by a single modern machine running some custom code or carefully picked components, this may be for you.If KISS means something to you and you love the CLI, this may be for you.If you appreciate what Rust can do for you and the entire lifecycle from dev to robust product, this may be for you.If you've reached the end of this post, this may be for you.We're easy, flexible, non bureaucratic and we don't waste time on unnecessary things.Ignore the website. It's a place holder.  Apply at: m at zynk.it\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Rust Developer"
      ],
      "tech_stack": [
        "rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490834,
    "description": "Yurtle | Remote | UK +- 2 hours | Full-time | Full-Stack Software EngineerYurtle is a VC funded (just completed a funding round) startup aiming to tackle the growing crisis of caregiving in the UK and beyond. There are 13 million caregivers in the UK - half of which care for both a child and an elderly relative. With an ageing population and an average 10-year gap between lifespan and years in good health, the demand for care is rampant. With care homes becoming even less appealing post-covid, and a projected shortage of 400,000 professional carers by 2028, family caregivers are filling the void. 12,000 people are thrust into a caregiving role each day in the UK alone [0].We are building a caregiving super app that will provide the right tools, support and community to make caregiving responsibilities significantly more manageable and prevent caregiver burnout. We are then bundling that with a bespoke insurance product that provides money for backup care when a primary caregiver falls ill, which we distribute to companies as an employee benefits package. This allows us to scale much faster than with a direct-to-consumer approach.We are looking for one or two full stack software engineers who are comfortable working in a fast-paced startup environment, and ideally experienced with most, if not all of, React (plus Redux), Node.js, MySQL, Google Cloud, React Native (plus Expo).If you are interested in applying, please send me (the CTO) an email at jobs+hn@yurtle.co.uk[0]: https://www.carersuk.org/policy-and-research/key-facts-and-f...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "UK"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Full-Stack Software Engineer"
      ],
      "tech_stack": [
        "React",
        "Redux",
        "Node.js",
        "MySQL",
        "Google Cloud",
        "React Native",
        "Expo"
      ]
    },
    "categorized_tech": [
      "react",
      "redux",
      "nodejs",
      "mysql",
      "google_cloud",
      "react_native",
      "expo"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493187,
    "description": "Senior Software Engineer (Backend or Fullstack) | Splash.tech | remote | full-time | EU timezoneWe build games that sports fans love to play. Based in the UK, we're a top B2B provider in the gaming sector, powering fan engagement in over 50 countries with notable names in sports and entertainment. Founded four years ago, our company has seen a 100%+ revenue growth annually for three consecutive years. The 15-strong team at Splash works fully remote and values independent and self-motivated members.We’re looking for several experienced Software Engineers. Based on your area of expertise, you’ll build backend or full-stack components and contribute towards system architecture, security and scalability. As part of the engineering team, you’ll own the whole development lifecycle from receiving/aligning requirements to development, test and operations.Responsibilities- You own the development of backend or full-stack (depending on your expertise and focus area) features end-to-end.- Collaborate with stakeholders, ensure product quality and impact decision making.Optimize applications for speed, security and scale.Requirements- 5+ years of relevant engineering experience at tech and product-driven companies- Proficiency with Java/Spring (and Javascript or other web frameworks, we use Angular).- Some experience with relational databases (we use Postgres)- Desire to work fully remote and to proactively approach issues- Fluent EnglishDepending on your location we’ll offer a competitive market rate salary for your experience level as well as stock options.Contact: Oliver Renner, CTO - oliver@splash.tech\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Software Engineer (Backend or Fullstack)"
      ],
      "tech_stack": [
        "Java",
        "Spring",
        "Javascript",
        "Angular"
      ]
    },
    "categorized_tech": [
      "java",
      "javascript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494216,
    "description": "Puma Browser | Remote-first with PST overlap | Engineering & Growth | $75-120k base & 200k+ equity | http://join.puma.ggHi all, I’m Yuriy, founder of Puma Browser. I've previously worked in developer relations at Cloudant (YC S08), Meteor (YC S11), Parse (YC S11), and explored AI/ML (computer vision for self-driving cars) before diving deep into crypto.We started with the idea of a privacy-first browser with built-in micropayments (via the Interledger Protocol) and have since added support for identity (HNS, ENS; Unstoppable Domains in testing) and storage (IPFS; Arweave in testing).We just soft launched Anthropic and OpenAI integrations and excited to make your browser smarter, do more things for you and further explore intersection of crypto & ai. \nIncentive and governance structures for AI companies and training/running LLMs in a decentralized way is a particularly interesting direction imho.We recently surpassed 750k downloads and are excited to grow our team. Our investors include Protocol Labs, Shima Capital, Fenbushi, Don Ho (Orange DAO), Sridhar Ramaswamy (Snowflake, Neeva, Greylock), Jason Warner (ex-GitHub CTO), Illia Polosukhin (NEAR Protocol, Google Deep Learning, TensorFlow) and many more.Our Values:- We value Optimism, Kindness, Curiosity, Speed and Grit.\n- Two recurring weekly meetings to maximize state of flow – Monday all-hands, Friday Demos.\n- Careful with growth and never had to do layoffs.\n- Capital efficient with 3+ years of runway.Open Roles: Ai/ML Engineer, iOS Engineer, Head of Memes & Growth, Internships: Eng, Design, GrowthHow to Apply: visit http://join.puma.gg or email careers+hn [at] pumabrowser.comThank you!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": 75000,
        "max": 120000
      },
      "company_location": null,
      "positions": [
        "Ai/ML Engineer",
        "iOS Engineer",
        "Head of Memes & Growth",
        "Internships: Eng",
        "Design",
        "Growth"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491301,
    "description": "Resleeve | Remote | Netherlands +- 5 hours | Full-time internship | Machine Learning Engineer (Generative AI)Resleeve is a startup that seeks to transform how fashion designers develop their next fashion item and get a photoshoot from that item. Instead of going through multiple drafts, creating a dummy, hiring a photographer and model, all can now be achieved through Resleeve Studio. We were founded 1 year ago and pivoted in September.Are you in your last year of university or did you recently graduate and do you have hands-on experience with generative models, then this could be a great internship experience. We will provide you with an environment where you will work with the CEO and the CTO (me, ex MLE leader at Bain & Co and BCG) to develop new features for our studio and work with our end-users to address their business needs.We are looking for one to two machine learning engineers with an affinity for pytorch and architecture components, including transformers, autoencoders, diffusion, and embeddings.Interested? Drop me (CTO) an email at jobs+hn@resleeve.ai\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Netherlands +- 5 hours",
      "positions": [
        "Machine Learning Engineer (Generative AI)"
      ],
      "tech_stack": [
        "pytorch",
        "transformers",
        "autoencoders",
        "diffusion",
        "embeddings"
      ]
    },
    "categorized_tech": [
      "pytorch"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493499,
    "description": "Tulip | https://tulip.co/eng | Boston, MA, Munich, Germany, and Budapest, Hungary | Full time | OnsiteDo you want to help transform manufacturing? We are building the best team in the industry to bring consumer-grade user experiences to a space dominated by ancient enterprise technology. Our platform enables our customers to create apps without code and to connect their apps to machines, sensors and smart tools. These augmented production lines would otherwise rely on paper to share information.We have offices in Somerville, MA, Munich, Germany and Budapest, Hungary. We just closed a $100m series C and are using that capital to grow dramatically. Our customers include some of the largest manufacturers in the world across numerous verticals of the manufacturing industry.We'd love to talk to anyone interested, but in particular we are looking to bring folks on in:- SRE/DevOps: Kubernetes-admin, scalable monitoring across the firewall, hybrid cloud/on-prem deployment- Web Development: React+Redux frontend, NodeJS+Mongo+Postgres+Redis backend, syncing data with Meteor, delivering useful, real-time experiences in the browser and on Electron- Data & Pipeline Engineering: planning, implementing, and finding insights with our next generation of process & sensor analytics- IoT/Embedded Software: delivering a reliable, extensible HW platform across arm and x86, all manner of bus/IO tech- Machine Learning & Computer Vision: build end-to-end ML and CV products to track and extract valuable insights from raw data, interact with clients to solve real-world problems with data.Apply at https://tulip.co/careers or email us at jobs@tulip.co\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "SRE/DevOps",
        "Web Development",
        "Data & Pipeline Engineering",
        "IoT/Embedded Software",
        "Machine Learning & Computer Vision"
      ],
      "tech_stack": [
        "React",
        "Redux",
        "NodeJS",
        "Mongo",
        "Postgres",
        "Redis",
        "Meteor"
      ]
    },
    "categorized_tech": [
      "react",
      "redux",
      "nodejs",
      "mongodb",
      "postgresql",
      "redis",
      "meteor"
    ],
    "categorized_positions": [
      "devops",
      "web developer",
      "embedded"
    ]
  },
  {
    "id": 38495039,
    "description": "Graphistry / louie.ai | Visualization Engineer | US, global | Full-time | https://www.louie.ai , https://www.graphistry.com/careersGraphistry supercharges investigations with its GPU visual graph AI platform and its new Louie.AI platform for conversational and continuous generative AI analytics. A UC Berkeley spinout, our core platform gets used by banks, enterprises, governments, and data-intensive startups for visually investigating relationships in rich structured data like security logs, user clickstreams, social media, and genomics. The new Louie.AI platform is making analysis even easier through a conversational interface and a backend for scaling to always-on. We have won awards like Gartner Cool Vendor and the recent US Cyber Command AI competition.Visualization engineer role: We're looking for someone to help with 2.0 of our core data visualization engine as we scale our GPU client <> GPU server to another 10-100X, with the current focus especially around 10M-100M-scale WebGL and later WebGPU. This will be interleaved with other visualization engineering tasks prioritized by our customers and product activities, both around Graphistry core and Louie.AI. You will work closely with  teammates expert in JS, GPU, AI, and working with our customers. You will have high levels of ownership. As Graphistry was the team to build & donate the popular Apache Arrow JS framework, make the prototype that led to Nvidia RAPIDS, and generally pioneered the  modern approach of server GPU <-apache arrow-> client GPU high-performance data viz, this will be an engaging role, and we likewise hope to learn from you.Information at https://graphistry.com/careers and more at https://www.louie.ai/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "us",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Visualization Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38506216,
    "description": "Normal Computing | https://normalcomputing.ai | New York or full remote | Full TimeNormal Computing is making AI both scalable and useful.We are looking for a senior web backend developer (8+ years experience ideally in Python, PostgreSQL) to join the Core Engineering team and work on a variety of projects.Pros:- Full remote.- A lot of autonomy with a focus on deep work and minimal process.- Working on applications more interesting than the average CRUD software.If you like to build and have the skills that go with it, you may like it here. Contact us!https://jobs.ashbyhq.com/Normal%20Computing%20AI/2cb7e085-a0...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "New York",
      "positions": [
        "senior web backend developer"
      ],
      "tech_stack": [
        "Python",
        "PostgreSQL"
      ]
    },
    "categorized_tech": [
      "python",
      "postgresql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494591,
    "description": "Lunaris | Engineering | Tokyo, Japan | On-site | Visa sponsorship | Full Time | https://teamlunaris.com/Lunaris started out as an otaku-centric online shop called Solaris Japan founded in 2008, and is still going strong to this day. As such, many of us here have a huge passion for anime, gaming, or Japanese pop culture in general. It’s not unusual to see an anime figure sitting on someone’s desk, the latest League of Legends tournament streaming on our lounge television, or hear someone discussing their past adventures on Final Fantasy XI.However, our passion doesn’t stop there – we’re a team of self-starters who are driven by results. As Solaris Japan continued its success and our customer base grew, we sought solutions to serve our customers, and added Shopify to our toolkit. We then built a number of custom applications for ourself and automated many of our processes, and realized we could offer these solutions to other e-commerce platforms as well. Thus, Lunaris was born, and with it additional e-commerce solutions like easyPoints, easyRates, and more.We are a team of international engineers, and are actively seeking a few more engineers to join our growing team:- Senior/Lead Engineer - https://teamlunaris.com/eng/jobs/full-stack-developer- Fullstack Engineer - https://teamlunaris.com/seniorlead-engineer-copyTech stack: Elixir, PostgreSQL, AWS, Docker, React (mostly JS)If Lunaris sounds like a good fit for you, and you're ready for a new experience in Japan (or already living here), please check out the above positions and send in your application.Of course, if you have any other questions, feel free to reach us at jobs@lunaris.jp\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Tokyo, Japan",
      "positions": [
        "Senior/Lead Engineer",
        "Fullstack Engineer"
      ],
      "tech_stack": [
        "Elixir",
        "PostgreSQL",
        "AWS",
        "Docker",
        "React"
      ]
    },
    "categorized_tech": [
      "elixir",
      "postgresql",
      "aws",
      "docker",
      "react"
    ],
    "categorized_positions": []
  },
  {
    "id": 38499767,
    "description": "Octopus Energy/Kraken Technologies | Software Engineers in General  | Global | Full-time | Compensation varies per country of residenceDo you care about clean energy? Like remote culture and a global company that still feels like a startup?Only been around 8 years, but we're the largest energy retailer in the UK (100% renewable electricity), do wind and power generation all over the world, and just bought a heat pump factory because we couldn't buy them fast enough.Everything we do is powered with our own software, Kraken. For those who've worked with energy tech/energy utility software, you'll appreciate that it needed to change :)Hiring globally in a variety of roles (https://octopus.energy/careers/join-us/#/), ranging from senior platform roles to entry level backend developers.Feel free to apply on our careers page, and more than happy to share more about the org and mission at tagg.jefferson@kraken.tech .\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": [
        "Kraken"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38496398,
    "description": "Seeking a data engineer/scientist who is a literal master of ETL/DBT and bigquery-like tooling. Reach me via the email address in my profile. We are one of the top 10 players in the algorithmic trading space for domain names. Our stack is primarily Python. We use a lot of Postgres, duckdb, bigquery and other tooling. Engineering focused org. Our founders have been in the business since before ICANN existed. Company is based in London but we have employees all over the world in almost every timezone. Looking for humble yet talented individuals. Remote first company.",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada",
        "latin_america",
        "europe",
        "asia",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London",
      "positions": [
        "data engineer",
        "data scientist"
      ],
      "tech_stack": [
        "python",
        "postgres",
        "duckdb",
        "bigquery"
      ]
    },
    "categorized_tech": [
      "python",
      "postgresql"
    ],
    "categorized_positions": [
      "data engineer",
      "data science"
    ]
  },
  {
    "id": 38491266,
    "description": "Foxglove | Remote (must be located in US time zones) | Full Time | Open Source | https://foxglove.dev/Foxglove is the leading observability platform for robotics developers. We help robotics and autonomous vehicle companies log, ingest, organize, and visualize multimodal data. We're well funded (series A), ~20 people, with an experienced, fast-moving, and no-nonsense team. Seeking like-minded people to join us!- Senior / Staff Frontend Product Engineer (TypeScript, React, bonus if you have WebGL + Wasm experience)- Head of Product Marketing / Lead Product Marketing Managerhttps://foxglove.dev/careersEmail in my profile if you have questions (no recruiters please).\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior / Staff Frontend Product Engineer",
        "Head of Product Marketing / Lead Product Marketing Manager"
      ],
      "tech_stack": [
        "TypeScript",
        "React",
        "WebGL",
        "Wasm"
      ]
    },
    "categorized_tech": [
      "typescript",
      "react",
      "webgl"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491512,
    "description": "Comikey | Remote (Worldwide) | Software Engineers (Frontend, Backend, Mobile, DevOps) | Full-timeWe are working on a big upcoming manga-related software project, and seeking out developers who are interested in working in the following positions:  - Frontend Web Dev (mostly Vue)\n  - Backend Dev (Go, Typescript, Python etc.)\n  - App Dev (Flutter + FFI)\n  - Dev Ops (Bare metal & Nomad)\n\nPrevious experience working on manga, webtoon, or anime-related software is a plus, whether professionally or as a fan.This would be a full-time (contract, with exceptions), fully-remote position working at a fast pace to deliver a product that will be used by millions of manga fans around the world. If this sounds like something you'd be interested in, please email admin@epub.rocks\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Frontend Web Dev",
        "Backend Dev",
        "App Dev",
        "Dev Ops"
      ],
      "tech_stack": [
        "Vue",
        "Go",
        "Typescript",
        "Python",
        "Flutter"
      ]
    },
    "categorized_tech": [
      "vue",
      "go",
      "typescript",
      "python",
      "flutter"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493053,
    "description": "Viator | Software Engineer all levels and Managers | Full time | Remote & Hybrid On-site | Portugal, UKViator connects suppliers to travelers, creating the world's largest platform for travel experiences.We are growing fast and have many positions to fill in Portugal and the UK.  We are looking for managers and engineers at all levels for full-stack, backend and data teams.  Roles in Portugal require you to be in the office in Lisbon part time.  UK roles can be part time in an office in London or Oxford or fully remote. For the remote roles you still need to be based somewhere in the UK.The full list of open roles is here: https://bit.ly/viator-jobs\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "uk"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer",
        "Manager"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38496793,
    "description": "Numeric | Product engineer (4+ YOE) | ONSITE in San Francisco, CA or NYC, NY | https://www.numeric.io/We are building the modern accounting & finance platform. Companies like Wealthfront, AngelList, Clearbit, and more depend on Numeric's workflow and data platform to collaborate, monitor and analyze data, and share insights about their financials.We're an early company with top-tier investors, wonderful customers, and large ambitions.Looking for product & customer-focused engineers[1]; this will fit if you like to build quickly, contribute to product direction, and know your users. We're taking on some foundational challenges and need great engineers who want to dive into the details of the domain, execute with high velocity, and have high ownership.Bonus points for startup experience and/or full-stack experience with Typescript. 4+ YOE.Apply: Email andrew@numeric.io (mention hackernews in subject)[1] https://numeric.notion.site/An-80-20-rule-for-product-develo...More info: https://numeric.notion.site/Full-stack-Engineer-f641816581fc...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Product engineer"
      ],
      "tech_stack": [
        "Typescript"
      ]
    },
    "categorized_tech": [
      "typescript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491667,
    "description": "Spill (https://www.spill.chat/) | Senior Frontend Engineer (£80-100k) Mid-Level Fullstack Engineer (£65-75k) Mid-Level Devops/SRE (£65-75k) | London, UK (HQ) | ONSITE | Full-timeOur aim is to make counselling and therapy free at the point of use for as many people as possible. We do this by selling a mental health support product to businesses.We're hiring a Senior Frontend Engineer and a Mid-Level Fullstack Engineer and an SRE/Devops engineer into our small product and engineering team of 10.We're a small product-focused company, don't employ any salespeople, and are almost cashflow positive.email calvin[at]spill[dot]chat for a more thorough job spec\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London, UK (HQ)",
      "positions": [
        "Senior Frontend Engineer",
        "Mid-Level Fullstack Engineer",
        "Mid-Level Devops/SRE"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38495761,
    "description": "Sphinx Defense | Engineering, DevOps, & Product | Remote (US Only), DC, Colorado Springs, LA | https://www.sphinxdefense.comSphinx Defense builds software to solve complex national security problems for America and its allies. Founded by engineers and technologists with deep experience across commercial and defense technology, we’re building a vehicle-agnostic communication infrastructure to enable satellite operators to securely utilize antenna networks and maneuver satellites in real-time. We're bootstrapped, profitable, and growing aggressively.To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: https://www.keyvalues.com/sphinx-defenseIf you have specific questions, or are interested and don't see a role that looks like a good fit, email me directly at hunter (at) sphinxdefense.comCheck out our open roles: https://www.sphinxdefense.com/#CareersTech Stack: Programming: Python, Flask, pipenv, JSON\nData: PostgreSQL, Vault, ActiveMQ\nInfrastructure: Docker, Terraform, Ansible, AWS, Linux\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Engineering",
        "DevOps",
        "Product"
      ],
      "tech_stack": [
        "python",
        "flask",
        "pipenv",
        "json",
        "postgresql",
        "vault",
        "activemq",
        "docker",
        "terraform",
        "ansible",
        "aws",
        "linux"
      ]
    },
    "categorized_tech": [
      "python",
      "flask",
      "postgresql",
      "docker",
      "terraform",
      "ansible",
      "aws",
      "linux"
    ],
    "categorized_positions": [
      "devops"
    ]
  },
  {
    "id": 38496796,
    "description": "Schoolyear (Remote CEST±1) - we're a fast-growing start-up based in The Netherlands. Our aim is to simplify IT for educators, allowing them to focus on what truly matters: teaching.We're looking for an engineer that loves to work in a small, fast-pace team to lead our development of a 10k+ node desktop streaming cluster. Tackling challenges like low latency video streaming, multi-vendor orchestration, aggressive auto-scaling and complex networking.We're a tight team (11, 6 engineers) working from all over Europe, all with our own core skills. We work in 8 week development cycles (6 sprint, 2 cooldown) and we have strong technical leadership. We meet up 4 times a year in a team mate's city for an on-site week.Website: https://schoolyear.com\nJob: https://www.linkedin.com/jobs/view/software-engineer-infrast...\nApply: team@schoolyear.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "The Netherlands",
      "positions": [
        "software engineer infrastructure"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491778,
    "description": "GitHub - code search | Staff/Principal Software Engineers | REMOTE (US/UK/Germany) | Full-timeHelping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences.We are hiring for two open roles (Staff and Principal level) in three countries, so there are six listings. All roles are remote, but currently we can only hire for these roles in these countries. These are hands-on engineering positions, writing Rust for a large scale distributed information retrieval system.https://githubinc.jibeapply.com/jobs/2388?lang=en-us - Staff/USA (USD $118,100.00 - USD $313,300.00 /Yr.)https://githubinc.jibeapply.com/jobs/2390?lang=en-us - Staff/UKhttps://githubinc.jibeapply.com/jobs/2389?lang=en-us - Staff/Germanyhttps://githubinc.jibeapply.com/jobs/2385?lang=en-us - Principal/USA (USD $134,800.00 - USD $357,500.00 /Yr.)https://githubinc.jibeapply.com/jobs/2387?lang=en-us - Principal/UKhttps://githubinc.jibeapply.com/jobs/2386?lang=en-us - Principal/Germany\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa",
        "uk",
        "germany"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Staff Software Engineer",
        "Principal Software Engineer"
      ],
      "tech_stack": [
        "Rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38495122,
    "description": "PHOSPHOR | Remote | New York, NYHiring: CTO, Staff/Senior UI Engineers, AI EngineerStack: Elm/React, Tailwind, F#, Rust, exploring local-first solutionsPHOSPHOR (http://phosphor.co/20x) has solved the last \"impossible\" technology problem in capital markets.We've represented financial models AND contracts as structured, computable data, and we've done so without sacrificing flexibility afforded by Excel or Word. This has never been done, and it enables product opportunities that have never been conceivable before: we have the first real view towards AI that does not hallucinate in the most business critical mediums in finance.I founded Phosphor after building one of the leading clean energy investment platforms in the US as first hire. Phosphor was originally a clean energy finance product, but then we solved a much deeper set of problems. Over three years, I've led three senior engineers as CEO/CTO while we've worked (in stealth) through mind-boggling R&D problems in computable contracts and linguistics.As we focus on commercialization & launch over the next few months, I'm seeking senior product/UI engineers, and I'm beginning a CTO search in hopes of finding a senior technical leader to take the reigns and partner with me to build something OpenAI-scale.For the adventurous of you, resumes to oliver@phosphor.co. Please mention HN in the subject line.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "New York, NY",
      "positions": [
        "CTO",
        "Staff/Senior UI Engineers",
        "AI Engineer"
      ],
      "tech_stack": [
        "Elm/React",
        "Tailwind",
        "F#",
        "Rust"
      ]
    },
    "categorized_tech": [
      "tailwind",
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38496540,
    "description": "Next Session, Co. | REMOTE | USA, Europe, Japan, Tel-Aviv, India | Full-Time/Part-TimeHi everyone, we are a general consulting firm. We employ a work-from-home model to achieve the dream of work productivity in the comfort of the home.I am the founder of Next Session LLC (DBA Next Session, Co.) and we are actively hiring. The recruitment process is a tad unorthodox, but the idea we pitch is simple: If you can make it, if you can dream it, or if you even have an idea; it's valid to license any possible business model you can think of at your favorite office: the home work place ;-)Our long term goal is to achieve interstellar travel for the masses. So taking a 'space-bus' to the Moon or Jupiter's moons for a cheap, cost-effective, and safe space flight for the new venture into the beyond => Space-age tourism. [https://www.nextsession.co]We are working on private options, ideally with certain licenses. We need pilots, we need aeronautical experts, we need fuel experts, we need everything we can to take your grandson to his dream 16th birthday. One perhaps orbiting Mars, observing a beautiful blue sunset with you!How would we ideally want to visit Andromeda and also come back in time for Thanksgiving? A time machine! Sounds nutty and it is! But the basic principle remains, FTL travel is only possible by warping through space and time.Thank you, and feel free to contact me anytime. If you have any questions, my name is Lucas and don't hesitate to reach out to me here: me@nextsession.co or [https://www.nextsession.co/contact]\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa",
        "europe",
        "japan",
        "tel-aviv",
        "india"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": null,
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38495042,
    "description": "Slingshot Biosciences | Senior Software Engineer | Full-time | ONSITE or HYBRID in Emeryville, CA | VISA SponsorshipSlingshot Biosciences is a biotech company focused on synthetic cell development. Synthetic cells can have a huge impact—improve the accuracy of biomedical instruments, lower the cost of drug development and diagnostics, and make healthcare more accessible around the world. We’ve raised a Series A round and the company is still small enough to know everyone.I’m looking for a mission-driven senior software engineer to build out tools for processing and visualizing scientific data. An ideal candidate has worked on a small-to-medium web app before with modern tools. The stack is React, TypeScript, Django, and GCP—full-stack experience is a requirement to be considered for the role but experience with all of those specific tools is not necessary.You will be a foundational part of the company, building tools scientists will rely on. You will need to come into the office at least once per week to work with scientific instruments and meet with collaborators, but you won’t need to be in daily.Submit an application: https://boards.greenhouse.io/slingshotbiosciences/jobs/41469...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Emeryville, CA",
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "React",
        "TypeScript",
        "Django",
        "GCP"
      ]
    },
    "categorized_tech": [
      "react",
      "typescript",
      "django",
      "google_cloud"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38501832,
    "description": "WorkTiles | Founding Fullstack Engineer | Remote (Sweden) | Full timeI'm seeking an engineer who will help me drive tech and product at WorkTiles. WorkTiles is a B2B SaaS collaboration tool designed to help companies organize, perform, and improve their monthly closing and consolidation process. (Think Linear but for finance/accounting)See more here https://www.linkedin.com/jobs/view/3770164426Or just reach out to me directly if you have any questions at adam at worktiles.se\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "Sweden"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Founding Fullstack Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492446,
    "description": "Waitwhile | Stockholm, Sweden | Onsite/hybrid remote | Full-time\nWaitwhile works to eliminate the 1 trillion hours that people spend waiting in lines every year. Our platform is trusted by over 10,000 companies worldwide and has helped more than 250 million people enjoy a radically better waiting experience at places like IKEA, Louis Vuitton, Costco, Tribeca Film Festival and more.Hiring for multiple roles for our Stockholm office. Come join our wonderful, supportive team!- Platform Software Engineer: Experienced generalist with deep knowledge of building scalable and maintainable apps and backends https://careers.waitwhile.com/jobs/3244968-software-engineer- Solutions Engineer: Customer facing product expert and problem solver based in Stockholm https://careers.waitwhile.com/jobs/3245527-solutions-enginee...- Web Developer: Lead the technical design, implementation, and maintenance of our homepage (waitwhile.com) in collaboration with our UX, Graphic Design and Marketing team https://careers.waitwhile.com/jobs/3259188-web-developer\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Stockholm, Sweden",
      "positions": [
        "Platform Software Engineer",
        "Solutions Engineer",
        "Web Developer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492079,
    "description": "Quadrature | London or New York | Full-time | Onsite | https://quadrature.ai/Quadrature is a UK-based systematic trading company, in the business of building black box (fully automated) trading systems across the global financial markets since its founding in 2010. We're a very tech and research focused org, and are quite different from a lot of other players in the market (more like a tech-driven research institute than a traditional trading firm -- see https://quadrature.ai for the details).We're looking for a skilled engineer to optimise the use of GPGPUs for our AI workloads, for both our model training and inference environments. This is a great opportunity to work with a group of world-class researchers and developers, building out large-scale, black box algorithmic trading systems using cutting-edge tech (advanced ML, thousands of GPUs, multiple global research data centres and trading co-location sites, petabytes of storage, innovation-lab R&D work with strategic partners). Our expectation is that this will be a very high impact role. It'll be based out of either London or New York.https://quadrature.ai/contact\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London or New York",
      "positions": [
        "engineer"
      ],
      "tech_stack": [
        "GPGPUs",
        "AI",
        "ML"
      ]
    },
    "categorized_tech": [
      "ai",
      "machine_learning"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491635,
    "description": "Depict | Full-stack Engineer and Site Reliability Engineer | Remote or Stockholm, Sweden\nDepict (YC S20, http://depict.ai/) is building a merchandising platform for fashion e-commerce to make shopping a delight and store management a breeze. We serve hundreds of millions of requests every month to power category listings, recommendations and search on some of the largest e-commerce sites in Europe.We’re now looking for- Full-stack Engineer. You’ll help us build a visual merchandising tool that fashion merchants love to work with, working closely with our designers to create a delightful, pixel perfect user experience. We expect you to be great at TypeScript and React. Our backend is mostly written in Python, but we’ll help you learn if you aren’t fully comfortable yet.- Site Reliability Engineer. You’ll help us build and maintain infrastructure to reliably serve thousands of RPS to power business-critical services. You’ll be our first dedicated SRE, so you’ll be leading the work to improve our setup so that we can move fast without breaking things. Some of our current stack is GCP, Kubernetes, Terraform, Loki, Prometheus and ArgoCD, but we’re open to change.The roles aren’t yet up on our Careers page, but if it sounds interesting please reach out to me at john@depict.ai and I’ll be happy to tell you more! We hire remotely but require some overlap with CET, +-3 hours CET.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Stockholm, Sweden",
      "positions": [
        "Full-stack Engineer",
        "Site Reliability Engineer"
      ],
      "tech_stack": [
        "TypeScript",
        "React",
        "Python",
        "GCP",
        "Kubernetes",
        "Terraform",
        "Loki",
        "Prometheus",
        "ArgoCD"
      ]
    },
    "categorized_tech": [
      "typescript",
      "react",
      "python",
      "google_cloud",
      "kubernetes",
      "terraform",
      "prometheus"
    ],
    "categorized_positions": [
      "full stack",
      "sre"
    ]
  },
  {
    "id": 38497724,
    "description": "Neocom | Senior Backend Engineer | Full-Time | Munich, Germany | ONSITE | Hybrid | VISAAt Neocom, we empower every company to understand their prospects and turn them into delighted customers.With our guided product advisors, we eliminate choice overload and use zero-party data to deliver profound customer insights to our clients.\nJoin us our mission to change how people find products by making product discovery effortless!\n.Our Stack:* Python is our main language (we use Django), Go for high throughput services.* Deployments via Docker containers.* Postgres for Master Data and Clickhouse for data intensive queries..About the company:* Startup, post 1M ARR, received $4.5m VC funding in September 2023* 25 people, 7 in R&D.What we are looking for:* True senior, who takes over ownership.* Has worked in Startups with less than 100 people in the past.* Knows her/his tools by heart..https://neocom.recruitee.com/o/senior-backend-engineer\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Munich, Germany",
      "positions": [
        "Senior Backend Engineer"
      ],
      "tech_stack": [
        "Python",
        "Django",
        "Go",
        "Docker",
        "Postgres",
        "Clickhouse"
      ]
    },
    "categorized_tech": [
      "python",
      "django",
      "go",
      "docker",
      "postgresql",
      "clickhouse"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491841,
    "description": "Nooks (https://nooks.ai) | Software Engineers (full-stack & backend/applied ML) | Full-time | SF or Remote\nHi, I’m one of the founders of Nooks — we’re trying to re-invent how sales teams work with real-time collaboration and AI.Nooks is: - A virtual office: you can work from anywhere in the world, but still work with your team and get feedback and coaching like you’re sitting side-by-side. - and an AI co-pilot. We learn how your team works, identify “winning” strategies behaviors, then share them with the whole team during and after calls!We’re working on fun engineering challenges including complex distributed systems, low-latency algorithms & infrastructure, and modeling sales calls with large language models. You'll also have the chance to make a huge impact on our customers (sales reps who spend 80% of their work day on Nooks.)Right now we’re a small team (~25 ppl) growing super quickly - doubling revenue every quarter, and recently hit $2M ARR!Looking for experienced engineers who love tackling difficult product questions and working closely with customers. Excitement about language models, few-shot learning and other recent AI advances is also a plus :)I’d love to chat: reach me at nikhil [at] nooks.in or apply at the link below: https://nooks.breezy.hr/p/bbc06c1a1bb4-software-engineer\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF",
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38493643,
    "description": "Count | Senior Software Engineer | REMOTE within UK/Europe | Full-time | https://count.coCount is like Jupyter, Tableau and Miro combined in one tool. Data teams at some of the world's leading scale-ups use it for everything from iterating data models to performing deep dive analyses and telling impactful stories backed by data.We're a small team of 8, and we're looking for experienced software engineers who are interested in tackling deep technical challenges in the data analytics space.For the best possible user experience, we have developed various technologies in-house, including a custom WebGL rendering engine, our own data visualization library, and a reactive SQL/Python notebook and database query framework.Example projects: accelerating rendering using quadtree tiling, extending interactivity and customizability of visualizations, leveraging LLMs in data exploration, serverless framework for executing database queries at high concurrency.Our tech stack: TypeScript, Python, Node, WebAssembly, WebGL, Apache Arrow, DuckDB, Kubernetes, React.If you're interested in learning more about Count or what we're working on, please email our CTO at oli [at] count.co.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "TypeScript",
        "Python",
        "Node",
        "WebAssembly",
        "WebGL",
        "Apache Arrow",
        "DuckDB",
        "Kubernetes",
        "React"
      ]
    },
    "categorized_tech": [
      "typescript",
      "python",
      "nodejs",
      "webgl",
      "kubernetes",
      "react"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38495608,
    "description": "Adaltas | Distributed system engineers, data engineers | Paris, France | Full time | On-site | https://www.adaltas.comIn collaboration with its customers and the community, we are building 2 complementary 100% open source data platform. TDP (https://www.trunkdataplatform.io), based on the Hadoop ecosystem, is starting to deploy in production. The second, based on the Kubernetes ecosystem, is in the making. It is a great time to join us as we are gaining momentum. If you are passionate about open source software and data-driven technologies, want to make a difference in the world of data, and become an open source contributor, we would love to hear from you.I'm the CEO of Adaltas, if you are interested please apply here:https://www.adaltas.com/en/careers/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": null,
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Paris, France",
      "positions": [
        "Distributed system engineers",
        "data engineers"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data engineer"
    ]
  }
]