[
  {
    "id": 38492763,
    "description": "Y Combinator (yes, the people who run this site) | Infrastructure Software Engineer | Bay Area | Full-timeI currently run YC’s infrastructure and I need some help! Over the last 7 years I’ve been at YC, our software team has grown considerably both in engineers and in products. We need to invest more in our infrastructure so we can keep shipping our products quickly.The main thing you’ll need in this job is curiosity; I work at every layer of a very large stack. One day you might dig into AWS apis, another it’s a 3rd party Ruby gem or our git history. Or maybe you get paged that all the SSDs for Hacker News (primary and standby!) died on the same day :) https://news.ycombinator.com/item?id=32028511.The first few months will be heavier on infrastructure work but in the future the job will hopefully be equal parts developer experience, infrastructure work, and product engineering that impacts all of our products (think SSO, sending email, security, etc).The main products we support are all Ruby on Rails apps running in AWS (mostly in ECS); ideally you’ve already worked on apps like that. You have at least 5 years of experience. Part of that was shipping code to customers but you’ve also got cloud experience (we try to mostly use Terraform). You’re probably the person people turn to when there’s a fire to put out.YC has excellent compensation and benefits (see more in the formal job description: https://www.ycombinator.com/companies/y-combinator/jobs/0Ewh...). The team and the work life balance are great. About half of us are former founders and many of us are parents. And if you’re curious about startups (and possibly starting one someday), this job gives you amazing access to interact with YC’s programs, partners, and founders.If you’re interested, I’d love to chat! I’m mark@ycombinator.com.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Bay Area",
      "positions": [
        "Infrastructure Software Engineer"
      ],
      "tech_stack": [
        "Ruby on Rails",
        "AWS",
        "ECS",
        "Terraform"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails",
      "aws",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38529693,
    "description": "Picnic | Netherlands, Amsterdam | Visa sponsorship, relocation Picnic, the app-only supermarket and one of the fastest growing start-ups in the Netherlands is looking for you. What makes Picnic so unique? Everything we do, we do in-house, from forecasting to maintaining our first automated warehouse, to new electric vehicles that deliver our groceries.\nOur tech stack: Java 17, RabbitMQ, Kafka, PostgreSQL, MongoDB, AWS, Docker, Kubernetes, Terraform, VaultWe're hiring for a number of roles for our tech, design, and analyst teams. Some of the tech positions: * Java developer - https://grnh.se/cciamfn41 * React Native Engineer- https://grnh.se/abe2fc521us * Senior Infrastructure Engineer - https://grnh.se/7849f2251us * Warehouse simulation engineer - https://grnh.se/15788fa21usFor more positions at Picnic, visit https://picnic.app/careers/all-jobs, or visit our tech blog with more information: https://blog.picnic.nl/Feel free to reach out to jan.kothe@teampicnic.com for more information about the roles and the company!\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Netherlands, Amsterdam",
      "positions": [
        "Java developer",
        "React Native Engineer",
        "Senior Infrastructure Engineer",
        "Warehouse simulation engineer"
      ],
      "tech_stack": [
        "Java 17",
        "RabbitMQ",
        "Kafka",
        "PostgreSQL",
        "MongoDB",
        "AWS",
        "Docker",
        "Kubernetes",
        "Terraform",
        "Vault"
      ]
    },
    "categorized_tech": [
      "rabbitmq",
      "kafka",
      "postgresql",
      "mongodb",
      "aws",
      "docker",
      "kubernetes",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490889,
    "description": "DuckDuckGo - We are looking for candidates that are excited to join us on a mission to raise the standard of trust online. All of our roles are fully-remote, except where specific locations are noted.\nhttps://duckduckgo.com/hiringRemote Open Roles at DuckDuckGo:Senior Infrastructure EngineerSenior Backend EngineerSenior Software Engineer, Windows Desktop AppPrincipal Site Reliability EngineerSenior People Operations ManagerDirector, Public Policyhttps://duckduckgo.com/hiring\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Infrastructure Engineer",
        "Senior Backend Engineer",
        "Senior Software Engineer, Windows Desktop App",
        "Principal Site Reliability Engineer",
        "Senior People Operations Manager",
        "Director, Public Policy"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491097,
    "description": "Datadog | Software Engineers | ONSITE (Boston, Lisbon, Madrid, NYC, Paris, Tel Aviv) and REMOTE | Full-timeDatadog is a monitoring, tracing, logs system, and more, for your infrastructure and services. We build our own tsdb, event store [1][2], distributed tracing tools, cutting edge visualizations, and more. We love shipping great experiences for customers just like us and are growing fast! We write a lot of Go, Java, Python, Typescript (with React), and a bit of other languages. We run on k8s, and are multi-region and multi-cloud.We're looking for people who can build systems at scale as we process trillions of events per day. Let us know if that's you!https://dtdg.co/hnwhoshiring[1] https://www.datadoghq.com/blog/engineering/introducing-husky[2] https://www.datadoghq.com/blog/engineering/husky-deep-dive\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": [
        "Go",
        "Java",
        "Python",
        "Typescript",
        "React",
        "k8s"
      ]
    },
    "categorized_tech": [
      "go",
      "java",
      "python",
      "typescript",
      "react",
      "kubernetes"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492761,
    "description": "Zotero | Remote | Full-Time or Part-Time | https://www.zotero.orgZotero is an open-source project that develops software to help people collect, organize, annotate, cite, and share their research. Our software is recommended by most universities and used by millions of students, scholars, scientists, and researchers worldwide.We're looking for a JavaScript developer to work on Zotero \"translators\" — the pieces of code that let people save high-quality metadata and files to their Zotero libraries from across the web with a single click. If you like web scraping, APIs, data formats, and exploring sites in the browser devtools, this would be up your alley. As a core Zotero developer, you'll also have the ability to work across Zotero's vast ecosystem and help shape the future of the project.This is an open-ended contract role that can scale up and down in hours based on availability and workload.https://www.zotero.org/jobs/javascript_developer\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "JavaScript Developer"
      ],
      "tech_stack": [
        "JavaScript"
      ]
    },
    "categorized_tech": [
      "javascript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494045,
    "description": "ReMatter | Engineering | Remote | Full-time | https://rematter.com/careersOur mission is to enhance the sustainability, resilience, and robustness of the global metal supply chain while minimizing its carbon footprint. ReMatter is a scrap metal recycling software company founded by Forbes 30 Under 30 Stanford grads, building modern solutions for the $100B+ scrap metal industry.Our stack includes TypeScript, React, Node, GraphQL, AWS (Lambda, Cognito, S3, RDS), GitHub Actions, and Docker. Experience with our stack is a plus, but we believe in your ability to learn new technologies quickly.Join us to create a meaningful impact on the lives of recyclers. We offer competitive salary, meaningful equity, flexible schedules, remote work, and engaging company events.Apply at:- Software Engineer: https://rematter.com/careers/?ashby_jid=a55462d8-70d8-42ca-9...- DevOps Engineer: https://rematter.com/careers/?ashby_jid=eae31e1a-794f-4149-9...If you don't see a position on our site that fits your skillset or interests, reach out to jobs 'at' rematter.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer",
        "DevOps Engineer"
      ],
      "tech_stack": [
        "TypeScript",
        "React",
        "Node",
        "GraphQL",
        "AWS",
        "GitHub Actions",
        "Docker"
      ]
    },
    "categorized_tech": [
      "typescript",
      "react",
      "nodejs",
      "graphql",
      "aws",
      "docker"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38529372,
    "description": "ev.energy | Remote - US, Canada, Europe, UK | Full-Time | https://www.ev.energyLots of folk assume driving an EV is as green as can be - but where is the energy coming from that's charging your EV? Charging your EV at peak times puts pressure on the grid, which typically means the electricity is coming from burning fossil fuels. This is the problem we're trying to solve - our app enables drivers to align their EV charging with energy from renewable sources. This is better for the environment, cheaper for drivers, and great for an electricity grid under increasing strain.We're hiring for a number of roles having raised a Series B in July (33m USD) led by National Grid Partners. We're a team of around 120 people, working remotely across NA and Europe. Our tech stack includes Python, Django, AWS, React Native and Typescript.What are we hiring for?Technical Lead - Vehicle Integrations (NYC based given demands of the role)Technical Lead - SolutionsSenior Mobile Engineer - Solutions (fully remote)Senior Mobile Engineer - Driver Experience (fully remote)You can check out more of our open roles, salaries and benefits here - https://www.ev.energy/careersFeel free to get in touch at hiring@ev.energy if you have any questions before applying. Thanks!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "europe",
        "uk"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Technical Lead - Vehicle Integrations",
        "Technical Lead - Solutions",
        "Senior Mobile Engineer - Solutions",
        "Senior Mobile Engineer - Driver Experience"
      ],
      "tech_stack": [
        "Python",
        "Django",
        "AWS",
        "React Native",
        "Typescript"
      ]
    },
    "categorized_tech": [
      "python",
      "django",
      "aws",
      "react_native",
      "typescript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38527749,
    "description": "Democrance | https://democrance.com | Python/Django/Pyramid hacker, Terraform DevOps Expert | Dubai, UAE | Saudi Arabia , KSA | REMOTE optional (although working in Dubai-UK timezones)We’re a mature microinsurance SaaS startup, building software to help bridge the gap between insurance companies and those who are not insured or under-insured. High traffic, mobile first + SMS and USSD platform that requires some interesting compliance and security requirements with deployments in countries with variable quality infrastructure.Stack is Vue.js with mostly django in the back end although pyramid/sqlalchemy is being introduced. Plenty of third party api integration. Gitlab, unit tests, and continuous integration are standard.Our devops stack includes Ansible and Terraform, and we operate across the majour cloud providers, as well as a few smaller players! Mature and international dev team with a few PhD’s included.Ideally we’re looking for a mature developer - industry experience is of course welcome.Please apply to together@democrance.com by clearly stating the role you want to apply for, your name, current location and visa status, your notice period, salary (Please do not apply again if you already have).Detailed Job Descriptions available here:Back end : https://www.democrance.com/senior-back-end-software-engineer...DevOps : https://www.democrance.com/devops/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada",
        "latin america",
        "europe",
        "asia",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Dubai, UAE",
      "positions": null,
      "tech_stack": [
        "Python",
        "Django",
        "Pyramid",
        "Vue.js",
        "SQLAlchemy",
        "Gitlab",
        "Ansible",
        "Terraform"
      ]
    },
    "categorized_tech": [
      "python",
      "django",
      "vue",
      "ansible",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494527,
    "description": "Stellar Science | Hybrid USA Washington DC, Albuquerque NM | Full time, INTERNS/co-ops | U.S. citizenship required | https://www.stellarscience.comCompany: We're a small scientific software development company that develops custom scientific and engineering analysis applications in domains including: computer vision and image processing, space situational awareness (monitoring the locations, health and status of on-orbit satellites), metamaterials design, image simulation, high power microwave systems, modeling and simulation, machine learning, physics informed neural networks (PINN), human body thermoregulation, laser systems modeling, high performance computing (HPC), computer aided design (CAD), and more. All exciting applications and no CRUD. We emphasize high quality code and lightweight processes that free software engineers to be productive.Experience: We typically look for Bachelors degrees in computer science, physics, engineering, math, or a related field, and also hire Masters and PhDs (roughly 30% of our staff have PhDs.)Technologies: Mostly C++20/23 with coroutines and generators, Qt 6, CMake, Boost, Jenkins, git, OpenGL, CUDA, OpenSceneGraph. Windows and Linux, msvc/gcc/clang/clangcl, Visual Studio 2022 or any productive IDE. Some projects use Python, Java, or Javascript.Apply online at https://www.stellarscience.com/careers/.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Full time",
        "INTERNS/co-ops"
      ],
      "tech_stack": [
        "C++20/23",
        "coroutines",
        "generators",
        "Qt 6",
        "CMake",
        "Boost",
        "Jenkins",
        "git",
        "OpenGL",
        "CUDA",
        "OpenSceneGraph",
        "Python",
        "Java",
        "Javascript"
      ]
    },
    "categorized_tech": [
      "coroutines",
      "generators",
      "qt",
      "cmake",
      "boost",
      "jenkins",
      "git",
      "opengl",
      "cuda",
      "openscenegraph",
      "python",
      "java",
      "javascript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493462,
    "description": "Mind AI | (Senior) Software Engineer | Full-Time | REMOTE or ONSITE (Seoul, South Korea) | https://www.mind.ai/ We're Mind AI and pioneering a unique approach in artificial intelligence, moving beyond the dominant approaches and ideas of deep learning and neural networks.To enhance our reasoning engine, a Common Lisp implementation of our patented information interpretation methodology, we are seeking additional team members who have knowledge and practical experience with Common Lisp. More details here: https://mind-ai.notion.site/Senior-Software-Engineer-7f189b1...If you have any questions or wish to apply for the position, please send an email to lisp-job@mind.ai with your inquiries or your resume accompanied by a cover letter.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Seoul, South Korea",
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "Common Lisp"
      ]
    },
    "categorized_tech": [
      "lisp"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38491617,
    "description": "Rewind (https://rewind.ai) | Full-time | Remote | https://rewind.aiRewind is a personalized AI powered by everything you’ve seen, said, or heard. Our investors include Sam Altman (OpenAI CEO), Alexis Ohanian (Co-Founder of Reddit), and many other tech leaders. We are a well-funded, 17-person, remote-first startup.We are hiring for:Senior/Staff/Principal Engineer (Applied AI) - https://jobs.lever.co/rewind.ai/0af8dbea-ebd2-481b-9fd4-7b34...Senior/Staff/Principal Engineer (React) - https://jobs.lever.co/rewind.ai/6e72b26b-8885-4a49-bb2b-bac0...Senior/Staff/Principal Engineer (Backend) - https://jobs.lever.co/rewind.ai/6c07a0d6-ca7b-426c-a953-2158...Senior/Staff/Principal Engineer (Generalist) - https://jobs.lever.co/rewind.ai/8d48c7a2-d5a3-4a6e-91ba-6342...Senior/Staff/Principal Engineer (Firmware) - https://jobs.lever.co/rewind.ai/c3d7f869-02ba-42fc-b9e8-39f4...Social Media Manager - https://jobs.lever.co/rewind.ai/c0a70d70-c6ef-4c39-8729-ce64...For more information about our benefits and culture (including quarterly retreats, top of the line gear, etc), check out https://rewind.ai/careers\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior/Staff/Principal Engineer (Applied AI)",
        "Senior/Staff/Principal Engineer (React)",
        "Senior/Staff/Principal Engineer (Backend)",
        "Senior/Staff/Principal Engineer (Generalist)",
        "Senior/Staff/Principal Engineer (Firmware)",
        "Social Media Manager"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492202,
    "description": "SmarterDx | 180 - 230K + equity + benefits | Remote first (but U.S. only due to data confidentiality) | Full timeWe are an early stage health tech company using AI to improve hospital revenue cycle (making healthcare costs lower and allowing doctors to focus on patient care). The team is small but high functioning (MD + data scientist combos, former ASF board member, Google and Amazon engineers, Stanford LLM researchers, etc.) and initially scaled the company to $1MM+ in contracted revenue without raising capital.We have been backed by top investors including Floodgate (Lyft, Twitch, Twitter), Bessemer, and are currently on pace to 30X in revenue over a two-year time period.Who we are looking for:- Data scientists- ML Ops- FS Eng (Senior and Staff)- Product designer- Technical PM (not listed yet on careers but we are hiring for this!)Be part of the journey as we hone our PMF and build to scale! For more, see: https://smarterdx.com/careersIf interested email us at hiring at smarterdx dot com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": 180000,
        "max": 230000
      },
      "company_location": null,
      "positions": [
        "data scientist",
        "ML Ops",
        "FS Eng (Senior and Staff)",
        "product designer",
        "technical PM"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data science"
    ]
  },
  {
    "id": 38491263,
    "description": "Turnstile (https://www.tryturnstile.com) | REMOTE (US/Canada) | Engineering | $185k-250k salary + equity---We're a small (24-person) team of repeat founders and seasoned operators building a usage-based revenue platform that helps SaaS companies price however they want. This is a tight-knit and senior crew — most of us have 10-25 years' experience, much of it together.The last company we started, Second Measure (YC S15), scaled to 70+ people and tens of millions in revenue, received multiple “best places to work” awards, and was ultimately acquired by Bloomberg in a landmark deal.We're looking for extraordinary builders to play a foundational role in a company designed for scale:  - Billing Platform Engineer (Staff or higher)\n\nWe're well-funded by top investors (led by First Round Capital), fully distributed, and known for building intentional, inclusive culture. We offer competitive global rates (SF salary + equity), equal pay by level, work flexibility (including a 4-day core schedule), and comprehensive, family-friendly benefits.I'm Mike, one of the founders— if interested, apply here (https://tryturnstile.com/about) and mention this post.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada"
      ],
      "compensation": {
        "min": 185000,
        "max": 250000
      },
      "company_location": null,
      "positions": [
        "Billing Platform Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491900,
    "description": "Socket (https://socket.dev) | Staff Software Engineer & Security Researcher | SF or REMOTE | Full-timeIf you specialize in making computers do things they’re not supposed to do, please drop us a line.Socket's mission is to help developers and security teams to ship faster and spend less time on security busywork. Thousands of organizations use Socket to safely discover, audit, and manage their open source code. Our customers – from Figma to Vercel – absolutely love Socket (just read their tweets to see for yourself! [1])The company was founded by Feross Aboukhadijeh [2], who has worked in open source software for 10+ years writing software that receives more than a billion downloads per month. We have raised $25M in funding [3] from the best angel investors, operators, and security leaders in the industry.We're a small team (~15) but we're already depended on by top companies like Figma, Vercel, Brave, Replit, Expo, Metamask, a massive telecom in Canada, as well as three massive AI companies that you've definitely heard of ;)See all job openings here: https://socket.dev/careers[1]: https://socket.dev/love[2]: https://www.linkedin.com/in/feross/[3]: https://socket.dev/blog/series-a\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF",
      "positions": [
        "Staff Software Engineer",
        "Security Researcher"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491483,
    "description": "Canopy Connect | $160-205k | Full-time | Remote | Product EngineerCanopy Connect is single-click insurance data sharing (like \"Plaid for insurance\").We serve over 3,500 companies (and growing rapidly!) including insurance agencies, lenders, insurtechs, fintechs, and insurance carriers to streamline acquiring verified insurance data from consumers and businesses.We're hiring Product Engineers. We're a small, fully remote team based in the US and Canada. We present the best of both worlds - a nimble startup and small team (low strike price on equity and more ownership/impact), yet derisked because of our capital efficiency.Apply here: https://www.usecanopy.com/company/careers\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "canada"
      ],
      "compensation": {
        "min": 160000,
        "max": 205000
      },
      "company_location": null,
      "positions": [
        "Product Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38525973,
    "description": "Collaborative Drug Discovery | Engineering | Remote | Full-timeWe provide a hosted scientific data management system that helps researchers organize, collaborate, and make discoveries faster. Our customers include pharmas, biotechs, and academic labs. We are profitable, loved by our customers[1], and growing.Experience in biology or chemistry is a plus but by no means required. Our team is small enough that you will have a big impact, but established enough to foster strong engineering practices.[1] https://www.capterra.com/p/171280/CDD-Vault/reviews/Software Engineer: https://www.collaborativedrug.com/senior-software-engineerSecurity Engineer: https://www.collaborativedrug.com/security-engineerDevOps/Platform Engineer: https://www.collaborativedrug.com/devops-infrastructure-engi...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer",
        "Security Engineer",
        "DevOps/Platform Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer",
      "security engineer"
    ]
  },
  {
    "id": 38527191,
    "description": "BackNine Insurance (back9ins.com) | Rails Developer | RemoteBackNine automates the sales process of insurance products from submission to commission so agents can easily sell products from 30+ insurance carriers from their own website. Thousands of companies from brick and mortar insurance agencies to publicly traded banks use BackNine's software to quote, apply, and manage their life/annuity/long term care insurance business online.Check out a demo of one of our applications `Quote & Apply` at https://back9ins.com > See it in ActionWe're in need of a Rails developer with at least 2 years of professional Rails experience that's capable of tackling just about any issue who can move fast and test things. We're a small team with a growing product.Please email reid@back9ins.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Rails Developer"
      ],
      "tech_stack": [
        "Rails"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails"
    ],
    "categorized_positions": [
      "rails developer"
    ]
  },
  {
    "id": 38496894,
    "description": "Phrasing | REMOTE | Europe/Amsterdam | Full-TimeLove languages? Want to leverage AI, LLMs, and ML to topple industry giants like Duolingo & Babbel? What a coincidence, we do to.I'm the technical founder of Phrasing (https://phrasing.app). and have built the MVP using Postgres, Python, and ClojureScript. As more of my responsibilities start to lean towards the business side of things, I find myself increasingly distracted from the big juicy technical problems. I'm looking for a CTO who wants to dedicate everyday to the most exciting technology problems of the decade.I can handle the frontend for quite a while longer, but am looking for help on some backend problem areas including: clustering and analyzing vector embeddings, training predictive models, leveraging LLMs to parse minority languages, aligning multilingual text, & so much more.It's still very early days at the company, but it's never too early to start talking to people excited about the product & mission in the following roles:- Senior Software Engineer- Senior ML Engineer- Senior Mobile Engineer (iOS)- Senior Designer / Senior Product DesignerAt Phrasing, we're driven by the belief that a small, dedicated team can indeed topple industry giants. We are absolutely obsessed with every area of the product, and we seek individuals who share an equal passion for the field, the product, and their craft.If that sounds like you then send an email to hackers@phrasing.app and join us - to fluency, & beyond.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Amsterdam",
      "positions": [
        "Senior Software Engineer",
        "Senior ML Engineer",
        "Senior Mobile Engineer (iOS)",
        "Senior Designer / Senior Product Designer"
      ],
      "tech_stack": [
        "Postgres",
        "Python",
        "ClojureScript"
      ]
    },
    "categorized_tech": [
      "postgresql",
      "python"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38491241,
    "description": "Datadog | Senior Software Engineer | NYC/Paris/Madrid | Full-Time | Static Analysis\nWe are building a static analysis engine (https://github.com/DataDog/datadog-static-analyzer) that works across the development lifecycle: IDE -> git hook -> git pull request -> git push. Our product is currently in private beta (see https://www.datadoghq.com/static-analysis/) and we are working hard on expanding its capabilities.If you work with Rust and/or Tree-Sitter, we would love to talk to you!Apply here > https://careers.datadoghq.com/detail/5382867/?gh_jid=5382867\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "Rust",
        "Tree-Sitter"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38494247,
    "description": "Cardless | https://www.cardless.com/ | San Francisco, Hybrid | Full TimeAt Cardless, we’re building a credit card and loyalty platform that consumer businesses use to engage their customers. We’ve launched 9 credit cards, including for the largest mall operator in the U.S. and the largest airline in South America. We help businesses bring imaginative card programs to life, and have pioneered technology to embed credit card features natively into their products. You can learn more about us at our blog - https://www.cardless.com/blogWe are actively hiring for the following role (compensation is annual base salary):- Senior Software Engineer - Frontend ($160,000 - $200,000 USD): https://jobs.lever.co/cardless/ad23717d-3ae1-4887-8549-b9652...We also expect to have a senior backend engineering role open by the middle of this month. Take a look at our careers page to learn more - https://www.cardless.com/careers#open-roles\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 160000,
        "max": 200000
      },
      "company_location": "San Francisco",
      "positions": [
        "Senior Software Engineer - Frontend"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38515408,
    "description": "IVPN | Full-stack Web Developer | Remote (UTC-1 to UTC+3) | Full-time | https://www.ivpn.netIVPN is a privacy-focused VPN service in operation since 2010. We have high ethical standards, regular security audits and a stellar reputation among security and privacy analysts.We are looking for a Full-stack Web Developer to work on a new project for a privacy-friendly DNS solution.Ideally you possess the following knowledge:\n- HTML5, CSS3, JavaScript, and modern JS frameworks (React, Angular, Vue.js)\n- Experience with back-end development, including server, network, and hosting environments, using Node.js / Python or Golang.\n- Knowledge of DNS protocols, privacy tools, and ad-blocking technology.\n- Fluent in SQL and able to create complex database schemas.\n- Understanding of security best practices to safeguard user data.We are looking for mid-level/senior candidates who can own the project from planning to release (with internal help, of course).You can email me directly to discuss the role: viktor@ivpn.net or apply here: https://ivpn.recruitee.com/o/full-stack-web-developer-ivpn \nDon't forget to mention you found this on HN.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Full-stack Web Developer"
      ],
      "tech_stack": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React",
        "Angular",
        "Vue.js",
        "Node.js",
        "Python",
        "Golang",
        "SQL"
      ]
    },
    "categorized_tech": [
      "javascript",
      "react",
      "vue",
      "nodejs",
      "python",
      "go",
      "sql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491211,
    "description": "Skydio - Autonomy Infrastructure | Bay Area - San Mateo | Python & C++Skydio is the leading US drone company and the world leader in aerial autonomy. Our mission is to make the world more productive, creative, and safe with autonomous flight. Today tens of thousands of our robots are flown at scale to inspect critical infrastructure and provide life-saving intelligence, and we have one of the best robotics teams on the planet in support of these goals.Our X10 drone features NVIDIA Orin and Qualcomm 865 processors with 85 TOPS of compute capability, along with onboard 360 trinocular camera coverage. We develop real-time 3D reconstruction and semantic AI so that our robot can understand the world around it and make intelligent decisions.We’re looking for infrastructure engineers for our autonomy team who love making code for flying robots and for making our engineering team more productive. Experience with Python and C++, performance optimization, systems infrastructure, first-principles thinking, 3D visualization, communication and logging. full-stack web apps, and build systems all welcome.I lead the autonomy team and you can reach me at { hayk at skydio dot com }.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Bay Area - San Mateo",
      "positions": [
        "infrastructure engineer"
      ],
      "tech_stack": [
        "Python",
        "C++"
      ]
    },
    "categorized_tech": [
      "python",
      "c_cpp"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493187,
    "description": "Senior Software Engineer (Backend or Fullstack) | Splash.tech | remote | full-time | EU timezoneWe build games that sports fans love to play. Based in the UK, we're a top B2B provider in the gaming sector, powering fan engagement in over 50 countries with notable names in sports and entertainment. Founded four years ago, our company has seen a 100%+ revenue growth annually for three consecutive years. The 15-strong team at Splash works fully remote and values independent and self-motivated members.We’re looking for several experienced Software Engineers. Based on your area of expertise, you’ll build backend or full-stack components and contribute towards system architecture, security and scalability. As part of the engineering team, you’ll own the whole development lifecycle from receiving/aligning requirements to development, test and operations.Responsibilities- You own the development of backend or full-stack (depending on your expertise and focus area) features end-to-end.- Collaborate with stakeholders, ensure product quality and impact decision making.Optimize applications for speed, security and scale.Requirements- 5+ years of relevant engineering experience at tech and product-driven companies- Proficiency with Java/Spring (and Javascript or other web frameworks, we use Angular).- Some experience with relational databases (we use Postgres)- Desire to work fully remote and to proactively approach issues- Fluent EnglishDepending on your location we’ll offer a competitive market rate salary for your experience level as well as stock options.Contact: Oliver Renner, CTO - oliver@splash.tech\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "Europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "UK",
      "positions": [
        "Senior Software Engineer (Backend or Fullstack)"
      ],
      "tech_stack": [
        "Java",
        "Spring",
        "JavaScript",
        "Angular",
        "Postgres"
      ]
    },
    "categorized_tech": [
      "java",
      "javascript",
      "postgresql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38528209,
    "description": "Zattoo - Principal Software Engineer (QA) - Berlin or REMOTE in Europe - Full-time\nhttps://zattoo.com/de/company/jobs/job/4195407101?gh_jid=419...ZATTOO\nBack in 2005, we pioneered Europe’s first TV streaming service. Today, we’re the world’s first certified climate neutral TV streaming provider. 3 million users across three countries. Over 230 colleagues of 47 nationalities. We’re the grown-up start-up, helping to shape a better future since day one. That hasn’t changed, even if the world has. We’re friendly, international, inclusive – and our people say we’re reliable and transparent, too. It’s why they trust us and believe in what we do.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Berlin",
      "positions": [
        "Principal Software Engineer (QA)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492508,
    "description": "CareerVillage.org | Software Engineers | REMOTE | Full-timeTech for good: We're a tech nonprofit building an AI Career Coach for education and workforce development customers. We are a well-funded, remote-first 501c3 that has been developing large-scale career platforms for underrepresented youth for over a decade. We've served millions of young people, and are an early mover on AI within the nonprofit space. The stack is Django, Langchain, React. AWS and GCP. Multi-LLM.We have four software engineering positions open: https://boards.greenhouse.io/careervillage\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": [
        "Django",
        "Langchain",
        "React",
        "AWS",
        "GCP"
      ]
    },
    "categorized_tech": [
      "django",
      "react",
      "aws",
      "google_cloud"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492277,
    "description": "ROCKSTAR GAMES | NYC-San Diego-New England| FULL-TIME | .NET SOFTWARE ENGINEERS | Existing Visa Transfers WelcomeA career at Rockstar Games is about being part of a team working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium. You would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the most talented people in the industry.RESPONSIBILITIESDevelop highly scalable server-side features for our online game console clients using object-oriented development in C#, ASP.NET, and SQL Server.Develop back-end services and APIs. Actively practice Test Driven Development (TDD) while developing new features and refactoring existing code.Work in an AWS cloud-based, event-driven microservice architecture with a high priority on web performance optimization.Collaborate with other Rockstar technology teams across our worldwide studios.New York: https://www.rockstargames.com/careers/openings/position/4187...San Diego: https://www.rockstargames.com/careers/openings/position/4110...New England: https://www.rockstargames.com/careers/openings/position/4161...You can see our other openings here: https://www.rockstargames.com/careers/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        ".NET SOFTWARE ENGINEERS"
      ],
      "tech_stack": [
        "C#",
        ".NET",
        "ASP.NET",
        "SQL Server",
        "AWS"
      ]
    },
    "categorized_tech": [
      "csharp",
      ".net",
      "asp.net",
      "sql",
      "aws"
    ],
    "categorized_positions": []
  },
  {
    "id": 38521537,
    "description": "Samsung Semiconductor EMEA - https://semiconductor.samsung.com/emea/ - Onsite Munich - Full-timeSamsung Semiconductor Europe is a part of the global network of Samsung Electronics Co., Ltd. for providing component solutions, featuring industry-leading technologies in the areas of memory, system LSI, foundry, LED and display in Europe, the Middle East and Africa.Read more here: https://semiconductor.samsung.com/emea/about-us/Open positions:\nProduct Marketing Manager (f/m/d) Telematic and Connectivity | Strategic Planning Specialist (f/m/d) | Account Manager Foundry (H/F) | Customer Quality Manager (f/m/d) - Semiconductor | Project Manager SoC (f/m/d) | Project Engineer Displays (f/m/d) for Automotive Display | Field Application Engineer (f/m/d) - Image Signal Processing/Image Sensorand more, find out more open position or apply here: https://semiconductor.samsung.com/emea/about-us/jobs/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Munich",
      "positions": [
        "Product Marketing Manager (f/m/d) Telematic and Connectivity",
        "Strategic Planning Specialist (f/m/d)",
        "Account Manager Foundry (H/F)",
        "Customer Quality Manager (f/m/d) - Semiconductor",
        "Project Manager SoC (f/m/d)",
        "Project Engineer Displays (f/m/d) for Automotive Display",
        "Field Application Engineer (f/m/d) - Image Signal Processing/Image Sensor"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492572,
    "description": "TileDB, Inc. | Full-Time | REMOTE | USA, Greece/EU | https://tiledb.comTileDB has recently announced a $34 million Series B fund-raise and is actively hiring for engineers across a range of roles (SRE, backend/distributed systems, Python, C++, and more). You will have the opportunity to work on innovative technology that creates impact for challenging problems in genomics, geospatial, machine learning, distributed systems, and many other areas.TileDB Cloud is the modern database, allowing developers and scientists to capture, analyze, and share any data with any tool. We build on a broad foundation of open source, maintaining the TileDB storage engine, libraries for genomics (single-cell and population), geospatial (raster, point clouds, and more), a TileDB visualization engine extending Babylon.js, and much more (github.com/TileDB-Inc/TileDB)With TileDB, all data — tables, genomics, images, videos, location, time-series — is captured as multi-dimensional arrays. To supercharge this data, TileDB Cloud implements a serverless infrastructure delivering query execution, access control, data and code sharing, and distributed computing at global scale — eliminating cluster management, minimizing TCO, and promoting scientific collaboration and reproducibility.Website: https://tiledb.com | GitHub: https://github.com/TileDB-Inc/TileDB | Blog: https://tiledb.com/blogWe are actively hiring for a number of roles including:- Site Reliability Engineer (Golang, k8s, Terraform, automation, Prometheus, CloudWatch, GitOps)- Senior Software Engineer: Backend and distributed systems (Golang, CGo, k8s, Terraform, MySQL/MariaDB)- Senior Software Engineer: Python Data Science Tooling (Jupyter plugins)- Senior+ Software Engineer: C++ Database Internals (database query planning/execution, distributed execution; Rust or other systems language ok if paired with exceptional expertise and willingness to write C++)Apply today at https://tiledb.workable.com or reach out directly (email in profile).\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Site Reliability Engineer",
        "Senior Software Engineer: Backend and Distributed Systems",
        "Senior Software Engineer: Python Data Science Tooling",
        "Senior+ Software Engineer: C++ Database Internals"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "sre"
    ]
  },
  {
    "id": 38491966,
    "description": "Sudowrite | REMOTE | Full-Time | Competitive Salary + Equity | Hiring: AI Engineer- We believe the future of writing is AI & human collaboration. Sudowrite is the best AI for creative writers.- We are profitable with a rapidly growing paying user base.- We've been featured in The New York Times, New Yorker, Verge, etc.- We believe new tools will enable a renaissance in art & creativity and we want to help the next generation of storytellers tell better stories.Wanted: AI Engineers (who also write!)- We’re 100% remote and support work-life balance. We meet up in person a few times of year, last time in Hawaii. We encourage diverse candidates from all over the world to apply.- Details: https://sudowrite.notion.site/We-re-hiring-engineers-to-make...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "AI Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38521813,
    "description": "Digital Health Strategies | Full Stack Engineer (Ruby, JavaScript) | Washington, DC; NYC; Vancouver, BC; remote possible (USA or Canada) | https://digitalhealthstrategies.comWe are a series A health tech and data company working with large health systems to grow patient volumes, connect patients with the care they need, and, in the case of our non-profit clients, raise money from grateful patients.We offer the industry leading grateful patient web app that allows health systems stand up highly integrated web sites quickly and easily to collect stories and feed donor pipeline development.We're a small 17-person team, spread between Washington, DC, New York City, and Vancouver, BC. We reached $4MM+ annual revenue before raising any outside capital.We're looking for a mid to senior full stack software engineer generalist who is eager to manage their own product, likes to build quickly, and is focused on understanding the customer and solving their problems. You will have ownership and autonomy with minimal meetings. We use ruby, rails, javascript, postgres, aws, docker.I'm Arif - reach out if this sounds interesting arif@digitalhealthstrategies.com.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa",
        "canada"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Full Stack Engineer"
      ],
      "tech_stack": [
        "ruby",
        "javascript"
      ]
    },
    "categorized_tech": [
      "ruby",
      "javascript"
    ],
    "categorized_positions": [
      "full stack"
    ]
  },
  {
    "id": 38494624,
    "description": "IPinfo.io | Various Roles | Remote (Anywhere) | Fulltime / Contract | https://ipinfo.ioIPinfo is a leading provider of IP address data. Our API handles almost 100 billion requests a month, and we also license our data for use in many products and services you might have used. We started as a side project back in 2013, offering a free geolocation API, and we've since bootstrapped ourselves to a profitable business with a global team of over 20, and grown our data offerings to include geolocation, IP to company, carrier detection, and VPN detection. Our customers include T-Mobile, Nike, DataDog, DemandBase, Clearbit and many more.We're looking for exceptional and ambitious people to join our team. The main role we're hiring for currently is a Product Manager - ideally with SaaS/DaaS experience, and a technical understanding of our products / services. Apply here: https://ipinfo.bamboohr.com/careers/45?source=aWQ9Mjg%3DWe're always on the look out to strong software or data engineers with an internet measuremenet / analysis background to join our team too. Any questions about the roles or IPinfo feel free to reach out to me directly at ben@ipinfo.io\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Product Manager"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "product manager"
    ]
  },
  {
    "id": 38527860,
    "description": "1 point by JoiceEnjin 26 days ago | parent | context | next | edit | delete [–] | on: Ask HN: Who is hiring? (November 2023)Enjin | Full-time | REMOTE (global) We are the pioneers in building product ecosystem that will help create advanced virtual economies through the power of blockchain technology. We have full-stack platform including a wallet, marketplace, and Efinity (our flagship Polkadot Parachain). https://enjin.io/companyOpen Positions:\nEcosystem Manager https://enjin.io/opportunities/ecosystem-managerMarketing and Communications Lead https://enjin.io/opportunities/marketing-and-communications-...Support and Marketing Associate https://enjin.io/opportunities/support-and-marketing-associa...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Ecosystem Manager",
        "Marketing and Communications Lead",
        "Support and Marketing Associate"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38495122,
    "description": "PHOSPHOR | Remote | New York, NYHiring: CTO, Staff/Senior UI Engineers, AI EngineerStack: Elm/React, Tailwind, F#, Rust, exploring local-first solutionsPHOSPHOR (http://phosphor.co/20x) has solved the last \"impossible\" technology problem in capital markets.We've represented financial models AND contracts as structured, computable data, and we've done so without sacrificing flexibility afforded by Excel or Word. This has never been done, and it enables product opportunities that have never been conceivable before: we have the first real view towards AI that does not hallucinate in the most business critical mediums in finance.I founded Phosphor after building one of the leading clean energy investment platforms in the US as first hire. Phosphor was originally a clean energy finance product, but then we solved a much deeper set of problems. Over three years, I've led three senior engineers as CEO/CTO while we've worked (in stealth) through mind-boggling R&D problems in computable contracts and linguistics.As we focus on commercialization & launch over the next few months, I'm seeking senior product/UI engineers, and I'm beginning a CTO search in hopes of finding a senior technical leader to take the reigns and partner with me to build something OpenAI-scale.For the adventurous of you, resumes to oliver@phosphor.co. Please mention HN in the subject line.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "New York, NY",
      "positions": [
        "CTO",
        "Staff/Senior UI Engineers",
        "AI Engineer"
      ],
      "tech_stack": [
        "Elm/React",
        "Tailwind",
        "F#",
        "Rust"
      ]
    },
    "categorized_tech": [
      "tailwind",
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493750,
    "description": "Sourcegraph | REMOTE | Full-Time | Staff Machine Learning Engineer, Machine Learning Engineer, Engineering Manager, Software Engineers, Developer Advocate, Technical Program Manager, Director of Customer Engineering, Enterprise Technical Advisor, Machine Learning Engineer Intern | https://sourcegraph.comSourcegraph is a code AI platform that makes it easy to read, write, and fix code–even in big, complex codebases.We are building Cody, an AI coding assistant that uses code search and code intelligence to help devs quickly understand what's happening in code and generate new code that matches the best practices in your codebase. Cody supports AI-enabled autocompletion, fixing bugs, refactoring, test generation, code explanation, and answering high-level questions. You can read Steve Yegge's (our Head of Eng - Cody) post on why Cody's code context engine differentiates it from the fast-moving field of AI dev tools: https://about.sourcegraph.com/blog/cheating-is-all-you-need.Apply here: https://grnh.se/0572f98b4us\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Staff Machine Learning Engineer",
        "Machine Learning Engineer",
        "Engineering Manager",
        "Software Engineers",
        "Developer Advocate",
        "Technical Program Manager",
        "Director of Customer Engineering",
        "Enterprise Technical Advisor",
        "Machine Learning Engineer Intern"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "machine learning",
      "engineering manager",
      "developer relations"
    ]
  },
  {
    "id": 38514647,
    "description": "Wheelhouse (https://www.usewheelhouse.com) | REMOTE | Full-time | Design & Front-end engineer\n--\nWe’re a small team of designers, engineers and operators in the hospitality space.\nWe’re building a revenue management platform for the $500B+ flex rental space. Our technology empowers short & mid-length stay operators, who manage single-family homes, apartment buildings, and (in some cases) hotels - a broad & massive addressable market.In 2021, our target customer segment voted our platform “Innovation of the Year” at the Data & Revenue Management conference. In 2022, we closed a significant funding round (via many of the best tech, travel & real estate investors) providing us a long runway, low burn, and rapidly growing revenue.More about us:\nAs a team, we enjoy shipping products our customers love, on time or ahead of schedule, while balancing work/life & having fun together. Many have worked together for 8+ years across multiple companies. We’re best described as transparent & collaborative, and we strive to set our teammates up for success - both professionally & personally. We’re a remote-first, work-anywhere, and a “yes - you should make time for that adventure/vacation” company.What we’re looking for:\nAn experienced (3+ years) front-end engineer with design capabilities. Someone passionate about building great user experiences and who is comfortable taking a design from exploration through to production. Ideally, they can build out designs on their own, or, with partial help from our product designer.Bonus — Our product can be complex (lots of data, configurations, edge cases), so, someone looking to solve hard problems with a mind for simplified UIs and intuitive experiences would be ideal.Stack - Tailwind | Chakra | Next.js | Ruby on Rails | Postgres\nBenefits - Competitive salary and equity. Full medical, dental and vision benefits for US employees, Fidelity 401K available for US employees, Unlimited PTO, and more.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Design & Front-end engineer"
      ],
      "tech_stack": [
        "Tailwind",
        "Chakra",
        "Next.js",
        "Ruby on Rails",
        "Postgres"
      ]
    },
    "categorized_tech": [
      "tailwind",
      "nextjs",
      "ruby_on_rails",
      "postgresql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38495008,
    "description": "Afresh | Applied Scientist / Data Scientist / Data Engineer | San Francisco, CA | Full-time | On-site/remote | https://www.afresh.comAfresh builds modern supply chain technology for the challenges of fresh food. Every year, one-third of food produced globally goes to waste. In the United States, 40 percent of food waste occurs at the retail and consumer level. Most of this waste occurs in fresh food departments at grocery stores. Afresh is working to eliminate this waste.Our machine learning team is hiring for three roles at the staff level: data scientist, applied scientist, and data engineer. We work on crunchy machine learning, operations research, and data problems that are hard to find anywhere else. Fresh food is harder than it looks: https://medium.com/afresh-engineering/whats-so-hard-about-or....Please take a look and apply if you're interested!https://boards.greenhouse.io/afresh/jobs/5028533004https://boards.greenhouse.io/afresh/jobs/5017634004[Applied Scientist role coming soon, please comment if interested or refresh our careers page]\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "San Francisco, CA",
      "positions": [
        "Applied Scientist",
        "Data Scientist",
        "Data Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data science",
      "data engineer"
    ]
  },
  {
    "id": 38497050,
    "description": "Reef Technologies | Senior Python Backend Engineer | REMOTE | Full-time Salary: 45-70 USD per hour, or 7560-11760 USD a month (assuming 40 hours per week). Hourly rates typically adjusted annually.We’re all about the backend! As a fully remote Python software house, we comprise a small, agile team of senior engineers, each with at least five years of experience. We're known for delivering stable solutions and always accounting for edge cases, minimizing the need for urgent fixes.- Full Remote Flexibility: Work from anywhere.- Flexible Hours: Pick your own hours, with only ~2 calls per week.- Dynamic Projects: Work with startups globally on projects of your choice.- Influence: Contribute to decisions and influence how we operate.- Project Selection: Only accept projects you're interested in.- No managers; thanks to the Sociocracy 3.0 framework, everyone's opinion is valued.- Personal assistant for your non-work tasks.- Multicultural environment with a voice for everyone.Who Are We Looking For? Experienced Python engineer with at least 5 years of programming (not necessarily professional), including at least a year with Python. Must have a deep love for Python and the ability to come up with Pythonic solutions to problems.How to Apply: Just go to https://careers.reef.pl/ and see what we’re all about! Do not send us CVs.Contact: Email: hiring@reef.pl Company Website: https://reef-technologies.com/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 45,
        "max": 70
      },
      "company_location": null,
      "positions": [
        "Senior Python Backend Engineer"
      ],
      "tech_stack": [
        "Python"
      ]
    },
    "categorized_tech": [
      "python"
    ],
    "categorized_positions": []
  },
  {
    "id": 38495309,
    "description": "Ride with GPS | Experienced Linux Systems Engineer | within 2 hours of Portland OR | Full Time | https://ridewithgps.com/about\nWe are the world's largest library of bike routes, and we enable cyclists to go on better rides, more often. We have a website and mobile apps that allow people to discover the best riding in their area, and get turn by turn navigation using either our mobile apps or the bike computer of their choosing. Come join us in taking Ride with GPS to the next level! We have one opening right now:- Linux Systems Engineer: https://ridewithgps.com/careers/systems_engineer - Work the full deployment stack, from hardware to containers. We are looking for an experienced engineer practiced in the deployment of Linux based machines and services on top of them. We run on a rack of machines that we own, co-located in the Pittock, and we deploy services both directly on Linux as well as via containers. This is part SRE, part DevOps, part classic SysAdmin, with the occasional networking issue. We need someone who is within driving distance of our rack in Portland and who has experience working in a datacenter, but the majority of the job is in the deployment of services on those machines, not the machines themselves. Are you a jack of all trades, comfortable occasionally working with hardware, while being highly proficient in Linux and container based deployments? Maybe you are light on modern container orchestration but are highly capable and interested in learning? We'd love to talk to you!\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Portland OR",
      "positions": [
        "Experienced Linux Systems Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38512168,
    "description": "Fennel AI | Software Engineers & Marketing Leads | ONSITE (Palo Alto) and REMOTE | Full-timeSeed stage startup building realtime AI Infrastructure, built by an ex-Facebook/Google team, backed by people like ex-CTO of Facebook, creator of Kafka, CEO of Microsoft Bing etc.Already have paying customers and are well-funded. Building very deep distributed systems using Rust - examples include stream processing engine (like Apache Flink or Spark) written in Rust, high performance K/V stores built on top of RocksDB etc.Checkout our documentation and architecture here - https://docs.fennel.ai/Hiring for the following roles:- Systems Engineer (to build core systems using Rust)- Platform/Cloud Infrastructure Engineer (to build the control plane)- Marketing LeadAll the job postings are available here - https://app.dover.io/Fennel/careers/a64c7dd3-38b7-4e6d-ae42-..., feel free to apply directly there.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Palo Alto",
      "positions": [
        "Systems Engineer",
        "Platform/Cloud Infrastructure Engineer",
        "Marketing Lead"
      ],
      "tech_stack": [
        "Rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491470,
    "description": "TalkJS (https://talkjs.com) | REMOTE (Europe / Middle East / Africa)TalkJS lets developers build a perfect chat feature in mere minutes. We power communication in online marketplaces, community sites, multiplayer apps, trading platforms and so on. We're product driven and we care tremendously about quality.We're headquartered in the Netherlands and our team is spread across the Central European Timezone +/- 3h.Currently particularly looking for:    * Mobile SDK Developer (iOS/Android/React Native/Flutter)\n    * Full-stack Developer (TypeScript/Elixir/Postgres)\n\nIf you enjoy crafting perfect libraries and APIs for other programmers to use, get in touch!TalkJS touches millions of people and is growing quickly. We want to be the tool that every developer thinks of for building communication features, a bit like what Stripe is for payments. 80% of the company is product people, founders are a designer and a programmer.Our strategy is to give great engineers the maximum amount of freedom, so they can ship fantastic SDKs, APIs and features. This means a lot of responsibility, a sane work/life balance, no meetings, no red tape. We're growing, profitable, and not dependent on venture funding. Sound good?More info on all positions + how to apply: https://talkjs.com/jobs/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Netherlands",
      "positions": [
        "Mobile SDK Developer (iOS/Android/React Native/Flutter)",
        "Full-stack Developer (TypeScript/Elixir/Postgres)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38494334,
    "description": "Nobias Therapeutics | Norcal/Mountain View/Palo Alto/SF; Philadelphia, PA; other locations welcome - particularly Boston, MA; Miami, FL; Austin, TX; REMOTE also acceptable (US, Canada, London/England, other countries considered on a case-by-case basis) | Full-Time | salary + equityHello HN!  We have hired a number of people from this monthly \"Who is hiring?\" post.  Please don't be put off by how spare our website is.  We are doing very exciting work at the nexus of biology and computer science, and we would love to talk to you.  If you've reached out recently but haven't heard back, we appreciate your patience as we work through a backlog of submissions.  We have primary offices in Mountain View, CA and Philadelphia, PA - so even though we have a number of remote and hybrid employees, we're particularly excited about hiring local people.Nobias is a new pharma startup using a variety of built-from-scratch, custom AI tools to speed drug development.  As an early stage biotech, we use large repositories of biological data, bleeding edge deep learning techniques, automated reasoning, and computational biochemistry to discover and develop new medicines, diagnostics/biomarkers, and biological insights for a variety of diseases, particularly pediatric rare diseases.  If you have strong programming chops, a background in machine learning, and deep knowledge of biology or computational chemistry, we would love to speak with you.Multiple roles are available - right now we are particularly concentrating on expanding our stable of AI engineers who have deep expertise in modern ML techniques.  You should understand these techniques at the deepest level possible, and be able to extend existing research and construct new concepts from scratch, while also understanding cell and molecular biology very well.  Finally, we are also recruiting for a leader in Translational Research.  This position will focus more on outstanding biology knowledge and the process of moving from concept to validation.[our domain is nobiastx.com - our website is in flux, so please excuse the lack of detail!]Please contact us at hn_recruiting {@} [our domain].\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "north_america",
        "canada",
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "AI Engineer",
        "Translational Research Leader"
      ],
      "tech_stack": [
        "machine_learning",
        "biology",
        "computational_chemistry"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491098,
    "description": "EnergyHub | Senior DevOps Security Engineer (DevSecOps) | Remote (US Only) | Full-time | $145-160k\nWant to work on helping to decarbonize the electric grid and transportation in the US? (the two biggest sectors for impact)Want to do it at scale? (we control over one million devices across the US making up over 1.8 gigawatts of electrical load for utilities that service 1/3rd of the entire US population)EnergyHub’s software makes it easy for millions of smart device owners to partner with their utility and help decarbonize the grid. Our platform lets consumers turn their smart thermostats, electric cars, EV chargers, batteries, and other products into virtual power plants that keep the grid stable and enable higher penetration of solar and wind power. We work on technology that already provides energy and cost savings to millions of people through partnerships with the leading companies in the Internet of Things.All roles are remote but if you like offices we have them in Brooklyn, NY and Burlington, VT.In addition to a great benefits package, compensation also includes RSUs in our parent company, Alarm.com (ALRM)Note that we can NOT sponsor visas at this time.Apply here for DevSecOps Engineer: https://grnh.se/9334115e2usSee all our open roles here (software engineer, QA manager, data engineering manager, etc): https://grnh.se/30f1ece22us\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": 145000,
        "max": 160000
      },
      "company_location": null,
      "positions": [
        "Senior DevOps Security Engineer (DevSecOps)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38496986,
    "description": "ML6 | Machine Learning Engineer, Data Engineer | Python, TensorFlow, PyTorch, GCP, AWS, Azure | Full-time | Amsterdam, Berlin, Ghent (EU) On-site/hybridWe are a Machine Learning consulting company that builds end-to-end Machine Learning solutions. By applying the latest AI research, we keep our clients at the forefront of innovation.If you are interested check out: https://www.ml6.eu/resources/resource-library and https://www.ml6.eu/client-casesWork on innovative projects for the biggest clients across Europe such as Randstad, ASML, FUNKE, and many more! Whether it’s about leveraging LLMs to improve customer support, building data lakes on cloud platforms to improve storage or implementing models using sensor data for quality control. You can find it all at ML6.You will mostly work with Python and a range of ML frameworks such as TensorFlow, PyTorch, or HuggingFace Transformers to solve hard Machine Learning tasks and help bring these application into production by building data pipelines and cloud infrastructure on all of the major cloud providers (GCP, AWS, Azure).We are looking for:• (Senior) Data Engineer• (Senior) Software Engineer• (Senior) Machine Learning Engineer• Alliance Manager – Azure• AI Client Executive• AI Client Partner• AI Project Manager• Talent PartnerApply at: https://ml6.eu/join-us\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Machine Learning Engineer",
        "Data Engineer"
      ],
      "tech_stack": [
        "Python",
        "TensorFlow",
        "PyTorch",
        "GCP",
        "AWS",
        "Azure"
      ]
    },
    "categorized_tech": [
      "python",
      "tensorflow",
      "pytorch",
      "google_cloud",
      "aws",
      "azure"
    ],
    "categorized_positions": [
      "machine learning",
      "data engineer"
    ]
  },
  {
    "id": 38493643,
    "description": "Count | Senior Software Engineer | REMOTE within UK/Europe | Full-time | https://count.coCount is like Jupyter, Tableau and Miro combined in one tool. Data teams at some of the world's leading scale-ups use it for everything from iterating data models to performing deep dive analyses and telling impactful stories backed by data.We're a small team of 8, and we're looking for experienced software engineers who are interested in tackling deep technical challenges in the data analytics space.For the best possible user experience, we have developed various technologies in-house, including a custom WebGL rendering engine, our own data visualization library, and a reactive SQL/Python notebook and database query framework.Example projects: accelerating rendering using quadtree tiling, extending interactivity and customizability of visualizations, leveraging LLMs in data exploration, serverless framework for executing database queries at high concurrency.Our tech stack: TypeScript, Python, Node, WebAssembly, WebGL, Apache Arrow, DuckDB, Kubernetes, React.If you're interested in learning more about Count or what we're working on, please email our CTO at oli [at] count.co.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "TypeScript",
        "Python",
        "Node",
        "WebAssembly",
        "WebGL",
        "Apache Arrow",
        "DuckDB",
        "Kubernetes",
        "React"
      ]
    },
    "categorized_tech": [
      "typescript",
      "python",
      "nodejs",
      "webgl",
      "kubernetes",
      "react"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38496398,
    "description": "Seeking a data engineer/scientist who is a literal master of ETL/DBT and bigquery-like tooling. Reach me via the email address in my profile. We are one of the top 10 players in the algorithmic trading space for domain names. Our stack is primarily Python. We use a lot of Postgres, duckdb, bigquery and other tooling. Engineering focused org. Our founders have been in the business since before ICANN existed. Company is based in London but we have employees all over the world in almost every timezone. Looking for humble yet talented individuals. Remote first company.",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "north_america",
        "usa",
        "canada",
        "latin america",
        "europe",
        "asia",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London",
      "positions": [
        "data engineer",
        "data scientist"
      ],
      "tech_stack": [
        "Python",
        "Postgres",
        "duckdb",
        "bigquery"
      ]
    },
    "categorized_tech": [
      "python",
      "postgresql"
    ],
    "categorized_positions": [
      "data engineer",
      "data science"
    ]
  },
  {
    "id": 38518409,
    "description": "Channable - https://www.channable.com | Utrecht, The Netherlands | ONSITEJoin one of the fastest growing scale-ups in the Netherlands. We currently have several open engineering positions to join our team in Utrecht.\nWe are a young company with a strong engineering culture and some unique data problems, which we are solving for our customers.You can read more about our work on our tech blog: https://www.channable.com/techOur Stack: Haskell, Python, JavaScript, TypeScript, Ember.js, React, PostgreSQL, Redis, Ansible, Terraform, NixWe currently process more than 100 billion products per day and offer technically interesting and challenging work. We are looking for highly motivated and skilled engineers to join our team.Open positions:- Haskell Software Engineer - Infra team: https://jobs.channable.com/o/haskell-software-engineer-02-20...- VP of Engineering: https://jobs.channable.com/o/vp-of-engineering\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Utrecht, The Netherlands",
      "positions": [
        "Haskell Software Engineer - Infra team",
        "VP of Engineering"
      ],
      "tech_stack": [
        "Haskell",
        "Python",
        "JavaScript",
        "TypeScript",
        "Ember.js",
        "React",
        "PostgreSQL",
        "Redis",
        "Ansible",
        "Terraform",
        "Nix"
      ]
    },
    "categorized_tech": [
      "python",
      "javascript",
      "typescript",
      "react",
      "postgresql",
      "redis",
      "ansible",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490947,
    "description": "Beacon AI | https://beaconai.co | Full-Time | SF Bay Area HybridDo you want to join a company building R2-D2 for pilots? Beacon AI does this through a vertically integrated aviation platform. Our team has relevant industry expertise in aviation and autonomy, and we are building features that improve flight safety and efficiency by augmenting pilots.Join a founding team of former Cruise AI engineers and two former fighter pilots, with a world-class advisor team, talented developers, and amazing investors, including Sam Altman, Zach Perret, JetBlue Technology Ventures, and Countdown Capital. Learn (a little bit) more at https://www.beaconai.coWe are currently prioritizing hiring for these three roles to deliver impact on ongoing and future engagements. We expect many more openings within the next 6 months: https://www.beaconai.co/careersSWE - Robotics (Advanced Pilot Assistant Software)[Staff or Senior] This role builds the pilot augmentation features (R2-D2).SWE React Web App (Front End) This role builds critical 3D software to support live flights and flight playback.iOS Software Engineer [Staff or Senior] This role Develops, deploys, and maintains a safety-enhancing iOS applicationApply directly at https://beaconai.co/careers and mention that you found this post on HN!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF Bay Area",
      "positions": [
        "SWE - Robotics (Advanced Pilot Assistant Software) [Staff or Senior]",
        "SWE React Web App (Front End)",
        "iOS Software Engineer [Staff or Senior]"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38494980,
    "description": "ReadWorks | Senior Full Stack Engineer (JavaScript) | $100K - $160K | REMOTE from US | Full-time\nReadWorks is an education technology nonprofit and is looking for a Senior Full Stack Engineer (JavaScript) with a passion for education and literacy to join our engineering team. This is a unique opportunity to contribute to an established education platform that serves nearly thirteen million active students and teachers.What you'll be doing: ReadWorks is looking for an engineer to help us build the next generation of literacy technology. This person will work mainly on our user facing web platform (everything under readworks.org). They will work closely with our Teaching, Learning, & Content (TLC) and Product teams to build features and support our users.Technology we use: JavaScript, Node.js, AWS (DynamoDB, Lambda, EC2, CloudFront, S3, etc.),\nSCSS, Vue.jsMore info here: https://about.readworks.org/careers.htmlContact us: engineering at readworks dot org and mention you read the post on Hacker News!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": 100000,
        "max": 160000
      },
      "company_location": null,
      "positions": [
        "Senior Full Stack Engineer (JavaScript)"
      ],
      "tech_stack": [
        "JavaScript",
        "Node.js",
        "AWS (DynamoDB, Lambda, EC2, CloudFront, S3)",
        "SCSS",
        "Vue.js"
      ]
    },
    "categorized_tech": [
      "javascript",
      "nodejs",
      "vue"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490834,
    "description": "Yurtle | Remote | UK +- 2 hours | Full-time | Full-Stack Software EngineerYurtle is a VC funded (just completed a funding round) startup aiming to tackle the growing crisis of caregiving in the UK and beyond. There are 13 million caregivers in the UK - half of which care for both a child and an elderly relative. With an ageing population and an average 10-year gap between lifespan and years in good health, the demand for care is rampant. With care homes becoming even less appealing post-covid, and a projected shortage of 400,000 professional carers by 2028, family caregivers are filling the void. 12,000 people are thrust into a caregiving role each day in the UK alone [0].We are building a caregiving super app that will provide the right tools, support and community to make caregiving responsibilities significantly more manageable and prevent caregiver burnout. We are then bundling that with a bespoke insurance product that provides money for backup care when a primary caregiver falls ill, which we distribute to companies as an employee benefits package. This allows us to scale much faster than with a direct-to-consumer approach.We are looking for one or two full stack software engineers who are comfortable working in a fast-paced startup environment, and ideally experienced with most, if not all of, React (plus Redux), Node.js, MySQL, Google Cloud, React Native (plus Expo).If you are interested in applying, please send me (the CTO) an email at jobs+hn@yurtle.co.uk[0]: https://www.carersuk.org/policy-and-research/key-facts-and-f...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "UK"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Full-Stack Software Engineer"
      ],
      "tech_stack": [
        "React",
        "Redux",
        "Node.js",
        "MySQL",
        "Google Cloud",
        "React Native",
        "Expo"
      ]
    },
    "categorized_tech": [
      "react",
      "redux",
      "nodejs",
      "mysql",
      "google_cloud",
      "react_native",
      "expo"
    ],
    "categorized_positions": []
  },
  {
    "id": 38495608,
    "description": "Adaltas | Distributed system engineers, data engineers | Paris, France | Full time | On-site | https://www.adaltas.comIn collaboration with its customers and the community, we are building 2 complementary 100% open source data platform. TDP (https://www.trunkdataplatform.io), based on the Hadoop ecosystem, is starting to deploy in production. The second, based on the Kubernetes ecosystem, is in the making. It is a great time to join us as we are gaining momentum. If you are passionate about open source software and data-driven technologies, want to make a difference in the world of data, and become an open source contributor, we would love to hear from you.I'm the CEO of Adaltas, if you are interested please apply here:https://www.adaltas.com/en/careers/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Paris, France",
      "positions": [
        "Distributed system engineer",
        "Data engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data engineer"
    ]
  },
  {
    "id": 38497479,
    "description": "gematik GmbH | Different Positions | Berlin, Germany or remote (Germany)Gematik is the national agency for the digitalisation of Healthcare Services. At gematik we are building concepts and products such as the electronic prescription (eRezept), electronic patient records (ePA) and  the central portal for the communication of laboratory analysis (DEMIS).We work with many standards, above all with FHIR and IHEv2, as main stack we work with Java/SpringBoot for backend and JavaScript/Angular for frontend, but it depends on sub teams and other languages or frameworks are also used (Kotlin, Typescript, VueJS, Quarkus).There are many positions opened on the Job Portal, a good level of knowledge of the German language is highly recommended, for some positions it is also mandatory.Site:\n https://www.gematik.de/ueber-uns/karriere\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "Germany"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Berlin, Germany",
      "positions": [
        "Different Positions"
      ],
      "tech_stack": [
        "Java",
        "SpringBoot",
        "JavaScript",
        "Angular",
        "Kotlin",
        "TypeScript",
        "VueJS",
        "Quarkus"
      ]
    },
    "categorized_tech": [
      "java",
      "javascript",
      "kotlin",
      "typescript",
      "vue"
    ],
    "categorized_positions": []
  },
  {
    "id": 38492148,
    "description": "RUST | REMOTE, WORLDWIDE | FULL-TIMEZynk is building a totally new, all-platform file transfer application that is going to do things right - and will be a breath of fresh air in this crazy world of colossal cloud-powered inefficiency (HN Launch pending).We're a Rust only shop, hiring a REMOTE Rust developer.If you're fascinated by efficiency, performance, stability, reliability, doing things right, as well as pushing the boundaries of what modern hardware and networking can do, this may be for you.If you're not afraid of creating a custom solution that answers the very narrow needs of a task, and and doing it the best way possible, this may be for you.If you ever thought or pondered about if this insane, bloated cluster of cr*p can be replaced by a single modern machine running some custom code or carefully picked components, this may be for you.If KISS means something to you and you love the CLI, this may be for you.If you appreciate what Rust can do for you and the entire lifecycle from dev to robust product, this may be for you.If you've reached the end of this post, this may be for you.We're easy, flexible, non bureaucratic and we don't waste time on unnecessary things.Ignore the website. It's a place holder.  Apply at: m at zynk.it\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Rust Developer"
      ],
      "tech_stack": [
        "Rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490869,
    "description": "Moz | Lead/Sr. Data Engineer | REMOTE (USA / Canada) | Full-time | https://moz.com/We’re a small team building new ETL data pipelines in Go to power Moz’s frontend applications. We leverage AWS (Lambda, SQS, ECS, Eventbridge, S3, etc.), Terraform, and Docker to consume, transform, and aggregate the massive amounts of data provided by our platform & collections teams. I’m specifically looking for a senior engineer to join my team and work with me, and am definitely open to someone looking to get experience as a lead! We also have openings for senior backend / data engineers & a data scientist. Feel free to drop me a line if you’re curious and want to chat more!This job: https://jobs.jobvite.com/careers/moz-group/job/oTillfwBAll Moz jobs: https://moz.com/about/jobsSend me an email: victoria.louie [a-t] moz.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa",
        "canada"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Lead/Sr. Data Engineer"
      ],
      "tech_stack": [
        "Go",
        "AWS",
        "Lambda",
        "SQS",
        "ECS",
        "Eventbridge",
        "S3",
        "Terraform",
        "Docker"
      ]
    },
    "categorized_tech": [
      "go",
      "aws",
      "terraform",
      "docker"
    ],
    "categorized_positions": []
  },
  {
    "id": 38520340,
    "description": "Owner.com | Remote | Full-timeOwner.com’s mission is to help local business owners survive by leveling the playing field – by giving them an all-in-one solution to take back control of their business and truly own their online presence. The Owner platform powers everything from their SEO-optimized website to their online ordering system, while providing powerful email marketing and loyalty programs, reputation management, recruiting solutions, and more.- Senior Software Engineer: https://jobs.lever.co/owner/d72226c5-347e-4e1d-90be-93f204c6...- Staff Product Designer: https://jobs.lever.co/owner/93e82fb3-d5f0-4d0d-9cc2-2f03507f...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Software Engineer",
        "Staff Product Designer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38491301,
    "description": "Resleeve | Remote | Netherlands +- 5 hours | Full-time internship | Machine Learning Engineer (Generative AI)Resleeve is a startup that seeks to transform how fashion designers develop their next fashion item and get a photoshoot from that item. Instead of going through multiple drafts, creating a dummy, hiring a photographer and model, all can now be achieved through Resleeve Studio. We were founded 1 year ago and pivoted in September.Are you in your last year of university or did you recently graduate and do you have hands-on experience with generative models, then this could be a great internship experience. We will provide you with an environment where you will work with the CEO and the CTO (me, ex MLE leader at Bain & Co and BCG) to develop new features for our studio and work with our end-users to address their business needs.We are looking for one to two machine learning engineers with an affinity for pytorch and architecture components, including transformers, autoencoders, diffusion, and embeddings.Interested? Drop me (CTO) an email at jobs+hn@resleeve.ai\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Netherlands +- 5 hours",
      "positions": [
        "Machine Learning Engineer (Generative AI)"
      ],
      "tech_stack": [
        "pytorch"
      ]
    },
    "categorized_tech": [
      "pytorch"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494216,
    "description": "Puma Browser | Remote-first with PST overlap | Engineering & Growth | $75-120k base & 200k+ equity | http://join.puma.ggHi all, I’m Yuriy, founder of Puma Browser. I've previously worked in developer relations at Cloudant (YC S08), Meteor (YC S11), Parse (YC S11), and explored AI/ML (computer vision for self-driving cars) before diving deep into crypto.We started with the idea of a privacy-first browser with built-in micropayments (via the Interledger Protocol) and have since added support for identity (HNS, ENS; Unstoppable Domains in testing) and storage (IPFS; Arweave in testing).We just soft launched Anthropic and OpenAI integrations and excited to make your browser smarter, do more things for you and further explore intersection of crypto & ai. \nIncentive and governance structures for AI companies and training/running LLMs in a decentralized way is a particularly interesting direction imho.We recently surpassed 750k downloads and are excited to grow our team. Our investors include Protocol Labs, Shima Capital, Fenbushi, Don Ho (Orange DAO), Sridhar Ramaswamy (Snowflake, Neeva, Greylock), Jason Warner (ex-GitHub CTO), Illia Polosukhin (NEAR Protocol, Google Deep Learning, TensorFlow) and many more.Our Values:- We value Optimism, Kindness, Curiosity, Speed and Grit.\n- Two recurring weekly meetings to maximize state of flow – Monday all-hands, Friday Demos.\n- Careful with growth and never had to do layoffs.\n- Capital efficient with 3+ years of runway.Open Roles: Ai/ML Engineer, iOS Engineer, Head of Memes & Growth, Internships: Eng, Design, GrowthHow to Apply: visit http://join.puma.gg or email careers+hn [at] pumabrowser.comThank you!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 75000,
        "max": 120000
      },
      "company_location": null,
      "positions": [
        "Ai/ML Engineer",
        "iOS Engineer",
        "Head of Memes & Growth",
        "Internships: Eng",
        "Internships: Design",
        "Internships: Growth"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38515829,
    "description": "Stream | Multiple Positions | Amsterdam, NL and Boulder, US | Remote possible | Full Time | Visa SponsorshipStream powers APIs for Chat Messaging, Activity Feeds, Auto Moderation, Video & Audio that are used by over a billion end-users, and are powered by Go, RocksDB, and Raft - with response times typically measured in single-digit milliseconds.We reached a new industry benchmark for scaling real-time chat as-a-service, with 5 million concurrent connections supported in a single chat channel.\nWe’re currently one of the fastest growing startups in Europe and Colorado on our Series B round of $38 mln: https://tcrn.ch/3peCYXlWe’re hiring for the following positions:* React Native SDK Team Lead (Netherlands/EU Remote)\n * Staff Backend Developer (Go) (Netherlands/EU Remote)* Senior iOS SDK Developer (Netherlands/EU Remote)*  Backend Developer (Python/Django) (Netherlands)* React SDK Developer (Netherlands/EU Remote)* Sales Engineer (APAC)As a part of Stream, you'll have a chance to make a huge impact on the product within a team of the strongest engineers all over the world (over 35 countries aboard).If you are interested in becoming a part of what we do, apply now! \nhttps://getstream.io/team/#jobs\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "React Native SDK Team Lead",
        "Staff Backend Developer (Go)",
        "Senior iOS SDK Developer",
        "Backend Developer (Python/Django)",
        "React SDK Developer",
        "Sales Engineer (APAC)"
      ],
      "tech_stack": [
        "Go",
        "RocksDB",
        "Raft",
        "React Native",
        "Python",
        "Django",
        "React"
      ]
    },
    "categorized_tech": [
      "go",
      "react_native",
      "python",
      "django",
      "react"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493499,
    "description": "Tulip | https://tulip.co/eng | Boston, MA, Munich, Germany, and Budapest, Hungary | Full time | OnsiteDo you want to help transform manufacturing? We are building the best team in the industry to bring consumer-grade user experiences to a space dominated by ancient enterprise technology. Our platform enables our customers to create apps without code and to connect their apps to machines, sensors and smart tools. These augmented production lines would otherwise rely on paper to share information.We have offices in Somerville, MA, Munich, Germany and Budapest, Hungary. We just closed a $100m series C and are using that capital to grow dramatically. Our customers include some of the largest manufacturers in the world across numerous verticals of the manufacturing industry.We'd love to talk to anyone interested, but in particular we are looking to bring folks on in:- SRE/DevOps: Kubernetes-admin, scalable monitoring across the firewall, hybrid cloud/on-prem deployment- Web Development: React+Redux frontend, NodeJS+Mongo+Postgres+Redis backend, syncing data with Meteor, delivering useful, real-time experiences in the browser and on Electron- Data & Pipeline Engineering: planning, implementing, and finding insights with our next generation of process & sensor analytics- IoT/Embedded Software: delivering a reliable, extensible HW platform across arm and x86, all manner of bus/IO tech- Machine Learning & Computer Vision: build end-to-end ML and CV products to track and extract valuable insights from raw data, interact with clients to solve real-world problems with data.Apply at https://tulip.co/careers or email us at jobs@tulip.co\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "SRE/DevOps",
        "Web Development",
        "Data & Pipeline Engineering",
        "IoT/Embedded Software",
        "Machine Learning & Computer Vision"
      ],
      "tech_stack": [
        "React",
        "Redux",
        "NodeJS",
        "Mongo",
        "Postgres",
        "Redis",
        "Meteor"
      ]
    },
    "categorized_tech": [
      "react",
      "redux",
      "nodejs",
      "mongodb",
      "postgresql",
      "redis",
      "meteor"
    ],
    "categorized_positions": [
      "devops",
      "web developer",
      "embedded"
    ]
  },
  {
    "id": 38516395,
    "description": "Attio.com | Senior Product Engineer | £90k-£125k | Remote Europe or UK officeAttio is building a radically new type of CRM – one that is incredibly flexible and as powerful as the most advanced CRM data models but also as intuitive, delightful and collaborative as today’s best no-code software.\n- World class UI\n- Flexible, powerful data model\n- IntegrationsWhy we don’t hire Software Engineers: https://www.linkedin.com/pulse/why-we-dont-hire-software-eng...Apply links - all applicants will receive a response within one week\nFrontend: https://www.notion.so/Senior-Product-Engineer-Frontend-4972c...\nBackend: https://www.notion.so/Senior-Product-Engineer-Backend-710b4d...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe",
        "uk"
      ],
      "compensation": {
        "min": 90000,
        "max": 125000
      },
      "company_location": null,
      "positions": [
        "Senior Product Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38495039,
    "description": "Graphistry / louie.ai | Visualization Engineer | US, global | Full-time | https://www.louie.ai , https://www.graphistry.com/careersGraphistry supercharges investigations with its GPU visual graph AI platform and its new Louie.AI platform for conversational and continuous generative AI analytics. A UC Berkeley spinout, our core platform gets used by banks, enterprises, governments, and data-intensive startups for visually investigating relationships in rich structured data like security logs, user clickstreams, social media, and genomics. The new Louie.AI platform is making analysis even easier through a conversational interface and a backend for scaling to always-on. We have won awards like Gartner Cool Vendor and the recent US Cyber Command AI competition.Visualization engineer role: We're looking for someone to help with 2.0 of our core data visualization engine as we scale our GPU client <> GPU server to another 10-100X, with the current focus especially around 10M-100M-scale WebGL and later WebGPU. This will be interleaved with other visualization engineering tasks prioritized by our customers and product activities, both around Graphistry core and Louie.AI. You will work closely with  teammates expert in JS, GPU, AI, and working with our customers. You will have high levels of ownership. As Graphistry was the team to build & donate the popular Apache Arrow JS framework, make the prototype that led to Nvidia RAPIDS, and generally pioneered the  modern approach of server GPU <-apache arrow-> client GPU high-performance data viz, this will be an engaging role, and we likewise hope to learn from you.Information at https://graphistry.com/careers and more at https://www.louie.ai/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "usa",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Visualization Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38520807,
    "description": "Converge | Founding Product Engineer | London | Full-timeConverge is building data infrastructure for online stores. We make it easy for merchants to understand where their customers come from and help them optimize their customer acquisition.We just graduated from the YC S23 cohort. We serve more than 100 customers (small stores until publicly listed co's) and are profitable.We are looking for a full-stack engineer who gets excited by talking to users and shipping product with us. You will be highly autonomous as to what you choose to work on to maximize your impact on the company.Apply here: https://www.ycombinator.com/companies/converge/jobs/vc4Nbeh-...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London",
      "positions": [
        "Founding Product Engineer"
      ],
      "tech_stack": [
        "full-stack"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38520387,
    "description": "Lucra Payments | https://lucrapayments.com | Remote | Full-timeLucra Payments is on a mission to eliminate authorised payment fraud to make our transactions safer. We provide law firms, accountants, charities to name a few with an online verification platform to help them detect and prevent fraud, streamline processes, and eliminate uncertainties when making payments.We are looking for a .NET Core developer to our team. The full job description and how to apply (cv to jobs@lucra.cc) can be found here.https://www.linkedin.com/jobs/view/3774741943/?refId=ailgMFx...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        ".NET Core developer"
      ],
      "tech_stack": [
        ".NET Core"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38516434,
    "description": "Lux Research Inc. | Senior Team Lead (Ruby on Rails & AI-Focused) | Full-Time | USA or Canada | 140-160K | REMOTELux Research is looking for a well-rounded software engineer that can lead a team of likeminded professionals. You will take ownership of a bespoke CMS, oversee its day-to-day development, and advise on its future development. On top of that, you will become the technical point-person for implementing our AI strategy; one that you will also advise on. Lux Research is a company that is taking AI seriously, and we're looking for someone that espouses this value.Must haves:* 10+ years of hands-on developer experience that demonstrates a progression from junior to senior* 10+ completed projects that you can tell stories about* Experience with LLMs and a career now focused on creating tools with AI.* Content Management Systems (CMS) with a strong understanding of the needs of non-technical users.* A personal interest in sustainability and a genuine care for the environment.Technology must haves: Ruby on Rails (w/Capistrano, Devise), OpenAI, AWS, Javascript, PythonTechnology nice-to-haves: Salesforce, Looker, Docker, Vue.jsWhat you will do:* Lead a team that will turn a conceptual roadmap into working software* Be a thought-leader in AI\n* Enjoy using 50% of your time for communication* Estimate projects and work with the product owner to document requirements* Make major decisions on both solution design and architecture* … and you will write some codeTo apply, please email your resume to hackernews@luxresearchinc.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa",
        "canada"
      ],
      "compensation": {
        "min": 140000,
        "max": 160000
      },
      "company_location": null,
      "positions": [
        "Senior Team Lead (Ruby on Rails & AI-Focused)"
      ],
      "tech_stack": [
        "Ruby on Rails",
        "OpenAI",
        "AWS",
        "Javascript",
        "Python"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails",
      "aws",
      "javascript",
      "python"
    ],
    "categorized_positions": []
  },
  {
    "id": 38519119,
    "description": "Clearscope | Austin, TX + Remote | Ruby on Rails engineerClearscope is a best-in-class digital marketing SaaS that leverages machine learning to arm content marketers with the data, recommendations, and visibility they need to produce quality content that reaches their audience. We're bootstrapped and profitable with 1,000+ paying customers like Adobe, Deloitte, Nvidia, Expedia, HubSpot, Shopify, Intuit, and Condé Nast driving multi-million ARR with 9 team members.—> Clearscope is hiring full-stack engineers who can ship product in a small team setting—> Ruby/Rails + TypeScript monolith with no client-side MVC—> $120-$180k (+ health insurance + 401k for US-based)Apply at [ www.clearscope.io/careers/ror-engineer](https://www.clearscope.io/careers/ror-engineer)\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 120000,
        "max": 180000
      },
      "company_location": "Austin, TX",
      "positions": [
        "Ruby on Rails engineer"
      ],
      "tech_stack": [
        "Ruby",
        "TypeScript"
      ]
    },
    "categorized_tech": [
      "ruby",
      "typescript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494591,
    "description": "Lunaris | Engineering | Tokyo, Japan | On-site | Visa sponsorship | Full Time | https://teamlunaris.com/Lunaris started out as an otaku-centric online shop called Solaris Japan founded in 2008, and is still going strong to this day. As such, many of us here have a huge passion for anime, gaming, or Japanese pop culture in general. It’s not unusual to see an anime figure sitting on someone’s desk, the latest League of Legends tournament streaming on our lounge television, or hear someone discussing their past adventures on Final Fantasy XI.However, our passion doesn’t stop there – we’re a team of self-starters who are driven by results. As Solaris Japan continued its success and our customer base grew, we sought solutions to serve our customers, and added Shopify to our toolkit. We then built a number of custom applications for ourself and automated many of our processes, and realized we could offer these solutions to other e-commerce platforms as well. Thus, Lunaris was born, and with it additional e-commerce solutions like easyPoints, easyRates, and more.We are a team of international engineers, and are actively seeking a few more engineers to join our growing team:- Senior/Lead Engineer - https://teamlunaris.com/eng/jobs/full-stack-developer- Fullstack Engineer - https://teamlunaris.com/seniorlead-engineer-copyTech stack: Elixir, PostgreSQL, AWS, Docker, React (mostly JS)If Lunaris sounds like a good fit for you, and you're ready for a new experience in Japan (or already living here), please check out the above positions and send in your application.Of course, if you have any other questions, feel free to reach us at jobs@lunaris.jp\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Tokyo, Japan",
      "positions": [
        "Senior/Lead Engineer",
        "Fullstack Engineer"
      ],
      "tech_stack": [
        "Elixir",
        "PostgreSQL",
        "AWS",
        "Docker",
        "React"
      ]
    },
    "categorized_tech": [
      "elixir",
      "postgresql",
      "aws",
      "docker",
      "react"
    ],
    "categorized_positions": []
  },
  {
    "id": 38514033,
    "description": "ChemCloud | Senior Full Stack Engineer | ONSITE or REMOTE (Melbourne +/- 2 hours) | Full-Timehttps://www.chemcloud.com.auChemCloud is a digital procurement marketplace that makes it easy to discover, buy, and sell chemicals. Our mission; to accelerate the positive impact of the chemical industry by digitising its ways of working.We're in our third year of operation and we're looking for a Senior Full Stack Engineer to increase our tech bandwidth - we have so many impactful projects genuinely delighting users and we want to deliver more. We're a team of two people in engineering currently (including me as CTO) and we want a senior team member who'll work closely with everyone in the business to help shape the platform going forward.We're part of Paloma Group's venture studio (https://www.palomagroup.com/paloma-ventures) with our HQ in Melbourne, Australia. And workspaces in Sydney, Wellington, Auckland, Christchurch as part of Paloma's studio.Tech: Rails 7, Turbo, Stimulus, TailwindCSS, ViewComponent, Railway. With thousands of tests @ > 98% coverage.Read more and apply at: https://careers-at-chemcloud.super.site/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Melbourne",
      "positions": [
        "Senior Full Stack Engineer"
      ],
      "tech_stack": [
        "Rails 7",
        "Turbo",
        "Stimulus",
        "TailwindCSS",
        "ViewComponent",
        "Railway"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38514009,
    "description": "Adfinis | Engineering | Onsite (Australia) | Full-timehttps://adfinis.com/en/At Adfinis we're all about Open Source technologies. As open source professionals, we offer a wide range of services and solutions from a single source. Open technologies and standards are our key to innovation. With our tailor-made offer, we have the optimal solution for every area in IT.You will work in linux servers all the time. You can also expect to work with Kubernetes, Terraform, Ansible, Gitlab, Vault, Proxmox. We manage servers and services for a wide range of customers. We also deliver projects for our partners (Gitlab, Hashicorp, Suse, Redhat). Think implementations, migrations, upgrades etc.Headquartered in Switzerland, our Australia branch is a newer and smaller team (and growing), with more of a startup culture. We are in the office 3 days per week. We are looking to hire either in Sydney NSW or Brisbane QLD.Sydney   : https://join.com/companies/adfinis/9849282-system-engineer-l...Brisbane : https://join.com/companies/adfinis/9849276-system-engineer-l...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "System Engineer"
      ],
      "tech_stack": [
        "linux",
        "Kubernetes",
        "Terraform",
        "Ansible",
        "Gitlab",
        "Vault",
        "Proxmox"
      ]
    },
    "categorized_tech": [
      "linux",
      "kubernetes",
      "terraform",
      "ansible"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491266,
    "description": "Foxglove | Remote (must be located in US time zones) | Full Time | Open Source | https://foxglove.dev/Foxglove is the leading observability platform for robotics developers. We help robotics and autonomous vehicle companies log, ingest, organize, and visualize multimodal data. We're well funded (series A), ~20 people, with an experienced, fast-moving, and no-nonsense team. Seeking like-minded people to join us!- Senior / Staff Frontend Product Engineer (TypeScript, React, bonus if you have WebGL + Wasm experience)- Head of Product Marketing / Lead Product Marketing Managerhttps://foxglove.dev/careersEmail in my profile if you have questions (no recruiters please).\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior / Staff Frontend Product Engineer",
        "Head of Product Marketing / Lead Product Marketing Manager"
      ],
      "tech_stack": [
        "TypeScript",
        "React",
        "WebGL",
        "Wasm"
      ]
    },
    "categorized_tech": [
      "typescript",
      "react",
      "webgl"
    ],
    "categorized_positions": []
  },
  {
    "id": 38514088,
    "description": "Equal Experts | Multiple Roles | Bengaluru/Pune, India - Hybrid/Remote | Full-time | https://equalexperts.comEqual Experts is an innovative consultancy specializing in the delivery of custom software solutions for blue-chip enterprises and public sector clients across a range of industry sectors. We work on important projects for our clients, deliver market-leading propositions across the digital, online, and mobile channels, and are recognized for our leadership in applying agile and lean delivery methods to assure delivery. We have offices in Australia, Germany, India, South Africa, the UK and the USA.At Equal Experts, we foster a collaborative environment where you can use your diverse skills and work closely with clients, enabling them to enhance their products and add tangible value. It's a world where you collaborate with talented individuals who share your passion, continuously learn new technologies, and implement best practices.Currently, we are actively recruiting for several senior or lead roles, requiring relevant industry experience:  - Data Engineer - 6+ yrs\n  - DevOps Engineer - 6+ yrs\n  - Tech Principal - 10+ yrs\n\nIf interested, please send your resume to sudeep.giri@equalexperts.com and include \"HN: Who is Hiring\" in the email subject line.",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Data Engineer",
        "DevOps Engineer",
        "Tech Principal"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data engineer"
    ]
  },
  {
    "id": 38515052,
    "description": "Attendi | Senior Frontend Engineer | Amsterdam, ON-SITE hybrid | Full-time (80-100%)\nHealthcare professionals have to spend too much time on administrative tasks, when they should be spending that time delivering great care. Attendi allows healthcare professionals to report with their voice. This saves them precious time and removes the screen between client and caregiver, allowing more personal and effective care to be given. We provide an extraordinary work environment: getting paid well to work with smart people on things that directly have a positive impact on society.Healthcare professionals perform all their administrative tasks in electronic health record (EHR) systems. Attendi voice-enables EHR vendors' applications by developing speech-to-text and textual understanding APIs. Our EHR vendor partners also integrate our UI components, like a microphone that implements UX best practices for recording and transcribing audio, into their applications.As our senior frontend developer, your will maintain and improve our microphone component across the web, Android, and iOS platforms, while also creating new components that will be integrated into our partners' applications.We are a small startup team with fewer than ten members, which means no bullshit, moving fast, and getting a generous slice of equity. We're post product-market fit, profitable, and on the cusp of scaling up in the Dutch market.Check out https://attendi.recruitee.com/o/senior-frontend-engineer for more details on the position.Feel free to send any questions to berend [at] attendi [dot] nl.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Amsterdam, ON-SITE hybrid",
      "positions": [
        "Senior Frontend Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38519211,
    "description": "Fern | https://buildwithfern.com | Founding Backend Engineer | $160k + equity | On-site NYC | Full-timeAt Fern, we're creating the modern developer experience platform. We work with developer-focused companies to generate SDKs & API documentation. We're looking for a Founding Backend Engineer with 4+ years of experience to help us scale with our users. You'll join a small team (3 of us) and will be a product owner who designs, builds, and ships weekly.Learn more at https://www.buildwithfern.com/careers\nApply by emailing careers [at] buildwithfern.com with your resume/LinkedIn and why this opportunity interests you\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 160000,
        "max": null
      },
      "company_location": "NYC",
      "positions": [
        "Founding Backend Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38519001,
    "description": "MongoDB | Senior Software Engineer | NYC, hybridJon MongoDB's Cloud Insights & Telemetry team as a Senior Software Engineer. This is a backend heavy full-stack role (70-80% backend work in Java, 20-30% UI work as needed with React/Typescript) based out of our NYC office (~3 days/week).In this role, you'll focus on the Data Explorer tool - this is by far the most used tool across MongoDB's cloud features and allows for developers to visualize and utilize their data.Seeking an engineer with strong backend experience, any web application experience is a plus. Preferably 6+ years experience.Full time role, strong base + RSU grant, full benefits, flex pto, etc.Read more + apply here: https://grnh.se/fea5032c1us\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "NYC",
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "Java",
        "React",
        "TypeScript"
      ]
    },
    "categorized_tech": [
      "java",
      "react",
      "typescript"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38491512,
    "description": "Comikey | Remote (Worldwide) | Software Engineers (Frontend, Backend, Mobile, DevOps) | Full-timeWe are working on a big upcoming manga-related software project, and seeking out developers who are interested in working in the following positions:  - Frontend Web Dev (mostly Vue)\n  - Backend Dev (Go, Typescript, Python etc.)\n  - App Dev (Flutter + FFI)\n  - Dev Ops (Bare metal & Nomad)\n\nPrevious experience working on manga, webtoon, or anime-related software is a plus, whether professionally or as a fan.This would be a full-time (contract, with exceptions), fully-remote position working at a fast pace to deliver a product that will be used by millions of manga fans around the world. If this sounds like something you'd be interested in, please email admin@epub.rocks\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Frontend Web Dev",
        "Backend Dev",
        "App Dev",
        "Dev Ops"
      ],
      "tech_stack": [
        "Vue",
        "Go",
        "Typescript",
        "Python",
        "Flutter"
      ]
    },
    "categorized_tech": [
      "vue",
      "go",
      "typescript",
      "python",
      "flutter"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493053,
    "description": "Viator | Software Engineer all levels and Managers | Full time | Remote & Hybrid On-site | Portugal, UKViator connects suppliers to travelers, creating the world's largest platform for travel experiences.We are growing fast and have many positions to fill in Portugal and the UK.  We are looking for managers and engineers at all levels for full-stack, backend and data teams.  Roles in Portugal require you to be in the office in Lisbon part time.  UK roles can be part time in an office in London or Oxford or fully remote. For the remote roles you still need to be based somewhere in the UK.The full list of open roles is here: https://bit.ly/viator-jobs\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "uk"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38517525,
    "description": "CloudLinix | Remote | Mostly Europe + West Asia | Fulltime | cloudlinux.comCloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and  we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. \nEvery person on our team supports each other and does what we can to ensure we all are successful. \nWe are truly a great place to work.We have 3 main products CloudLinux OS, Imunify, and TuxCare.We are always seeking more python devs, C Devs, and of course Kernel Devs. However we also have many other roles. \nhttps://www.cloudlinux.com/about-us-company-jobs/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "europe",
        "asia"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "python dev",
        "C Dev",
        "Kernel Dev"
      ],
      "tech_stack": [
        "python",
        "C",
        "kernel"
      ]
    },
    "categorized_tech": [
      "python",
      "c_cpp"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491667,
    "description": "Spill (https://www.spill.chat/) | Senior Frontend Engineer (£80-100k) Mid-Level Fullstack Engineer (£65-75k) Mid-Level Devops/SRE (£65-75k) | London, UK (HQ) | ONSITE | Full-timeOur aim is to make counselling and therapy free at the point of use for as many people as possible. We do this by selling a mental health support product to businesses.We're hiring a Senior Frontend Engineer and a Mid-Level Fullstack Engineer and an SRE/Devops engineer into our small product and engineering team of 10.We're a small product-focused company, don't employ any salespeople, and are almost cashflow positive.email calvin[at]spill[dot]chat for a more thorough job spec\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London, UK (HQ)",
      "positions": [
        "Senior Frontend Engineer",
        "Mid-Level Fullstack Engineer",
        "Mid-Level Devops/SRE"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38519084,
    "description": "Mintlify | https://mintlify.com/ | Backend Engineer | On-site San Francisco | Full-timeAt Mintlify, we're creating a world-class developer documentation platform. We're growing fast and we need a world-class backend to scale with our users. We're looking for a generalist backend engineer who isn't afraid of going from 0 to 1 and knows how to architect, build, and make decisions for the foundations of our software. If you're interested in working with production-ready apps with the newest technology in web development, please reach out to hahnbee@mintlify.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "San Francisco",
      "positions": [
        "Backend Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "backend"
    ]
  },
  {
    "id": 38496793,
    "description": "Numeric | Product engineer (4+ YOE) | ONSITE in San Francisco, CA or NYC, NY | https://www.numeric.io/We are building the modern accounting & finance platform. Companies like Wealthfront, AngelList, Clearbit, and more depend on Numeric's workflow and data platform to collaborate, monitor and analyze data, and share insights about their financials.We're an early company with top-tier investors, wonderful customers, and large ambitions.Looking for product & customer-focused engineers[1]; this will fit if you like to build quickly, contribute to product direction, and know your users. We're taking on some foundational challenges and need great engineers who want to dive into the details of the domain, execute with high velocity, and have high ownership.Bonus points for startup experience and/or full-stack experience with Typescript. 4+ YOE.Apply: Email andrew@numeric.io (mention hackernews in subject)[1] https://numeric.notion.site/An-80-20-rule-for-product-develo...More info: https://numeric.notion.site/Full-stack-Engineer-f641816581fc...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Product engineer"
      ],
      "tech_stack": [
        "Typescript"
      ]
    },
    "categorized_tech": [
      "typescript"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491778,
    "description": "GitHub - code search | Staff/Principal Software Engineers | REMOTE (US/UK/Germany) | Full-timeHelping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences.We are hiring for two open roles (Staff and Principal level) in three countries, so there are six listings. All roles are remote, but currently we can only hire for these roles in these countries. These are hands-on engineering positions, writing Rust for a large scale distributed information retrieval system.https://githubinc.jibeapply.com/jobs/2388?lang=en-us - Staff/USA (USD $118,100.00 - USD $313,300.00 /Yr.)https://githubinc.jibeapply.com/jobs/2390?lang=en-us - Staff/UKhttps://githubinc.jibeapply.com/jobs/2389?lang=en-us - Staff/Germanyhttps://githubinc.jibeapply.com/jobs/2385?lang=en-us - Principal/USA (USD $134,800.00 - USD $357,500.00 /Yr.)https://githubinc.jibeapply.com/jobs/2387?lang=en-us - Principal/UKhttps://githubinc.jibeapply.com/jobs/2386?lang=en-us - Principal/Germany\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa",
        "uk",
        "germany"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Staff Software Engineer",
        "Principal Software Engineer"
      ],
      "tech_stack": [
        "Rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38520069,
    "description": "InfoSum | infosum.com | London | Full-timeInfoSum develops a unique, privacy-preserving cloud resource that lets organizations connect their first-party data in a compliant, private and secure way. We power data collaboration across household names. Privacy, security and governance are central to our value proposition with our clients, many of who are highly regulated and work with consumer data.Open Roles:- Director of Security (London, UK or Basingstoke, UK)- Information Security Compliance Analyst (London, UK or Basingstoke, UK)To learn more, please reach out to douglas.weltman@infosum.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London",
      "positions": [
        "Director of Security",
        "Information Security Compliance Analyst"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38515213,
    "description": "Hozana | Full Stack Dev / Symfony Dev / React Dev / Lead Frontend Dev | Lyon, France | ONSITE or REMOTE | FRENCH speakers with EU VISAWe are a non-profit with a mission to unite the world in prayer through technology. We currently edit two prayer apps, with about a million active users.We have a Symfony / React + React Native stack, and are looking for coders, ideally with at least a few years experience and a missionary bent.https://hozana.org\nhttps://rosario.appRead the full job descriptions and apply at https://www.welcometothejungle.com/fr/companies/hozana\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Lyon, France",
      "positions": [
        "Full Stack Dev",
        "Symfony Dev",
        "React Dev",
        "Lead Frontend Dev"
      ],
      "tech_stack": [
        "Symfony",
        "React",
        "React Native"
      ]
    },
    "categorized_tech": [
      "react",
      "react_native"
    ],
    "categorized_positions": []
  },
  {
    "id": 38518904,
    "description": "We are hiring tech roles here at @ Smarkets:DevOps Engineer (London) - https://smarkets.com/job/5397742/Junior Software Engineer (London) - https://smarkets.com/job/5348268/Senior Full Stack Engineer (Malta) - https://smarkets.com/job/5532657/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "DevOps Engineer",
        "Junior Software Engineer",
        "Senior Full Stack Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38519696,
    "description": "Tecton | https://tecton.ai/ | Various roles | Remote (Americas), or Hybrid (San Francisco/New York City) | Full-time*About us*Tecton builds a data management platform (a Feature Platform) to help enterprise customers create the best AI products by solving the most difficult problem in ML: the data. We provide developer tools and infra to accelerate up the production of models for batch and real-time ML.With our platform, teams can refine contextual data for AI products, obtain scalable cloud infrastructure to ingest and serve it at scale, and have a centralized knowledge management and data governance system.Learn more at https://www.tecton.ai/*Careers*Tecton is currently hiring remotely all over the Americas (North, Central and South), and with a hybrid model in SF and NYC (come to the office as much as you want).Some of the challenges our Software Engineering team is tackling now include:- Building the Rift compute engine to allow users to make ML applications WITHOUT Spark: https://www.tecton.ai/blog/unlocking-real-time-ai-for-everyo...- Creating cloud abstractions to allow our product to be used agnostically across many environments: https://www.tecton.ai/blog/announcing-tecton-google-cloud-in...- Tackling the unexplored challenges of enabling real-time ML at scale: https://www.tecton.ai/blog/common-challenges-real-time-machi...*Find our open roles at: https://www.tecton.ai/careers/openings/ *\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "central_america",
        "south_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineering"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38495761,
    "description": "Sphinx Defense | Engineering, DevOps, & Product | Remote (US Only), DC, Colorado Springs, LA | https://www.sphinxdefense.comSphinx Defense builds software to solve complex national security problems for America and its allies. Founded by engineers and technologists with deep experience across commercial and defense technology, we’re building a vehicle-agnostic communication infrastructure to enable satellite operators to securely utilize antenna networks and maneuver satellites in real-time. We're bootstrapped, profitable, and growing aggressively.To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: https://www.keyvalues.com/sphinx-defenseIf you have specific questions, or are interested and don't see a role that looks like a good fit, email me directly at hunter (at) sphinxdefense.comCheck out our open roles: https://www.sphinxdefense.com/#CareersTech Stack: Programming: Python, Flask, pipenv, JSON\nData: PostgreSQL, Vault, ActiveMQ\nInfrastructure: Docker, Terraform, Ansible, AWS, Linux\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Engineering",
        "DevOps",
        "Product"
      ],
      "tech_stack": [
        "Python",
        "Flask",
        "pipenv",
        "JSON",
        "PostgreSQL",
        "Vault",
        "ActiveMQ",
        "Docker",
        "Terraform",
        "Ansible",
        "AWS",
        "Linux"
      ]
    },
    "categorized_tech": [
      "python",
      "flask",
      "postgresql",
      "docker",
      "terraform",
      "ansible",
      "aws",
      "linux"
    ],
    "categorized_positions": [
      "devops"
    ]
  },
  {
    "id": 38518943,
    "description": "Inceptive (https://www.inceptive.team)Biological Software is one or more synthetic molecules that execute complex functions, specified from a program, in a biological system.We are creating tools to develop increasingly powerful biological software for the rational design of novel, broadly accessible medicines and biotechnologies previously out of reach.We are hiring for:* Machine Learning Engineers, Machine Learning Researchers, Scientists, and EntrepreneursOur team is globally remote and we also have offices in Palo Alto and Berlin.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "north_america",
        "europe",
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Machine Learning Engineer",
        "Machine Learning Researcher",
        "Scientist",
        "Entrepreneur"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "machine learning"
    ]
  },
  {
    "id": 38499767,
    "description": "Octopus Energy/Kraken Technologies | Software Engineers in General  | Global | Full-time | Compensation varies per country of residenceDo you care about clean energy? Like remote culture and a global company that still feels like a startup?Only been around 8 years, but we're the largest energy retailer in the UK (100% renewable electricity), do wind and power generation all over the world, and just bought a heat pump factory because we couldn't buy them fast enough.Everything we do is powered with our own software, Kraken. For those who've worked with energy tech/energy utility software, you'll appreciate that it needed to change :)Hiring globally in a variety of roles (https://octopus.energy/careers/join-us/#/), ranging from senior platform roles to entry level backend developers.Feel free to apply on our careers page, and more than happy to share more about the org and mission at tagg.jefferson@kraken.tech .\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492446,
    "description": "Waitwhile | Stockholm, Sweden | Onsite/hybrid remote | Full-time\nWaitwhile works to eliminate the 1 trillion hours that people spend waiting in lines every year. Our platform is trusted by over 10,000 companies worldwide and has helped more than 250 million people enjoy a radically better waiting experience at places like IKEA, Louis Vuitton, Costco, Tribeca Film Festival and more.Hiring for multiple roles for our Stockholm office. Come join our wonderful, supportive team!- Platform Software Engineer: Experienced generalist with deep knowledge of building scalable and maintainable apps and backends https://careers.waitwhile.com/jobs/3244968-software-engineer- Solutions Engineer: Customer facing product expert and problem solver based in Stockholm https://careers.waitwhile.com/jobs/3245527-solutions-enginee...- Web Developer: Lead the technical design, implementation, and maintenance of our homepage (waitwhile.com) in collaboration with our UX, Graphic Design and Marketing team https://careers.waitwhile.com/jobs/3259188-web-developer\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Stockholm, Sweden",
      "positions": [
        "Platform Software Engineer",
        "Solutions Engineer",
        "Web Developer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38495042,
    "description": "Slingshot Biosciences | Senior Software Engineer | Full-time | ONSITE or HYBRID in Emeryville, CA | VISA SponsorshipSlingshot Biosciences is a biotech company focused on synthetic cell development. Synthetic cells can have a huge impact—improve the accuracy of biomedical instruments, lower the cost of drug development and diagnostics, and make healthcare more accessible around the world. We’ve raised a Series A round and the company is still small enough to know everyone.I’m looking for a mission-driven senior software engineer to build out tools for processing and visualizing scientific data. An ideal candidate has worked on a small-to-medium web app before with modern tools. The stack is React, TypeScript, Django, and GCP—full-stack experience is a requirement to be considered for the role but experience with all of those specific tools is not necessary.You will be a foundational part of the company, building tools scientists will rely on. You will need to come into the office at least once per week to work with scientific instruments and meet with collaborators, but you won’t need to be in daily.Submit an application: https://boards.greenhouse.io/slingshotbiosciences/jobs/41469...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Emeryville, CA",
      "positions": [
        "Senior Software Engineer"
      ],
      "tech_stack": [
        "React",
        "TypeScript",
        "Django",
        "GCP"
      ]
    },
    "categorized_tech": [
      "react",
      "typescript",
      "django",
      "google_cloud"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492079,
    "description": "Quadrature | London or New York | Full-time | Onsite | https://quadrature.ai/Quadrature is a UK-based systematic trading company, in the business of building black box (fully automated) trading systems across the global financial markets since its founding in 2010. We're a very tech and research focused org, and are quite different from a lot of other players in the market (more like a tech-driven research institute than a traditional trading firm -- see https://quadrature.ai for the details).We're looking for a skilled engineer to optimise the use of GPGPUs for our AI workloads, for both our model training and inference environments. This is a great opportunity to work with a group of world-class researchers and developers, building out large-scale, black box algorithmic trading systems using cutting-edge tech (advanced ML, thousands of GPUs, multiple global research data centres and trading co-location sites, petabytes of storage, innovation-lab R&D work with strategic partners). Our expectation is that this will be a very high impact role. It'll be based out of either London or New York.https://quadrature.ai/contact\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "engineer"
      ],
      "tech_stack": [
        "GPGPUs",
        "AI",
        "ML"
      ]
    },
    "categorized_tech": [
      "ai",
      "machine_learning"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491635,
    "description": "Depict | Full-stack Engineer and Site Reliability Engineer | Remote or Stockholm, Sweden\nDepict (YC S20, http://depict.ai/) is building a merchandising platform for fashion e-commerce to make shopping a delight and store management a breeze. We serve hundreds of millions of requests every month to power category listings, recommendations and search on some of the largest e-commerce sites in Europe.We’re now looking for- Full-stack Engineer. You’ll help us build a visual merchandising tool that fashion merchants love to work with, working closely with our designers to create a delightful, pixel perfect user experience. We expect you to be great at TypeScript and React. Our backend is mostly written in Python, but we’ll help you learn if you aren’t fully comfortable yet.- Site Reliability Engineer. You’ll help us build and maintain infrastructure to reliably serve thousands of RPS to power business-critical services. You’ll be our first dedicated SRE, so you’ll be leading the work to improve our setup so that we can move fast without breaking things. Some of our current stack is GCP, Kubernetes, Terraform, Loki, Prometheus and ArgoCD, but we’re open to change.The roles aren’t yet up on our Careers page, but if it sounds interesting please reach out to me at john@depict.ai and I’ll be happy to tell you more! We hire remotely but require some overlap with CET, +-3 hours CET.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Stockholm, Sweden",
      "positions": [
        "Full-stack Engineer",
        "Site Reliability Engineer"
      ],
      "tech_stack": [
        "TypeScript",
        "React",
        "Python",
        "GCP",
        "Kubernetes",
        "Terraform",
        "Loki",
        "Prometheus",
        "ArgoCD"
      ]
    },
    "categorized_tech": [
      "typescript",
      "react",
      "python",
      "google_cloud",
      "kubernetes",
      "terraform",
      "prometheus"
    ],
    "categorized_positions": [
      "full stack",
      "sre"
    ]
  },
  {
    "id": 38493290,
    "description": "Founding Full-stack Engineer | Sunnyvale, CA | Onsite | Full-time New Startup in the AI Space Looking for Founding Full-stack Engineers!We are a generative AI startup that is building a game changer product in the code generation space. We are based out of Sunnyvale, CA and are backed by premier VCs. This role will have at least 8+ years of relevant experience, a clear ownership and impact in building our engineering culture in our company.Interested? If so, please reach out to ratud@curietech.net with a resume to learn more.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Sunnyvale, CA",
      "positions": [
        "Founding Full-stack Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38501491,
    "description": "SingleStoreDB (formerly MemSQL) (https://singlestore.com) | India, Portugal | Full Time | RemoteSingleStoreDB is a database focused on high performance and hybrid workloads (HTAP). Our customers include half of the top 10 US banks, 2 of the top 3 US telcos, and 12% of the Fortune 100.Our product is a distributed, relational database that handles both transactions and real-time analytics at scale. Querying is done through standard SQL drivers and syntax, leveraging a broad ecosystem of drivers and applications.We have been building SingleStore since 2011, and building a database-as-a-service product involves a bunch of interesting technical challenges such as:\n* Compilers and code generation* Distributed computing and fault tolerance* UI and User Experience* Integrations with connectors and third-party tools (e.g., Business Intelligence tools like Tableau)* Infrastructure that scales to dozens of thousands of database clusters across GCP, Azure and AWSWe have the following positions open:* Product Designer - Design Systems (Portugal, India)* Senior Platform Engineer (India)* Partner Integration Engineer (Portugal, India)Careers page with individual links for each open position: https://www.singlestore.com/careers/jobs/.If you want to learn more about the engineering work we do, check out https://www.singlestore.com/blog/category/engineering/.Feel free to email me directly via david at singlestore dot com.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Product Designer - Design Systems",
        "Senior Platform Engineer",
        "Partner Integration Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38517609,
    "description": "We are looking for a Senior/Staff Android Engineer at amo the newest project from the same crew that built Zenly (a European social network that was acquired by Snap a few years ago). As an early member of the team, you'll help to build the foundational platform that will power all future features.Paris France, Onsite, Fulltime, visa sponsorship + relocation includedhttps://amo.co/jobs/?ashby_jid=85d3017f-1bc5-4124-8d37-2497f...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Paris France",
      "positions": [
        "Senior/Staff Android Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491841,
    "description": "Nooks (https://nooks.ai) | Software Engineers (full-stack & backend/applied ML) | Full-time | SF or Remote\nHi, I’m one of the founders of Nooks — we’re trying to re-invent how sales teams work with real-time collaboration and AI.Nooks is: - A virtual office: you can work from anywhere in the world, but still work with your team and get feedback and coaching like you’re sitting side-by-side. - and an AI co-pilot. We learn how your team works, identify “winning” strategies behaviors, then share them with the whole team during and after calls!We’re working on fun engineering challenges including complex distributed systems, low-latency algorithms & infrastructure, and modeling sales calls with large language models. You'll also have the chance to make a huge impact on our customers (sales reps who spend 80% of their work day on Nooks.)Right now we’re a small team (~25 ppl) growing super quickly - doubling revenue every quarter, and recently hit $2M ARR!Looking for experienced engineers who love tackling difficult product questions and working closely with customers. Excitement about language models, few-shot learning and other recent AI advances is also a plus :)I’d love to chat: reach me at nikhil [at] nooks.in or apply at the link below: https://nooks.breezy.hr/p/bbc06c1a1bb4-software-engineer\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF",
      "positions": [
        "Software Engineer (full-stack)",
        "Software Engineer (backend/applied ML)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "full stack"
    ]
  },
  {
    "id": 38496796,
    "description": "Schoolyear (Remote CEST±1) - we're a fast-growing start-up based in The Netherlands. Our aim is to simplify IT for educators, allowing them to focus on what truly matters: teaching.We're looking for an engineer that loves to work in a small, fast-pace team to lead our development of a 10k+ node desktop streaming cluster. Tackling challenges like low latency video streaming, multi-vendor orchestration, aggressive auto-scaling and complex networking.We're a tight team (11, 6 engineers) working from all over Europe, all with our own core skills. We work in 8 week development cycles (6 sprint, 2 cooldown) and we have strong technical leadership. We meet up 4 times a year in a team mate's city for an on-site week.Website: https://schoolyear.com\nJob: https://www.linkedin.com/jobs/view/software-engineer-infrast...\nApply: team@schoolyear.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "The Netherlands",
      "positions": [
        "software engineer"
      ],
      "tech_stack": [
        "desktop streaming",
        "low latency video streaming",
        "multi-vendor orchestration",
        "aggressive auto-scaling",
        "complex networking"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38503264,
    "description": "Cassidy - Founding Software Engineer - NYC (Onsite)Cassidy (https://cassidy.ai) is a no-code platform that allows businesses to build custom AI assistants that automate complex multi-step workflows. Cassidy is trained on company knowledge, utilizes all major AI models, and connects with internal tools like Zendesk, Slack, and Notion to carry out the unique workflows of employees.We have just completed our seed round and are ramping up a world class team to build our vision for the future of business. We're growing fast and have an insane distribution advantage in a growing market.If building reliable and dependable automation primitives for non-technical users sounds interesting to you, I'd love to chat! Reach out to ian@cassidyai.com.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "NYC",
      "positions": [
        "Founding Software Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38494091,
    "description": "RINSE | REMOTE or San Francisco, Los Angeles, Chicago, Boston, New York, New Jersey, Seattle, Austin, Dallas, or Washington DC | Software Engineers | Full-Time | https://www.rinse.comRinse provides dry cleaning and laundry delivery services to customers in nine metropolitan areas in the US. We have sophisticated logistics optimization software, a polished consumer product, and firm business fundamentals. We're now almost a decade old - this is a stable, yet consistently growing and innovating, company.Our engineering team is distributed across the United States and internationally, and has been entirely remote for years now, but a desk can be provided in the above cities if you'd prefer.We're open to both newly-graduated engineers or more senior engineers, provided they meet our bar.Search term bingo: Logistics, Django, Python, Optimization, React, React Native, Postgreshttps://www.rinse.com/careers/software-engineer/Interested? Email us as jobs@rinse.com, or my first name at rinse.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineers"
      ],
      "tech_stack": [
        "Logistics",
        "Django",
        "Python",
        "Optimization",
        "React",
        "React Native",
        "Postgres"
      ]
    },
    "categorized_tech": [
      "logistics",
      "django",
      "python",
      "react",
      "react_native",
      "postgresql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38490937,
    "description": "Continua AI | ML Engineers | NYC, SFO, SEA | http://continua.aiStack: Flutter | Python | C# | GCloudContinua was founded earlier this year by a Distinguished Engineer from the Google Brain team to apply the latest innovations in ML/AI and reinvent how people interact with information, with services, and with each other.We're very early; after building several prototypes in our first six months, we’ve developed conviction about an MVP, and we’re building like mad to bring our ideas to users. This is an opportunity to join and help set the product direction of this brand-new company!We’re backed by tier-1 VCs, and we’ve already assembled a team of five engineers with backgrounds at Google, Microsoft, Slack, SpaceX, CourseHero and Stash.We have a limited number of additional spots available on the team for engineers who are excited about building innovative products that leverage the latest advances in techniques like Transformers, RLHF, and LoRA. If that sounds like you, we would love to hear from you.Please apply via https://www.continua.ai/careers and let's embark on this exciting journey together!\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "ML Engineers"
      ],
      "tech_stack": [
        "Flutter",
        "Python",
        "C#",
        "GCloud"
      ]
    },
    "categorized_tech": [
      "flutter",
      "python",
      "csharp"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491742,
    "description": "Early Warning Services (Zelle) | Full-time | ONSITE (Seattle, SF, Phoenix) | Sr. AWS DevOps EngineerI'm looking to add a Sr. Cloud Engineer to the team that works on the cloud infrastructure behind our Zelle and Paze products. We have the typical mix of AWS services provisioned by Terraform.We're returning to the office three days a week after the first of the year so my preference is for folks located near our offices in San Francisco or our Scottsdale, AZ HQ. I'm in Seattle and hope to have an office here in the near future, so a hire in Seattle would technically be remote with the understanding of transitioning to ONSITE once an office is established.Early Warning is a bit unusual in structure: we're a private company that's been around for over 30 years and co-owned by Bank of America, Truist, Capital One, JPMorgan Chase, PNC Bank, U.S. Bank and Wells Fargo.Apply here: https://earlywarning.wd5.myworkdayjobs.com/earlywarningcaree...If you have questions, or want to reach out, my personal email address is in my profile.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Sr. AWS DevOps Engineer"
      ],
      "tech_stack": [
        "AWS",
        "Terraform"
      ]
    },
    "categorized_tech": [
      "aws",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38492313,
    "description": "Cohere Health| Boston, MA | ONSITE OR REMOTECohere Health is simplifying healthcare for patients, their doctors, and all those who are important in a patient’s healthcare experience, both in and out of the doctors office. We build software that is expressly designed to ensure the appropriate plan of care is understood and expeditiously approved, so that patients and doctors can focus on health, rather than payment or administrative hassles.This is a unique opportunity to join a rapidly growing engineering team with great ambition. You will have an outsized influence on the future direction and technology decisions.Our application stack:    - React\n    - Groovy Grails/Springboot\n    - Elasticsearch\n    - Spark/EMR\n    - Kafka\n    - MongoDB\n    - AWS\n\nThroughout the interview process you can expect the following during your time with us:    - Phone call to review with hiring manager\n    - Virtual pairing interview (system architecture and design)\n    - Hopefully a quick decision and offer!\n\n\nData Engineering Manager - https://grnh.se/3fb004a23usPlatform Engineering Manager - https://grnh.se/28f571633usEngineering Manager - https://grnh.se/b4a1f8f43usData Engineer - https://grnh.se/8b01ec763us\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Boston, MA",
      "positions": [
        "Data Engineering Manager",
        "Platform Engineering Manager",
        "Engineering Manager",
        "Data Engineer"
      ],
      "tech_stack": [
        "React",
        "Groovy Grails/Springboot",
        "Elasticsearch",
        "Spark/EMR",
        "Kafka",
        "MongoDB",
        "AWS"
      ]
    },
    "categorized_tech": [
      "react",
      "elasticsearch",
      "kafka",
      "mongodb",
      "aws"
    ],
    "categorized_positions": [
      "data engineer",
      "engineering manager",
      "data engineer"
    ]
  },
  {
    "id": 38515335,
    "description": "VOLKA Games | Senior Backend Developer (Rust) | Limassol, Cyprus | ONSITE |RelocationOur game Taonga: the Island Farm was released in 2016. The core gameplay involves travelling across islands and experiencing adventures on them. Players also have their own island - farm where they prepare resources and set up rewards.We are looking for a passionate Game Backend Developer to join our Rust development project.\nCurrently, as part of our global strategy, we are transitioning our game server to Rust. Changing technologies is an opportunity for us to reevaluate and enhance previous solutions. New features are written directly in Rust.vlk.co/Rust volkagames.com/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Limassol, Cyprus",
      "positions": [
        "Senior Backend Developer (Rust)"
      ],
      "tech_stack": [
        "Rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38515331,
    "description": "VOLKA Games | Senior Backend Developer (Rust) | Limassol, Cyprus | ONSITE |RelocationOur game Taonga: the Island Farm was released in 2016. The core gameplay involves travelling across islands and experiencing adventures on them. Players also have their own island - farm where they prepare resources and set up rewards.We are looking for a passionate Game Backend Developer to join our Rust development project.\nCurrently, as part of our global strategy, we are transitioning our game server to Rust. Changing technologies is an opportunity for us to reevaluate and enhance previous solutions. New features are written directly in Rust.vlk.co/Rust volkagames.com/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Limassol, Cyprus",
      "positions": [
        "Senior Backend Developer (Rust)"
      ],
      "tech_stack": [
        "Rust"
      ]
    },
    "categorized_tech": [
      "rust"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491349,
    "description": "LeaseQuery | MLOps Engineer | US remote or Atlanta, GA | Full-timeI'm hiring an experienced (senior, staff, + level) machine learning engineer to lead the tooling, infrastructure, and ops efforts for the ML team at LeaseQuery.Our team is deploying ML-based services to power features across our suite of products. As we grow the scale and number of our ML-driven features, we are looking to build more robust tools, infrastructure, and ops processes to make our modelers more efficient and our model serving more robust. I'm hoping to find an experienced person that can help us make the best decisions, mentor other team members, and lead the design and implementation of new tools and processes as an IC.LeaseQuery makes software to help companies comply with new lease accounting regulations, manage their SaaS spend (via our recent acquisition of Stackshine [YC W22]), and more generally handle accounting and spending related to recurring costs. We're based in Atlanta, but support fully remote employees in the US.https://leasequery.com/careers/We are also hiring for several roles in software, DevOps, and platform.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Atlanta, GA",
      "positions": [
        "MLOps Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491444,
    "description": "Glass Health (YC W23) | San Francisco, CA | Full-time | Senior Full-Stack Engineer | HYBRID | $130-180k + equity, flexibleWe build a platform for AI-assisted medical diagnosis and clinical decision-making. Doctors spend twice as much time with computers as they do with patients; our product helps doctors make decisions and draft documentation in seconds. To date, tens of thousands of clinicians have used Glass to generate drafts of differential diagnoses and clinical plans.We went through Y Combinator this year and recently announced a $5M seed round (led by Initialized), which included some of the most brilliant founders in healthtech: Tom Lee, founder of One Medical; Connor Landgraf, founder and CEO of Eko Health; and Heather Hasson and Trina Spear, the co-founders of FIGS. We’ve also been featured in leading clinical lectures like UCSF Grand Rounds and news outlets like NPR and TechCrunch.This is a hybrid role: we work in person at an office in San Francisco two days a week. Remote is optional for the remaining days, although the office space is fully available at any time! Unfortunately, we are unable to offer visa sponsorship.\nI (Graham) previously worked at Modern Fertility (YC S19) and our CEO/my co-founder Dereck is a doctor who studied medicine at UCSF and Brigham and Women's Hospital. Join us!Tech Stack: Django, Typescript, React, Redux, PostgresApply by sending a resume/linkedin to graham at glass dot health, or feel free to apply on Lever and mention HN! https://jobs.lever.co/glass-health-inc/a2cd06e1-e362-4204-ae...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 130000,
        "max": 180000
      },
      "company_location": "San Francisco, CA",
      "positions": [
        "Senior Full-Stack Engineer"
      ],
      "tech_stack": [
        "Django",
        "Typescript",
        "React",
        "Redux",
        "Postgres"
      ]
    },
    "categorized_tech": [
      "django",
      "typescript",
      "react",
      "redux",
      "postgresql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493034,
    "description": "TrueVault | Senior Software Engineer (US REMOTE), Customer Success Manager (US REMOTE) | FULL-TIMETrueVault (https://truevault.com) builds software tools that help businesses comply with consumer data privacy laws. We believe that if businesses can access products that make compliance simple, respecting consumers' data privacy becomes the sensible default—and we all benefit from that.We are a YCombinator startup based in Silicon Valley. Our team is passionate about data privacy and building products that make people's lives easier.At TrueVault, you will have the opportunity to work in arguably the most significant market opportunity of this coming decade: data privacy. Plus, you'll get to work with a warm and welcoming, no-nonsense team of engineers, designers and lawyers to build a product that businesses actually need and use every day.We're looking for Senior Software Engineers and Customer Success Managers to join our small team.If interested please apply at: https://careers.truevault.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "us"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Silicon Valley",
      "positions": [
        "Senior Software Engineer",
        "Customer Success Manager"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38491756,
    "description": "Apollo Agriculture | Engineering & DS | Full-time | Amsterdam, NL | https://www.apolloagriculture.com/teamApollo Agriculture (YC F1) is bringing modern farming to the world's poorest farmers. Millions of farmers globally don't have access to the basic resources the rest of the world depends on for food production: good seed and fertilizer. We sell these on credit, use ML to figure out who we can lend to profitably, and are growing rapidly (two countries and growing).We are a small, motivated team with SV roots and an ownership culture. Come help us make a real difference in the world!Hiring for multiple roles:- Software Engineer: Our core engineering team supports a wide range of tools and processes. Our primary stack is Scala 2 w/ cats, backed by psql. If you are an experienced and practical problem solver, we'd love to meet you.- Machine Learning Engineer: We build and run several different models to determine credit eligibility, detect fraud, etc. Our ml engineers are hands-on and provide production-ready models for other teams to consume.- Infrastructure / SRE: Currently this responsibility is spread through the tech team in an ad-hoc manner; we're looking for someone to own and improve the AWS-backed Pulumi and Ansible projects we've created.... due to our size and focus, we look for candidates who are experienced and can be autonomous -- at least at the \"senior\" level. Visa sponsorship is possible!Drop me a line at elijahsmith@apolloagriculture.com if you're interested; I'm happy to chat.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Amsterdam, NL",
      "positions": [
        "Software Engineer",
        "Machine Learning Engineer",
        "Infrastructure / SRE"
      ],
      "tech_stack": [
        "Scala",
        "cats",
        "psql",
        "AWS",
        "Pulumi",
        "Ansible"
      ]
    },
    "categorized_tech": [
      "aws",
      "ansible"
    ],
    "categorized_positions": [
      "software engineer",
      "machine learning"
    ]
  },
  {
    "id": 38492886,
    "description": "Prequel | https://prequel.co | Senior/Staff Software Engineer | Full Time | GoLang, Postgres, Typescript, React, K8s | $150k-$200k + equity | ONSITE in NYCPrequel is an API that makes it easy for B2B companies to sync data directly to their customer's data warehouse, on an ongoing basis.We're solving a number of hard technical problems that come with syncing tens of billions of rows of data every day with perfect data integrity: building reliable & scalable infrastructure, making data pipelines manageable without domain expertise, and creating a UX that abstracts out the underlying complexity to let the user share or receive data. We're powering this feature at companies like LogRocket, Modern Treasury, Postscript, and Metronome.// Full job posting here -- https://prequelco.notion.site/Senior-Software-Engineer-Prequ...// To apply -- email jobs@prequel.co and include [HN] in the subject line\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 150000,
        "max": 200000
      },
      "company_location": "NYC",
      "positions": [
        "Senior/Staff Software Engineer"
      ],
      "tech_stack": [
        "GoLang",
        "Postgres",
        "Typescript",
        "React",
        "K8s"
      ]
    },
    "categorized_tech": [
      "go",
      "postgresql",
      "typescript",
      "react",
      "kubernetes"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491101,
    "description": "Surge AI (https://surgehq.ai) | Software Engineers (full-stack or applied ML) | Full-time | SF or RemoteOur mission at Surge is to build the human infrastructure powering the next wave of AI and LLMs. We’re building a data platform that powers AI teams at OpenAI, Anthropic, Meta, Google, and more. Reinforcement Learning with Human Feedback is the critical technique behind the new generation of AI assistants, and that human feedback comes from us. Our product has been a game-changer for the top AI teams in the world. Here are some examples of our past work:- Creating the GSM8K dataset: https://www.surgehq.ai/blog/how-we-built-it-openais-gsm8k-da...- Collecting data for Anthropic's Claude: https://www.surgehq.ai/case-studies/anthropic-claude-surgeai...You’d be joining a small, rapidly growing team of former engineering and ML leaders from Google, Meta, Twitter, and Airbnb. We ship quickly, deeply care about the problems we are trying to solve, and value autonomy and ownership. No previous AI experience is required, if you have the engineering skills you can learn what you need on the job.We're looking for engineers with a few years of experience and you can work out of our office in SF or remotely. Please reach out to us at careers@surgehq.ai with a resume and 2-3 sentences describing your interest. Excited to hear from you!\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF",
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": [
        "full-stack",
        "applied ML"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38490973,
    "description": "Close (https://close.com/) | Senior/Staff Backend + Senior/Staff Frontend Engineers | 100% Remote - USAClose is a bootstrapped, profitable, 100% remote, ~90 person team of thoughtful individuals who value autonomy and impact. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or complex UI.We're looking for experienced, thoughtful Frontend (React) and Backend (Python) engineers to join our team.Senior/Staff Backend Application: https://jobs.lever.co/close.io/163446a3-2f3d-4f4a-9aec-cb1c8...Senior/Staff Frontend Application: https://jobs.lever.co/close.io/23451700-e03a-4739-9da8-f23d2...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior/Staff Backend Engineer",
        "Senior/Staff Frontend Engineer"
      ],
      "tech_stack": [
        "React",
        "Python"
      ]
    },
    "categorized_tech": [
      "react",
      "python"
    ],
    "categorized_positions": []
  },
  {
    "id": 38497724,
    "description": "Neocom | Senior Backend Engineer | Full-Time | Munich, Germany | ONSITE | Hybrid | VISAAt Neocom, we empower every company to understand their prospects and turn them into delighted customers.With our guided product advisors, we eliminate choice overload and use zero-party data to deliver profound customer insights to our clients.\nJoin us our mission to change how people find products by making product discovery effortless!\n.Our Stack:* Python is our main language (we use Django), Go for high throughput services.* Deployments via Docker containers.* Postgres for Master Data and Clickhouse for data intensive queries..About the company:* Startup, post 1M ARR, received $4.5m VC funding in September 2023* 25 people, 7 in R&D.What we are looking for:* True senior, who takes over ownership.* Has worked in Startups with less than 100 people in the past.* Knows her/his tools by heart..https://neocom.recruitee.com/o/senior-backend-engineer\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Munich, Germany",
      "positions": [
        "Senior Backend Engineer"
      ],
      "tech_stack": [
        "Python",
        "Django",
        "Go",
        "Docker",
        "Postgres",
        "Clickhouse"
      ]
    },
    "categorized_tech": [
      "python",
      "django",
      "go",
      "docker",
      "postgresql",
      "clickhouse"
    ],
    "categorized_positions": []
  },
  {
    "id": 38522881,
    "description": "Replit | SF | Full-TimeCurrent hiring priorities include:* AI Engineer* AI Backend Engineer* AI Frontend Engineer* Data Engineer* Product Engineer* Software Engineer/Senior: Developer Experience, Generalist* Product Manager, GrowthSee these opportunities and more below:\nhttps://jobs.ashbyhq.com/replit?utm_source=HackerNews\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF",
      "positions": [
        "AI Engineer",
        "AI Backend Engineer",
        "AI Frontend Engineer",
        "Data Engineer",
        "Product Engineer",
        "Software Engineer/Senior",
        "Product Manager, Growth"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "data engineer"
    ]
  },
  {
    "id": 38495551,
    "description": "Priverion | Lead Engineer (South America only, Colombia, Ecuador, Peru) FULL REMOTE, Fluent languages required: Spanish & EnglishWe build the most advanced Privacy and Security suite for companies which care about their customers data. Only apply if you have passion for Software Engineering/Development.Technologies we use: K8, ReactJS, PHP, Laravel, MongoDBI'm the CTO of Priverion, if your interested please apply here;https://co.indeed.com/job/lead-engineer-software-engineer-49....https://co.indeed.com/job/lead-engineer-software-engineer-49....\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "latin america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Lead Engineer"
      ],
      "tech_stack": [
        "K8",
        "ReactJS",
        "PHP",
        "Laravel",
        "MongoDB"
      ]
    },
    "categorized_tech": [
      "kubernetes",
      "php",
      "mongodb"
    ],
    "categorized_positions": []
  },
  {
    "id": 38506113,
    "description": "SpruceID (YC W21) | Full REMOTE | Multiple Roles | Full-Time | spruceid.comSpruce lets users control their data across the web. We are creating the world’s best open source software for user-centric digital identity. Instead of users logging into platforms, we think platforms should ask permission to access data vaults controlled by users.We hire programmers who love technology and are committed to intellectual honesty, user privacy, and innovation. Our products are composed from a combination of industry-trusted frameworks, applied cryptography, new interoperable identity standards (W3C, ISO/IEC, IETF, and OpenID), and custom backend libraries.Select roles:Senior Product Manager: Help drive the growth of a new product family which empowers government agencies and enterprises to manage the entire lifecycle of digital credentials for a wide range of use cases. This role will be responsible for developing product vision, roadmap, user stories, timelines, and implementation strategy.Software Engineer, Android: Build software prototypes and product features from start to finish for Android and iOS, embedding our Rust core.See all roles here: https://jobs.lever.co/sprucesystems/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Product Manager",
        "Software Engineer, Android"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38495232,
    "description": "SpaceX | Onsite | LA, the Bay Area, Seattle, Washington DC, and Bastrop/Austin, Starbase, Texas | Full TimeRockets, spaceships & satellites! Updates: www.spacex.com/updates/SECURITYSr. Security: https://grnh.se/8560d52a2usSr. IAM: https://grnh.se/ab0670ee2usSr. Detection: https://grnh.se/1b0214912usPrincipal Security: https://grnh.se/ca03bba32usSOFTWAREMobile: https://grnh.se/90ccf7ca2usFull Stack: https://grnh.se/3a6d4a2b2usWireless Firmware: https://grnh.se/943ec88a2usENGINEERINGElectrical Design: https://grnh.se/6ad43b4c2usElectrical Test: https://grnh.se/eea90ee22usRF Test: https://grnh.se/a6efedea2usSpaceX follows ITAR regulations: www.pmddtc.state.gov/?id=ddtc_kb_article_page&sys_id=24d528fddbfc930044f9ff621f961987\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "LA, the Bay Area, Seattle, Washington DC, and Bastrop/Austin, Starbase, Texas",
      "positions": [
        "Sr. Security",
        "Sr. IAM",
        "Sr. Detection",
        "Principal Security",
        "Mobile",
        "Full Stack",
        "Wireless Firmware",
        "Electrical Design",
        "Electrical Test",
        "RF Test"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491412,
    "description": "NetFoundry | $115k to 180k base comp | Full-time | REMOTE | USA | DevRel LeaderYou are responsible for building the OpenZiti developer community. This is initially an IC role; you will then build out a DevRel team.The open source OpenZiti platform enables developers to embed zero trust, full mesh networking into their solutions, as software. Example:https://github.com/openziti-test-kitchen/go-httpOpenZiti delivers billions of zero trust sessions per year for leaders around the world.  NetFoundry originated OpenZiti, is the maintainer and sells CloudZiti SaaS (hosted OpenZiti). NetFoundry is a remote-first company.You are a good candidate if you love to learn about the problems, opportunities, constraints, hopes and fears of the developer, operations and security communities which you will serve.More info:https://netfoundry.io/careers/devrel-leader/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": 115000,
        "max": 180000
      },
      "company_location": null,
      "positions": [
        "DevRel Leader"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38494828,
    "description": "Flexpa | Remote (US timezones) | Senior software developer | https://www.flexpa.comFlexpa connects applications to health insurance data. We are looking to grow the team with a software developer who is excited to work on our mission of refactoring healthcare.Our company handbook is open and available to get a sense for how we work [1]. For more details about our product, please review our developer documentation [2].Our stack: TypeScript, Turborepo, NextJS, React, Tailwind, Prisma, PostgreSQL, Fastify, HL7 FHIR, DockerWhat We Offer:* A purposeful mission of refactoring healthcare* Mentorship from experienced founders who have been through Y Combinator in S15 and W20.* Support from world-class technologists, investors, and healthcare practitioners* A unique culture where we \"put the shopping cart back\" and uphold values we take pride in* Clear and competitive compensation targeting the 75th percentile ratesSkills & Experience:* 2+ years of full-time experience as a software developer* Proficiency in TypeScript and functional programming patterns* History of shippingTo apply please submit an application at https://flexpa.applytojobs.ca/engineering/25554 and _afterwards_ send us an email to hiring@flexpa.com about what makes you interested in the role![1] https://handbook.flexpa.com/ [2] https://www.flexpa.com/docs\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior software developer"
      ],
      "tech_stack": [
        "TypeScript",
        "Turborepo",
        "NextJS",
        "React",
        "Tailwind",
        "Prisma",
        "PostgreSQL",
        "Fastify",
        "HL7 FHIR",
        "Docker"
      ]
    },
    "categorized_tech": [
      "typescript",
      "nextjs",
      "react",
      "tailwind",
      "prisma",
      "postgresql",
      "docker"
    ],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38521008,
    "description": "Rec | Full-stack engineers, First Product Designer | SF (Remote OK) | Full-timeWe're Rec (rec.us), we're re-thinking how people participate in sports & recreation in their city. We partner with cities first, and then power all of the amazing facilities, instructors, and players in the neighborhood with a set of tools that gets everyone doing more. We've spent the past year building out our MVP and proving our model, which is now live and growing in 6 cities. and 2024 is all about going scaling fast with what is undoubtedly the best software platform in recreation.We're hiring all levels of full-stack engineers, our first product designer, and folks on the sales team. Apply here: https://wellfound.com/l/2zwdUS\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "SF",
      "positions": [
        "Full-stack engineer",
        "Product designer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "full stack"
    ]
  },
  {
    "id": 38506094,
    "description": "Friendly Captcha | Infrastructure Engineer | REMOTE within EU | PART-TIME or FULL-TIME | Office in Munich, Germany | https://friendlycaptcha.comAt Friendly Captcha we do one thing and we do it well: we protect websites from malicious actors and bots.We provide privacy-friendly and accessible anti-bot solutions that don’t annoy users with tasks like clicking fire hydrants. We make the internet a bit better every day by winning over customers currently using Google reCAPTCHA.We’re a fast-growing, profitable, fully bootstrapped company. Our revenue mostly comes from medium to large European enterprise and governments.A great fit would be someone pragmatic, who prefers to keep things simple (perhaps boring is the right word?). Good knowledge of modern DevOps/SRE practices is expected (IaC, GitOps, etc...).Our engineering team is fully remote across Europe, we meet up once per quarter or so. You can work either 4 or 5 days per week, fully remote or (partially) from our Munich office. Please note that we ONLY consider candidates located within the EU.Stack: Golang | Typescript | Clickhouse | Postgres | Redis | Terraform | OpenTelemetryInfrastructure Engineer: https://friendlycaptcha.homerun.co/infrastructure-engineer(Generalist) Software Engineer: https://friendlycaptcha.homerun.co/software-engineer\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Munich, Germany",
      "positions": [
        "Infrastructure Engineer"
      ],
      "tech_stack": [
        "Golang",
        "Typescript",
        "Clickhouse",
        "Postgres",
        "Redis",
        "Terraform",
        "OpenTelemetry"
      ]
    },
    "categorized_tech": [
      "go",
      "typescript",
      "clickhouse",
      "postgresql",
      "redis",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494235,
    "description": "Figma | https://www.figma.com/ | San Francisco, New York City, and US remote | Full Time\nSelected job postings here (all compensation in annual base salary range for SF/NY hubs):\n- Engineering Manager - Machine Learning ($233,000—$372,000 USD) https://boards.greenhouse.io/figma/jobs/4962442004\n- Engineering Director - Machine Learning ($280,000—$381,000 USD) https://boards.greenhouse.io/figma/jobs/4953079004\n- ML/AI Engineer ($168,000—$350,000 USD) https://boards.greenhouse.io/figma/jobs/4756707004\n- Software Engineer - Editor ($168,000—$350,000 USD) https://boards.greenhouse.io/figma/jobs/4214847004\n- Software Engineer - Infrastructure ($168,000—$350,000 USD) https://boards.greenhouse.io/figma/jobs/4776674004\n===\nBorn on the Web, Figma helps entire product teams brainstorm, create, test, and ship better designs, together. From great products to long-lasting companies, we believe that nothing great is made alone. Come make with us!\nKeeping Figma fast — perf-testing the WASM editor: https://news.ycombinator.com/item?id=37324121\nServer-side sandboxing: Containers and seccomp: https://news.ycombinator.com/item?id=38000824",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "usa"
      ],
      "compensation": {
        "min": 168000,
        "max": 381000
      },
      "company_location": null,
      "positions": [
        "Engineering Manager - Machine Learning",
        "Engineering Director - Machine Learning",
        "ML/AI Engineer",
        "Software Engineer - Editor",
        "Software Engineer - Infrastructure"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492353,
    "description": "MUI | Remote UTC-6 to +5 | Multiple roles | Full time | https://mui.com/I'm a co-founder and the CEO of MUI. Our objective in the short term is to become the UI toolkit for React, unifying the fragmented ecosystem of dependencies into a single set of simple, beautiful, consistent, and accessible React components. In the longer term, our goal is to make building great web UIs quicker, simpler, and accessible to more people through a low-code platform for developers.Some things we’re proud of:- 25% of the downloads that React receives.- 1M developers on our documentation every month.- Solid financials: profitableIf this sounds interesting to you, we are hiring for: Design Engineers, Product Engineers, Developer Experience Engineer (Developer Advocate): https://jobs.ashbyhq.com/MUI?utm_source=Xnzy3Q3MGR.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Design Engineers",
        "Product Engineers",
        "Developer Experience Engineer (Developer Advocate)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38512938,
    "description": "ChartMogul | Remote (EU) | Full-timeAt ChartMogul, we're building the leading Subscription Analytics Platform for growing SaaS businesses. We're a remote-first company with 73 team members across 23 different countries. Profitable and self-sustaining since our seed funding.Our core product is a Ruby on Rails backend and Vue.js frontend, with services in Python and Go. Postgres serves most of our database needs, along with a Snowflake data warehouse.- Senior Full Stack Engineer: https://jobs.chartmogul.com/o/senior-full-stack-engineer-del...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior Full Stack Engineer"
      ],
      "tech_stack": [
        "Ruby on Rails",
        "Vue.js",
        "Python",
        "Go",
        "Postgres",
        "Snowflake"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails",
      "vue",
      "python",
      "go",
      "postgresql",
      "snowflake"
    ],
    "categorized_positions": []
  },
  {
    "id": 38501832,
    "description": "WorkTiles | Founding Fullstack Engineer | Remote (Sweden) | Full timeI'm seeking an engineer who will help me drive tech and product at WorkTiles. WorkTiles is a B2B SaaS collaboration tool designed to help companies organize, perform, and improve their monthly closing and consolidation process. (Think Linear but for finance/accounting)See more here https://www.linkedin.com/jobs/view/3770164426Or just reach out to me directly if you have any questions at adam at worktiles.se\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Founding Fullstack Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492741,
    "description": "Sourcetable is hiring a Senior/Staff level application engineer (Python + React) to build a spreadsheet-based data platform.We are an 8-person hybrid-remote team. Half the team is SF-bay-area, the other half are remote. Remote applicants must be US-based.We have an Excel/Sheets competitor coming to market, have raised a seed round, are an experienced team with prior success, plenty of hard engineering problems to solve, as well as some fun AI stuff cooking under the hood that we're not ready to announce.Culturally, we really like working with experienced people who are ex-founders and/or early stage employees (5 of the 8 members of the team are ex-founders). It just seems to work better that way.More info here: https://sourcetable.com/jobsYou can also email me (Eoin, founder) at Sourcetable.comHave a great day!\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior/Staff level application engineer"
      ],
      "tech_stack": [
        "Python",
        "React"
      ]
    },
    "categorized_tech": [
      "python",
      "react"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491257,
    "description": "Bold Penguin | Remote (US)* | Full Time | Software Engineers Bold Penguin products help insurance agencies successfully quote and bind small business insurance policies with the click of button! We are growing fast and expanding our teams. Use Linux, macOS, or Windows along with whatever tools you enjoy using (Slack, Zoom, your choice IDE, etc.)If you don’t meet all of the qualifications please don’t worry. Apply anyway!Current open roles:  Software Engineer ~> https://www.thegravityapp.com/shared/job?clientId=8a7883d0676d10a10167856a16554ede&id=8a7887a18a48e51f018a669e24f93871&u=1700063308&v=9&token=eyJ1aWQiOjQzNjY3LCJwcm92aWRlciI6ImJvdW5jZSIsInR5cGUiOiJlbWFpbCJ9.gLMdEwaNEg2zzNpAYDEB1KvVHp4\n\n* We operate fully remote but have clusters of employees around certain hub cities to try and initiate meetups and other fun activities.",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "USA"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "software engineer"
    ]
  },
  {
    "id": 38492753,
    "description": "ManageBetter | US/Canada candidates | REMOTE | Technical Co-Founder - Full Stack Web DevelopmentManageBetter, a Seattle-based startup founded by Lewis C. Lin, a Google & Stanford alum and 8X Amazon bestselling author of management books, is on a mission to eliminate bias and discrimination in employee performance assessment, inspired by the data revolution in sports.We are currently seeking a dedicated Technical Co-Founder with deep expertise in full-stack web development to join our team. In this senior role, you will play a pivotal part in coding, technical leadership, and shaping the strategic vision of our enterprise SaaS platform.Details: https://www.linkedin.com/jobs/view/3752891094/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america",
        "canada"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Seattle",
      "positions": [
        "Technical Co-Founder"
      ],
      "tech_stack": [
        "full-stack web development"
      ]
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38522943,
    "description": "Quantstamp | https://quantstamp.com | Remote | Full-timeQuantstamp’s mission is to secure the decentralized internet, and has protected over $200B in digital asset risk from hackers. More than 500 startups, foundations and enterprises work with Quantstamp to keep their innovative products safe.We are looking for Auditing Engineers and a Senior Rust Engineer to join our team. The full job description and how to apply can be found below. https://jobs.ashbyhq.com/quantstamp\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Auditing Engineer",
        "Senior Rust Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38527873,
    "description": "Minoa | Founding Engineer | San Francisco | Full-time--TLDR;- full-stack Typescript- in-person in San Francisco (visa and relocation support)- high ownership & fast growth (30% MoM)- B2B SaaS sales enablement platform--About the Role:- we’re looking for a full-stack Founding Engineer with experience in Typescript/React/Node- we’re here to win and build a big company. We value kindness and an entrepreneurial mindset (all of our current employees have started a company before)- we ship code every day, talk to customers a lot, take ownership, communicate with candor.--About Us:- our team is based in the center of San Francisco - we’ll help you get a US visa and relocate if needed. Strong salary + stock as one of the first 5 employees.- Minoa is turning enterprise sales into a multiplayer experience and helps modern GTM organizations win more deals despite a tougher market situation.- we have raised a $2.7m pre-seed from top US investors and are growing 30% MoM, winning leading SaaS companies in the Bay Area, New York and Europe as customers.--Sounds interesting? Let's chat - reach me at richard(at)minoa(dot)io\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "San Francisco",
      "positions": [
        "Founding Engineer"
      ],
      "tech_stack": [
        "Typescript",
        "React",
        "Node"
      ]
    },
    "categorized_tech": [
      "typescript",
      "react",
      "nodejs"
    ],
    "categorized_positions": []
  },
  {
    "id": 38496387,
    "description": "Brenger (https://www.brenger.nl) | Senior PHP Engineer | Amsterdam, The Netherlands | ONSITE (hybrid) | visa sponsorshipCome join Brenger as a Senior PHP Engineer (following our recent amazing Python hires!) to build the transportation platform that solves the surprisingly unsolved problem of shipping bulky goods economically, optimizes the utilization of vans on the road, and reduces CO₂ emissions along the way!Check out the full job listing and apply at: https://careers.brenger.nl/o/senior-php-engineer\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Amsterdam, The Netherlands",
      "positions": [
        "Senior PHP Engineer"
      ],
      "tech_stack": [
        "PHP"
      ]
    },
    "categorized_tech": [
      "php"
    ],
    "categorized_positions": []
  },
  {
    "id": 38498033,
    "description": "Chan Zuckerberg Biohub | Summer 2024 Undergraduate INTERNS ONSITE | San Francisco, CA, USWe have several openings for our internship program. The intern positions range from wet-lab biological applications to software engineering and data science.I would like to highlight the Royer Group, which is seeking an intern to work with AI for biological imaging data. I recommend mentioning in the cover letter which group you want to work with.https://boards.greenhouse.io/chanzuckerbergbiohubinternship/...\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "San Francisco, CA, US",
      "positions": [
        "Summer 2024 Undergraduate Intern"
      ],
      "tech_stack": [
        "AI",
        "biological imaging data"
      ]
    },
    "categorized_tech": [
      "ai"
    ],
    "categorized_positions": []
  },
  {
    "id": 38522528,
    "description": "Vidrovr | https://vidrovr.com | Senior FE/Full Stack, QA and Application Engineer | REMOTE | Full-timeVidrovr makes video useful. We use machine learning to turn disorganized heaps of media and tangles of live feeds into beautifully structured metadata to drive actions and business decisions for our users. We enable previously impossible applications, at previously impossible scales.We are a small team with self-sustaining - and growing - revenues. Our notable major partners include The AP, the USAF, CNBC, the German Marshall Fund, DHS, FOX sports, and more.Vidrovr fosters an open, supportive engineering culture emphasizing curiosity, self-teaching, and fearlessness. Engineering is a very small team with fewer than ten members, and there is ample opportunity to learn outside your domain of expertise. Our organization is fairly flat: you'll have direct access to company leadership, insight into strategic conversations, and avenues for direct involvement in major decisions.We are fully remote. Vidrovr does not currently maintain a physical office. About half of our team is based in New York, with other members in Knoxville, Atlanta, Boston, Seattle, and Mexico City. Being fully remote, we highly value good communication skills!Vidrovr provides unlimited PTO, and we're serious about it. We periodically require engineers to take time off if they have not recently. We value your independence: we expect quality engineering, not your soul.Apply Here (FE Eng): https://www.squarepeghires.com/jobs/8zo1xp/senior-frontend-e...Apply Here (Full Stack Eng): https://www.squarepeghires.com/jobs/pdw3nr/copy-senior-softw...Apply Here (Senior Quality Assurance (QA) Engineer):  https://www.squarepeghires.com/jobs/r034jr/senior-qa-enginee...Apply Here (Application Eng): https://www.squarepeghires.com/jobs/pj736p/application-engin...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior FE/Full Stack",
        "QA",
        "Application Engineer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38494370,
    "description": "Iterative.ai (Series A) | REMOTE, WORLDWIDE | FULL-TIME | OPEN-SOURCE\n  \n  Developer tools for ML engineers. We need people who are passionate about building infrastructure that help ML teams manage data (large scale), make sane reproducible workflow, track models. We are building infrastructure to deal with datasets of the 5N LAION scale. Our flagship open source tool- DVC.org (12K+ stars), SaaS product - studio.iterative.ai. \n\n  We are looking for senior (SaaS and open source) engineers:\n\nhttps://iterative.notion.site/Iterative-ai-is-Hiring-852cb97...",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "global"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "senior engineer"
      ],
      "tech_stack": [
        "SaaS",
        "open source"
      ]
    },
    "categorized_tech": [
      "saas"
    ],
    "categorized_positions": []
  },
  {
    "id": 38506157,
    "description": "GoGoGrandparent (YC S16) | FULLY REMOTE |  Full-time | US, UK, or able to work 4+ hours overlap with mainland US | Senior/Staff Backend EngineerBuild high-quality, robust engineering at the rarest of things - a Silicon Valley startup that is both wholesome AND profitable. We have 8-figure revenue, are YC-backed, and growing fast.Tech stack (required): Back-end heavy (Node, Typescript, MySQL, REST*+GraphQL), deploy (AWS, Docker/K8s)Minimum 5 years experience (with Node). If full-stack, you must be strongest on the backend.2-stage interview process.If you want to help older adults and people with disabilities, send your LinkedIn/CV to william@gogograndparent.com (keep it brief) or apply at https://www.ycombinator.com/companies/gogograndparent/jobs (UK jobs can be applied for from anywhere and salary ranges can be adjusted for the right candidate)\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Senior/Staff Backend Engineer"
      ],
      "tech_stack": [
        "Node",
        "Typescript",
        "MySQL",
        "REST*",
        "GraphQL",
        "AWS",
        "Docker/K8s"
      ]
    },
    "categorized_tech": [
      "nodejs",
      "typescript",
      "mysql",
      "graphql",
      "aws"
    ],
    "categorized_positions": []
  },
  {
    "id": 38497607,
    "description": "Striime Logistics | Software Engineer (with AI/ML) | Berlin, Germany | Onsite or hybrid (come to Berlin from time to time)Striime teams up with small and medium freight forwarders (think travel agents for cargo) to accelerate their outstanding customer focus with cutting-edge AI technology. Together, we're building the world's most customer-friendly freight forwarder. Our partners shine in relationship-building but often drown in paperwork and data shuffling. Striime’s AI copilot removes the toil from their workflow so that they can focus on their customers and partners.careers@striime.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Berlin, Germany",
      "positions": [
        "Software Engineer (with AI/ML)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492631,
    "description": "Nightwatch.io | 100% Remote | Full-time & Part-timeCultivating non-corporate, friendly, bootstrapped and remote environment.Nightwatch is developing search engine and LLM tracking capabilities helping companies understand how their services and products perform and rank within LLM / GPT models in comparison to the search engines.We value freedom, authonomy, ownership, good communication.Back-end Developer (Ruby, Elixir, Go): https://nightwatch.io/jobs/backend-developerFront-end Developer: https://nightwatch.io/jobs/frontend-developer\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Back-end Developer",
        "Front-end Developer"
      ],
      "tech_stack": [
        "Ruby",
        "Elixir",
        "Go"
      ]
    },
    "categorized_tech": [
      "ruby",
      "elixir",
      "go"
    ],
    "categorized_positions": [
      "backend",
      "front end"
    ]
  },
  {
    "id": 38501259,
    "description": "Obsidian Security | Threat Team Engineer | Newport Beach, Palo Alto, Philadelphia | Onsite or Remote | Full-TimeObsidian Security is at the forefront of SaaS security, dedicated to detecting and mitigating threats effectively.We are hiring for multiple roles.Threat Detection Team:With our advanced threat detection solution, we visualize user activity, identify employee compromise, and mitigate insider threats, ensuring data security before a material breach occurs.Threat Backend Engineer: https://obsidiansecurity.applytojob.com/apply/wK0pJCTaKO/Thr...SaaS Posture Security & Compliance Team:Ensuring SaaS applications are robust and compliant with industry standards. You'll focus on real-time monitoring, proactive vulnerability mitigation, and managing sensitive data access for optimal security and continuous compliance.Skills:  - Python (specifically experience with asyncio)\n  - SqlAlchemy\n  - Fastapi\n  - Dagster\n  - Duckdb / Postgres\n\nFor posture team email delston@obsidiansecurity.com.See all our open positions here https://www.obsidiansecurity.com/careers/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Threat Team Engineer"
      ],
      "tech_stack": [
        "Python",
        "SqlAlchemy",
        "Fastapi",
        "Dagster",
        "Duckdb",
        "Postgres"
      ]
    },
    "categorized_tech": [
      "python",
      "postgresql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491035,
    "description": "Canvas (The Spatial Computing Company) | Full-time | Onsite | Remote |At Canvas, we’re working on spatial computing - using computer vision to 3D reconstruct and understand your surroundings so that software can operate over real-world spaces. We believe it will power the next generation of augmented reality and some of the key parts of virtual reality as well.C++ Engineer (Portugal/Remote Europe) | \nFull Stack QA (Portugal/Romania) | \nFinancial Planning & Analysis Manager (Remote, USA) | \nInside Sales Representative (Remote, North America)For detailed information check out https://canvas.io/jobs.Keywords: 3D, computer vision, photogrammetry, geomatics, SLAM\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "C++ Engineer",
        "Full Stack QA",
        "Financial Planning & Analysis Manager",
        "Inside Sales Representative"
      ],
      "tech_stack": [
        "3D",
        "computer vision",
        "photogrammetry",
        "geomatics",
        "SLAM"
      ]
    },
    "categorized_tech": [
      "3d_graphics",
      "computer_vision",
      "photogrammetry",
      "geomatics",
      "slam"
    ],
    "categorized_positions": [
      "c++ developer"
    ]
  },
  {
    "id": 38491929,
    "description": "Medbill AI | Founding Senior Engineer + Founding Designer | Full Time | Remote - US timezonesWe are building an AI assistant that helps people with medical billing and health insurance issues. Thanks to AI and new healthcare regulations around patient data access and price transparency, it is now possible for everyone, including you, to have their own assistant  who works around the clock to save them money on medical bills and navigate the disjointed US healthcare system.Reach out if you’re interested in the role or want to learn more about what we’re up to!https://www.medbill.ai/about\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Founding Senior Engineer",
        "Founding Designer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38500717,
    "description": "BotBuilt |  Full Time Software, Electrical, Mechatronics | ONSITE ( Durham, NC/ Manilla, PH / Sao Paulo, Brazil)We build homes with robots!BotBuilt is at the forefront of revolutionizing the construction industry. Leveraging cutting-edge technologies in Artificial Intelligence, Computer Vision, and Robotics, we're reshaping how construction projects are conceived and executed. Our small but dynamic team is dedicated to innovation and excellence.Why Join Us?Innovative Projects: Work on groundbreaking projects that integrate AI and robotics into real-world construction applications.Growth Opportunity: As a growing firm, BotBuilt offers unique career advancement opportunities and the chance to play a key role in the industry's transformation.Collaborative Culture: We value creativity, collaboration, and out-of-the-box thinking. Your ideas will be heard and valued.See our open jobs here: https://ats.rippling.com/botbuilt/jobs\nNOTE: If you're in the Philippines or Brazil please apply to the open position, we're still working out those positions exactly so there's no specific job posting yet.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software",
        "Electrical",
        "Mechatronics"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38491366,
    "description": "Apple | Product Designer | Cupertino on-siteApple is seeking an experienced Product Designer to bring Global Sourcing and Supply Chain solutions to the next level. Our internal software products empower several Apple teams as they manage Apple’s massive supply chain across the globe. Our users expect these internal products to surprise and delight with intuitive and polished UI and UX.Please apply via the following link (I am the hiring manager, and long-time HNer): https://jobs.apple.com/en-us/details/200524698\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Cupertino",
      "positions": [
        "Product Designer"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38498994,
    "description": "ID.me | Remote - Anywhere Continental US | Full-Time | SDE III, SDE IV, SDE V, SDM-III | No Visa SponsorshipID.me simplifies how people securely prove and share their identity online. The company empowers people to control their data through a portable and trusted login, which means they don’t need to create a new password when visiting sites that have the ID.me button.The COVID-19 pandemic accelerated digital migration for many critical services. Those services require a trusted identity to safeguard against fraud and help ensure people are who they claim to be. With ID.me, login and identity credentials move with people, which can reduce the time and frustration of having to verify at multiple sites and set up multiple passwords.ID.me is a credential service provider compliant with federal standards for digital identity verification.We're hiring for SDE III/IV/V (tech lead) and SDMs. We're looking for dedicated, experienced engineers passionate about scalable system architecture, able to lead initiatives in areas like monitoring, automated testing, experimentation, and infrastructure as code. Ideal candidates will champion innovative solutions and exhibit leadership in these critical domains.Our Stack: Ruby on Rails, Sidekiq, PostgreSQL, Redis, React, Terraform. We'll be introducing Go soon.Check out all our roles at: https://boards.greenhouse.io/idmeI'm an engineering manager on the team, if you have any questions you can reach me directly at sergey.cherman+hn AT id.me Please no staffing or recruiting firms, individuals only.\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "SDE III",
        "SDE IV",
        "SDE V",
        "SDM-III"
      ],
      "tech_stack": [
        "Ruby on Rails",
        "Sidekiq",
        "PostgreSQL",
        "Redis",
        "React",
        "Terraform"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails",
      "postgresql",
      "redis",
      "react",
      "terraform"
    ],
    "categorized_positions": []
  },
  {
    "id": 38506216,
    "description": "Normal Computing | https://normalcomputing.ai | New York or full remote | Full TimeNormal Computing is making AI both scalable and useful.We are looking for a senior web backend developer (8+ years experience ideally in Python, PostgreSQL) to join the Core Engineering team and work on a variety of projects.Pros:- Full remote.- A lot of autonomy with a focus on deep work and minimal process.- Working on applications more interesting than the average CRUD software.If you like to build and have the skills that go with it, you may like it here. Contact us!https://jobs.ashbyhq.com/Normal%20Computing%20AI/2cb7e085-a0...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "New York",
      "positions": [
        "senior web backend developer"
      ],
      "tech_stack": [
        "Python",
        "PostgreSQL"
      ]
    },
    "categorized_tech": [
      "python",
      "postgresql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38500184,
    "description": "Audiotool (https://www.audiotool.com) | Germany (or EU, UK) | Full-time employees | Hybrid | EngineeringJoin our team and build the future of music production on the web! Audiotool is an award-winning, cloud-based digital audio workstation (DAW) that runs right in your browser. Making music production accessible to everyone and connecting creators globally.For our new product, we’re looking for passionate and talented people ready to join us on our challenging journey. Are you an experienced Typescript Developer and interested to support our team working on the Audiotool web app - the part where the music is created?Open positions: * Frontend Developer (TypeScript) * Senior Fullstack (incl WebGL, TypeScript)Our core team is in Cologne, Germany, with a few being remote in Europe who come to Cologne for week-long workshops from time to time.See our jobs page for more info: https://www.audiotool.com/jobs\"\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "europe"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Germany",
      "positions": [
        "Frontend Developer (TypeScript)",
        "Senior Fullstack (incl WebGL, TypeScript)"
      ],
      "tech_stack": [
        "TypeScript",
        "WebGL"
      ]
    },
    "categorized_tech": [
      "typescript",
      "webgl"
    ],
    "categorized_positions": []
  },
  {
    "id": 38498435,
    "description": "Thema | Founding ML Engineer & Founding Data Engineer | Remote (UK) | London---Thema is a platform that harnesses AI to organise the world's knowledge about companies.Our journey began in 2022 and last month we secured £2.5 million in Seed funding led by Stride VC.We have also been backed by the UK government, receiving a £1m million grant to develop Trustworthy AI in collaboration with Cambridge University and London Business School.We are a research organisation at the forefront of developing cutting-edge vector embedding and unsupervised learning techniques. We are obsessed with creating a product that defines the category.---Founding ML Engineer (Python) https://little-frost-073.notion.site/Founding-ML-Engineer-fe...Email dimo@thema.ai if you're interested---Founding Data Engineer (Python) https://little-frost-073.notion.site/Founding-Data-Engineer-...Email jonny@thema.ai if you're interested\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "UK"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "London",
      "positions": [
        "Founding ML Engineer",
        "Founding Data Engineer"
      ],
      "tech_stack": [
        "Python"
      ]
    },
    "categorized_tech": [
      "python"
    ],
    "categorized_positions": []
  },
  {
    "id": 38500544,
    "description": "Match | founding Engineer, Designer, Mentor | Entirely Remote | Flexible Hours |\nMATCH is a social platform focused on people wanting to participate in sports. We provide various tools to users during the overall process of their sports participation in their daily lives. Match will be the space where you plan, record and review your favorite recreational and competitive sport performance and connect with like minded individuals.We are a tight-knit team looking for someone shares our vision for sports participation and can apply their passion to the product development.We are an international team, with ties all over the globe, including South Korea, the UK and the USA(California and DC).From your involvement you can expect to be - Part of a young, passion-driven and ego-free startup - Very intimately included in the development of the product. - Working full-time when inspired to as we navigate the future of sports performance and connectivityIf you're interested, feel free to reach out to me : sirenbrian37@gmail.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Founding Engineer",
        "Designer",
        "Mentor"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38495431,
    "description": "FusionAuth | Senior Java Software Engineer, DevRel Lead, Product Marketing Manager, Social Media Manager, Tech Support Engineer | Denver, CO, USA ONSITE or  REMOTE in USA (location reqs listed on the job desc) | $140k-$180k for the java eng, others have ranges on the job desc)Our mission is to make authentication and authorization simple and secure for every developer building web and mobile applications. We want devs to stop worrying about auth and focus on building something awesome.If you are passionate about technology and want to join a company moving the industry forward, FusionAuth might be a great fit for you. Our core software is commercial with a \"free as in beer\" version. We also open source much of our supporting infrastructure. We are profitable but raised a round recently to accelerate our growth (more on that here: https://fusionauth.io/blog/fusionauth-funding ).Technologies and standards that we use or implement: Modern Java, MySQL, PostgreSQL, Docker, Kubernetes, OAuth, SAML, OIDC.Learn more, including about benefits and salaries, and apply here: https://fusionauth.io/jobs/\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": 140000,
        "max": 180000
      },
      "company_location": "Denver, CO, USA",
      "positions": [
        "Senior Java Software Engineer",
        "DevRel Lead",
        "Product Marketing Manager",
        "Social Media Manager",
        "Tech Support Engineer"
      ],
      "tech_stack": [
        "Java",
        "MySQL",
        "PostgreSQL",
        "Docker",
        "Kubernetes",
        "OAuth",
        "SAML",
        "OIDC"
      ]
    },
    "categorized_tech": [
      "java",
      "mysql",
      "postgresql",
      "docker",
      "kubernetes"
    ],
    "categorized_positions": []
  },
  {
    "id": 38498823,
    "description": "Platformed | London, UK | Founding Software Engineer | Full-Time | Hybrid | £70-90k + EquityRust / TypeScript / Postgres / GCPPlatformed's mission is to help Sales and CS teams to meet their customers’ procurement and compliance requirements from pitch to renewal. Our workflows, AI and integrations help our customers to grow faster, save time and reduce frustration while still meeting the demand imposed upon them by customers. And in the future, we’ll move this communication away from natural language altogether.This is an exciting opportunity for an experienced full stack engineer to join our team early in our company journey, reporting to the CTO and working alongside the founders.Platformed Careers: https://platformed.com/careersFounding Software Engineer: https://platformed.notion.site/Founding-Software-Engineer-56...\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 70000,
        "max": 90000
      },
      "company_location": "London, UK",
      "positions": [
        "Founding Software Engineer"
      ],
      "tech_stack": [
        "Rust",
        "TypeScript",
        "Postgres",
        "GCP"
      ]
    },
    "categorized_tech": [
      "rust",
      "typescript",
      "postgresql",
      "google_cloud"
    ],
    "categorized_positions": []
  },
  {
    "id": 38493502,
    "description": "Hightouch |Remote (North America)|Full-timeSome background on Hightouch - our mission is to help companies leverage their customer data to grow. We started with the problem of “Reverse ETL” or helping companies sync data from their data warehouse (e.g. Snowflake, Databricks, etc.) to 200+ SaaS tools (Salesforce, Marketo, Facebook Ads, etc.) without coding. Since then, we’ve evolved into a suite of tools around the warehouse (identity resolution, data enrichment, event streaming, etc.). We’ve raised a Series B and scaled to $15m+ ARR in 3 years with 500+ customers including Fortune 500 co’s like Spotify, the NBA, PetSmart, etc.We are looking for an Engineering Leader, reporting into our VP, Engineering. This role will manage our two most central backend teams that power the core of our product. The role is both technically complex & high impact. We have challenges like operating a large-scale distributed system that’s both multi-region and multi-cloud. In addition, you can help shape our core platform’s roadmap. In addition to leaders interested in deep backend technical challenges, this role is a great fit for someone who is looking to take a VP/Head of Engineering role next!Learn more here: https://boards.greenhouse.io/hightouch/jobs/4580317004\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Engineering Leader"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38502266,
    "description": "Boost My School | Senior or staff software engineer | Full-time | Remote, USA only | $145-$195K salaryWant to be proud of your impact helping schools and students? Are you the type to thrive on a remote, impact-driven team?Boost is on a mission to bring billions more dollars into schools. Our platform is trusted by 100+ K-12 and higher ed customers to bring in $50M a year from 60,000 parents & alumni.Why work at Boost?1. Be proud of your impact helping schools and students2. Work with thoughtful teammates building a champion company together3. Join a culture that wants you to be your best self at work and outside of work4. Take on broad responsibilities as a founding member of the engineering teamFor full job details and instructions on how to apply: https://boostmyschool.com/careers#senior-software-engineerTags: edtech, fintech, social impact, mission-drivenStack: Ruby, Rails, React, GraphQL\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "usa"
      ],
      "compensation": {
        "min": 145000,
        "max": 195000
      },
      "company_location": null,
      "positions": [
        "Senior or staff software engineer"
      ],
      "tech_stack": [
        "Ruby",
        "Rails",
        "React",
        "GraphQL"
      ]
    },
    "categorized_tech": [
      "ruby",
      "ruby_on_rails",
      "react",
      "graphql"
    ],
    "categorized_positions": []
  },
  {
    "id": 38498372,
    "description": "Recital | Remote (Global, core hours: North America mornings) | Full-time | https://recital.softwareRecital is the negotiation workspace for contracts professionals. We're bringing the table stakes of today's programming world to contract negotiations, such as easy version control, diffs, and other features you'd find in an IDE.We're a small, global, all-remote startup. It's our second startup in the space (the first was acquired). We follow modern product management (discovery) & development (DORA) practices, emphasize developer experience as an accelerator of customer value, and use provably effective management techniques (à la Manager Tools).We're looking for senior/staff full-stack developers, with solid professional experience in both Ruby on Rails and a modern frontend framework (Vue, React, etc)https://recital.software/careers/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": true,
      "remote_only_location": [
        "north_america"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "senior/staff full-stack developer"
      ],
      "tech_stack": [
        "ruby on rails",
        "vue",
        "react"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails",
      "vue",
      "react"
    ],
    "categorized_positions": []
  },
  {
    "id": 38527511,
    "description": "Thetaplane | PositionPosition left (currently occupied by yours truly)thetaplane.com\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Position"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492431,
    "description": "Zoox | Multiple cybersecurity roles, including INTERNS | Hybrid in Foster City, CA (US) | Full-time, ONSITE | Visa sponsorshipZoox was founded to make personal transportation safer, cleaner, and more enjoyable—for everyone. We will provide mobility-as-a-service in dense urban environments. We will handle the driving, charging, maintenance, and upgrades for our fleet of vehicles. The rider will simply pay for the service. In 2020, Zoox joined forces with Amazon.Job descriptions:Security technical program manager (TPM): https://jobs.lever.co/zoox/bfe394d7-5796-469b-93be-8d22f70d4... (it is not specific to the security role, my contact info below if you are interested and have questions)Cloud Infrastructure Security: https://zoox.com/careers/96b012b0-ac39-4be3-a46d-767a3c0b6b1...Cybersecurity Intern: https://zoox.com/careers/2a633467-21c2-4b87-a894-8f8e87f2b5b...These roles are on teams \"organizationally close\" to me. Apply using the links above, ask me questions via mtimchenko at our domain.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Foster City, CA (US)",
      "positions": [
        "Security technical program manager (TPM)",
        "Cloud Infrastructure Security",
        "Cybersecurity Intern"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38493527,
    "description": "Upnext | 100% Remote | Full Time / Contract | Software Eng / Design / MLAt Upnext, we are passionate about solving information overload. Every day we get bombarded with content from social networks, news sites, blogs, messages, etc. It’s hard to keep up and it’s even harder to find the content that really matters to you. It takes time and energy to sift through the noise and find what really matters. That's why we created Upnext, our flagship product that lets users easily organize reading, audio, and video content in one neat space. We’re not stopping there, our latest app helps you stay up to date on the topics and news that you care about by aggregating updates into a single place. Using our own AI models we’re building in deep personalization from the beginning so Upnext users will always have the most important updates about topics they care about. We've got open roles for:- Software developers: our tech stack is TypeScript / Node / React / Python \n- Designers: we're creating a seamless, beautiful experience across desktop, native and web - ML research / ML engineer: help us design build and deploy our first generation of recommendation and understanding systems \n- Marketing / growth: help us get the word out!If you'd like to chat, email me at joe [at] upnext [dot] in!\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Software developer",
        "Designer",
        "ML research / ML engineer",
        "Marketing / growth"
      ],
      "tech_stack": [
        "TypeScript",
        "Node",
        "React",
        "Python"
      ]
    },
    "categorized_tech": [
      "typescript",
      "nodejs",
      "react",
      "python"
    ],
    "categorized_positions": []
  },
  {
    "id": 38498262,
    "description": "Descript | Research Scientist/Research Engineer | Head of Applied AI | Remote | San Francisco, CA | Montreal, CAWe're building a cloud-based collaborative video editor and a screen recorder that transcribes and aligns your audio with text - letting you edit videos like a word doc. We have built and shipped cutting-edge AI speech technologies like voice cloning, one-click speech enhancement, etc. used by the world's top podcasters, influencers, and businesses including BBC, ESPN, Hubspot, Shopify and Washington Post.We're a team of 125 with a proven founder, and have raised $100M from some of the world's best investors like OpenAI, Andreessen Horowitz, Redpoint Ventures and Spark Capital.We're seeking exceptional researchers to join our team tackling unique, challenging, and useful problems in generative modeling, and advance the frontier of AI speech, audio, and video.https://www.descript.com/careers#open-position\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Research Scientist/Research Engineer",
        "Head of Applied AI"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": []
  },
  {
    "id": 38492737,
    "description": "Interactive Brokers | Senior Python Developer | Mumbai India | Hybrid www.interactivebrokers.com You want to break into the finance industry? You want to learn about trading and investing? Are you tired of endless meetings and just want to code? If you love designing greenfield projects in Python, this is the job for you. I am the hiring manager for the team. We are a small technology team in a fast growing, multi-billion dollar company.  Many of our larger clients are multi-national banks that you have heard of. We are seeking a self-starter that enjoys the craft of coding and developing innovative solutions. The ideal candidate is someone who can communicate well and design libraries and systems in Python from scratch. Experience with Object oriented design, design patterns, building systems, and SQL a plus. Positions are a hybrid model 3 days in office 2 days remote. IB has grown through tough economic times. We have continued to hire while others have cut staff. If you are looking for a great place to innovate, apply today. We have two positions open in our Mumbai India office. Apply Online here: https://boards.greenhouse.io/ibkr/jobs/6744937002",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Mumbai India",
      "positions": [
        "Senior Python Developer"
      ],
      "tech_stack": [
        "Python",
        "Object oriented design",
        "design patterns",
        "SQL"
      ]
    },
    "categorized_tech": [
      "python",
      "oop",
      "design_patterns",
      "sql"
    ],
    "categorized_positions": [
      "python developer"
    ]
  },
  {
    "id": 38517151,
    "description": "SINCERE | REMOTE | US + Canada (Boston HQ) | Full-Time | sincere.comWe build technology that brings you closer and helps show you care to the people who matter the most in your life. With 30+ years of combined innovation, our brands represent the leading platform for family milestones, celebrations, and memories. We are home to Punchbowl, Timehop (our recent acquisition), and Memento. Acquisition news on Built in Boston: https://bit.ly/sincere-acquires-timehopOur Company is remote with team members in multiple states/provinces. We maintain an office in Greater Boston (Framingham, MA), but in-person work will remain optional. We believe happy employees = happy customers, so we support our team with 100% healthcare coverage, virtual team coffee chats, wellness events, biannual team summits, and the freedom to step away when life calls.SR. PROJECT MANAGER: The ideal candidate has 5+ years of experience as a key member of a product team and has delivered a wide range of software applications to market. The Senior Project Manager will ensure smooth project execution across UX, engineering, and QA. In this role, you will provide overall product direction, coordination, implementation, execution, control, and completion of projects across the web and mobile platforms for both Punchbowl, Timehop, and Memento.SR. RUBY ON RAILS DEVELOPER: The ideal candidate has 10+ years of experience working with large Ruby on Rails applications. You believe that user interface details really matter, you care about creating structured and maintainable code, and you consider development your craft. Not only will you play a role in building the future of Punchbowl.com, but you will also decide how the engineering team evolves to meet the needs of our company as we grow.* Sr. Project Manager role: https://apply.workable.com/sincere/j/AB86A4DBDC \n* Sr. Ruby role: https://apply.workable.com/sincere/j/56D435D4E6 \n* What We Believe + Our Hiring Process: https://www.sincere.com/careers \n* Contact Linsey at lap@sincere.com or apply at https://apply.workable.com/sincere/\n                      \n                      reply",
    "metadata": {
      "is_onsite": false,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [
        "us",
        "canada"
      ],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "Boston, MA",
      "positions": [
        "SR. PROJECT MANAGER",
        "SR. RUBY ON RAILS DEVELOPER"
      ],
      "tech_stack": [
        "Ruby on Rails"
      ]
    },
    "categorized_tech": [
      "ruby_on_rails"
    ],
    "categorized_positions": []
  },
  {
    "id": 38491655,
    "description": "Resemble AI | San Francisco Bay Area (office in Santa Clara, CA) | Full-Time | Full-Stack Engineer, Frontend Engineer, Product Designer\nResemble AI creates high-quality synthetic voices that capture human emotion. We're a venture-backed high-growth startup that's looking to shake up an entire industry with state of the art AI. Our product changes the way that thousands of brands, media companies, creative agencies, and game studios create speech content. We believe that to build an enticing product and solid team is by encouraging innovation is by enabling continuous education. That's why every Friday is a day that you can use to work on anything you want, Resemble-related or not. We're hiring for three roles:Full Stack Engineer - Can you break the entire stack? You're the right person for this job. Work on our Rails app, with sprinkles of React, and Python for the deep learning. Everything is dockerized, and we use Kubernetes to deploy.Frontend Engineer - We're hiring a Frontend Engineer proficient in React, TypeScript, and Ruby on Rails to shape our user experience. Join our team to develop user-friendly interfaces and collaborate on building exceptional web experiences.Product Designer - As a Product Designer, you will lead the end-to-end design process, from concept to implementation, ensuring a seamless and delightful user experience. You will collaborate with cross-functional teams to define product vision, conduct user research, create visually compelling interfaces, and develop interactive prototypes.If interested, reach out directly to me: zohaib [at] resemble.ai\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": "San Francisco Bay Area (office in Santa Clara, CA)",
      "positions": [
        "Full-Stack Engineer",
        "Frontend Engineer",
        "Product Designer"
      ],
      "tech_stack": [
        "React",
        "TypeScript",
        "Ruby on Rails",
        "Python"
      ]
    },
    "categorized_tech": [
      "react",
      "typescript",
      "ruby_on_rails",
      "python"
    ],
    "categorized_positions": [
      "full stack",
      "front end"
    ]
  },
  {
    "id": 38491077,
    "description": "1 point by mmyller20 29 days ago | parent | context | next | edit | delete [–] | on: Ask HN: Who is hiring? (November 2023)Koddi | Currently seeking FT employees in the following locations: Ann Arbor, MI | Fort Worth, TX | Austin, TX or Remote Open roles: Sr. Software Engineers (Go, Java, C, C++), Integration Engineers, QA SDET, Front End Engineers and Product Managers Looking to become a major player on a diverse team? Want to make a big impact on an engineer-driven roadmap in your next career adventure? Koddi Engineers drive innovation by embracing challenges and deploying emerging technologies to solve complex problems in software development. Koddi is a global technology company with software and services that empower marketplace monetization through commerce media. Our enterprise platforms leverage first-party data to drive marketplace revenue and profit by improving user experience and target shoppers throughout the purchase path. Koddi’s platforms enable any advertiser, any marketplace, in any industry to increase awareness, generate demand, and drive revenue. Based in Fort Worth, Texas, Koddi has additional offices in New York, Ann Arbor, and Düsseldorf. Ranked by Forbes, Deloitte, and the Inc. 5000 as one of the fastest-growing companies in the nation, we’re growing rapidly and looking for innovative problem solvers to join our team. Review all open roles at www.koddi.com/careers and apply directly, or send your resume to matthew.myller@koddi.com. Please reach out with any questions. We are not currently seeking external recruitment partnerships at this time. All candidates must be based in the US and either US Citizens or Green Card holders.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": false,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": null,
        "max": null
      },
      "company_location": null,
      "positions": [
        "Sr. Software Engineers",
        "Integration Engineers",
        "QA SDET",
        "Front End Engineers",
        "Product Managers"
      ],
      "tech_stack": [
        "Go",
        "Java",
        "C",
        "C++"
      ]
    },
    "categorized_tech": [
      "go",
      "java",
      "c_cpp",
      "c_cpp"
    ],
    "categorized_positions": []
  },
  {
    "id": 38494001,
    "description": "OpenRent | London, UK | Full-Time | ONSITE+PART REMOTE | https://www.openrent.co.ukWhat sucked the last time you rented a house or flat? Come and fix it.OpenRent is a force for good in an industry tarnished by rip-off agencies. Enabled by an unrelenting focus on technology, we now let more properties than any agency in the UK. In the last 12m we let over £50 billion worth of property, to over 6 million registered users, without ever charging any admin fees.You'll be working on solving every aspect of the rental journey, from machine learning models to predict the right price of a property, to building the future of property management, all to help tenants find their dream home, and landlords their ideal tenant.We're VC backed, profitable, and have plenty of ambition to maintain our fast growth in this absolutely massive market.We have a bunch of roles available at the moment and keen to find great people like you!- Senior DevOps Engineer | Equity | 75k-100k+ (based on experience) + Quarterly Bonus- Senior Web Designer | Equity | 75k-100k+ (based on experience) + Quarterly Bonus- Full Stack Engineer (C#) | Equity | £45k-£120k+ (based on experience) + Quarterly BonusAll roles visible here: https://www.openrent.co.uk/jobsOpenRent is already impacting millions of tenants and landlords each year, join us and make every tenancy better than the last.\n                      \n                      reply",
    "metadata": {
      "is_onsite": true,
      "is_remote": true,
      "is_global_remote": false,
      "remote_only_location": [],
      "compensation": {
        "min": 45000,
        "max": 120000
      },
      "company_location": "London, UK",
      "positions": [
        "Senior DevOps Engineer",
        "Senior Web Designer",
        "Full Stack Engineer (C#)"
      ],
      "tech_stack": null
    },
    "categorized_tech": [],
    "categorized_positions": [
      "devops",
      "full stack"
    ]
  }
]